[
  {
    "date": "July 22, 2022",
    "shortDescription": "The dollar is reaching levels that haven’t been reached in nearly 20 years.",
    "path": "/blog/2022-07-22-the-rise-of-the-dollar",
    "title": "The rise of the dollar",
    "details": [
      {
        "fullDescription": [
          "It is no secret that the Corona Virus Pandemic is a situation that greatly affected all of us, worldwide. Many aspects of our lives have been impacted, including the global economy. Now, although we are currently still experiencing this pandemic, we are also experiencing the consequences of the pause there was on the economy in 2020. ",
          "The rise of the dollar has been significantly rising, particularly over the last couple of weeks, and it has become a hot topic. According to “The U.S Economy Today,” the dollar is reaching levels that haven’t been reached in nearly 20 years. “Since the start of this year, it has gained 8 percent, and in the last 12 months, it has risen 14 percent.” As we are experiencing inflation after the pandemic, due to there being a stop in production of goods, prices are now spiking in almost everything. We are also experiencing some drastic situations around the world, such as times of uncertainty with the war between Ukraine and Russia, the zero-COVID policy in China, global sanctions on Russia, soaring commodity prices, and Europe and Japan’s economic slowdown. This caused global investors to store their cash in the U.S. for “safekeeping,” which consequently contributed to the dollar to going up.",
          " The U.S. is buying more goods from other countries, which is helpful, however, this is causing things to get more expensive in other countries. As commodities such as oil and nickel are priced in dollars, this means other countries have to pay more to convert their currency into dollars to buy it. The Federal Reserve is trying to fight high inflation in the U.S, and according to the article “U.S. dollar touches 20-year high as markets shun risk,” Minneapolis President of the Federal Reserve Neel Kashkari said the U.S. bank may not get as much aid from easing supply chains as it is hoping for in helping to cool inflation. The Federal Reserve is making attempts to help lower inflation without tilting the economy into a recession, however it is expected there will be more rate hikes. It is a dangerous time for the economy, and there is speculations and chances of a recession."
        ]
      },
      {
        "writtenBy": "Written by Natalie Montoya"
      }
    ]
  },
  {
    "date": "July 14, 2022",
    "shortDescription": "Technology has become a part of our daily lives, more than we may be aware of.",
    "path": "/blog/2022-07-14-best-technology-products-in-2022",
    "title": "Best technology products in 2022",
    "details": [
      {
        "fullDescription": [
          "",
          "There are always tons of innovative products coming out on the market, and most of them are worth the hype. ",
          "Many technology products help improve our quality of life, including our health. For example, after the pandemic, many new technology gadgets have come out on the market in the fitness industry, such as the VAHA S Fitness Mirror.",
          "When people were no longer able to go to the gym, technology found a way to make the gym come to us. The VAHA S Fitness Mirror is a full-size mirror that allows you to have access to 850 workout classes all from the comfort of your home, while also providing you with personal trainers in real-time.",
          "The mirror is a 32-inch Full HD touchscreen mirror with speakers, that gives you an HD workout experience all while being able to workout from home. ",
          "Another great technological invention in the fitness industry that has come out on the market is the Therabody Wave Roller, which takes a regular foam roller and adds vibration therapy and wave-style texture to help work out all of your aches and pains. This is a great gadget for those in the fitness industry/ lifestyle, who know how painful and uncomfortable one may feel when sore. ",
          "This tool helps soothe and ease pain and discomfort, which is extremely beneficial and necessary after working out the body’s muscles.",
          "Additionally, another technology product out on the market is an electric bike that can be folded. The new GoCyle G4 electric bike differs from other electric bikes as it allows you to fold the bike, which is super convenient as it can be easily taken with you to many places. ",
          "For those who are constantly on the go and depend on public transportation, this bike can be a great investment. In addition, similarly to how there are many electric bikes on the market, there are many drones on the market. ",
          "However, a new drone has come out with never before seen features. The Skydio 2+ is a new drone that has different camera speeds, and allows you to choose different camera movements as well as different speeds. Through technology known as “Keyframe,” you can plan out routes that the Skydio 2+ will follow. ",
          "The Meeting Owl Pro, although may be considered a more simpler gadget, is one of the most efficient considering the times we are living in. The Meeting Owl Pro works for those who work remotely, which after the pandemic increased significantly. It replicates an in person meeting, while being separated from colleagues as it comes with a 360 degree camera, 8 microphones and a speaker.",
          "It also has an automatic zoom that responds to who is speaking at the time with an 18 foot audio radius integrating Zoom, Slack, and more. This is perhaps one of the most useful technological tools in my opinion, and very creative.",
          "Technological advancements are always improving and seeking new ways to improve, to make life easier. Remote work has become essential, and has transformed our lives in many ways, and through the use of technology such as The Meeting Owl Pro, it continues to keep us integrated and connected with one another, even if from a distance. ",
          "New technological advances are constantly coming out, and it is good to be informed of the latest gadgets that could potentially be useful to us.",
          "Similar to the very well known GoPro, the DJI Action 2 is gaining much popularity in the action camera market. The DJI Action 2 is water, dust, and dirt proof, and can easily be attached to a tripod, waterproof cases, a screen, and other features. It also offers 4k, 120fps footage and image stabilisation. These newest technology products out on the market are great products that offer many different services, depending on the product, all which can help facilitate your life and improve your lifestyle.",
          ""
        ]
      },
      {
        "writtenBy": "Written by Natalie Montoya"
      }
    ]
  },
  {
    "date": "July 08, 2022",
    "shortDescription": "Strategic marketing is marketing with a specific purpose and intention.",
    "path": "/blog/2022-07-08-what-is-strategic-marketing",
    "title": "What is Strategic Marketing?",
    "details": [
      {
        "fullDescription": [
          "",
          "",
          "It is marketing targeted to a particular audience or population, advertising a product or service effectively and strategically. First and foremost, when marketing strategically, one must plan; this is the very first step in strategic marketing. Here, one must develop a specific goal or objective and plan how you will execute it to reach these goals. ",
          "Planning is of utmost importance with strategic marketing, as here, one must brainstorm how to differentiate yourself from your competitors. When planning and setting goals and objectives, one must create a specific timeline and schedule to stay on task and on time; this will encourage you to meet your goals in a particular frame of time and will help you stay organized and on task. Try to ensure your goals and objectives are attainable, particularly in the time frame desired.",
          "Once you have your concrete plan, you can move on to the next step, the analyzing phase. In this step, one must research the market you are advertising for, competitors, and industry. One must also make sure there is demand for the product or service you are planning to market, so this next phase is where you conduct all your research. When researching the market, you will better understand the market field for your product or service. When analyzing the market you plan to advertise for, an essential tip is to look at competitors’ customer testimonials. When researching other’s testimonials, you can see your competitor’s strengths and weaknesses and use their shortcomings in your favor.",
          "After you have planned and researched, you can begin to develop and clearly define your product offering. Here you will build your marketing plan, and you will come up with the strategies you will use to execute your marketing plan. During this phase, you should have a set price on your product offering; you should know where your product will be sold (whether online and on what website, or in-store and what store), and lastly, how you will promote your product. However, it is essential to be aware that strategic marketing may have some obstacles. For example, strategic marketing can be expensive, as marketing campaigns, research, and advertising can be pricey. As a company, one must try to outweigh the pros and cons and decide whether strategic marketing is suitable for you and your services or products.",
          "Once you have completed these steps and sorted them out, you may begin the final step, which is implementing all your efforts after planning and researching. Strategic marketing is having all your resources in order to market your product/services in the most effective way possible. After you have a thorough idea of who your target audience is, what the value of your product is, and how to execute your marketing strategies, you should be able to meet your goal objectives set during the very initial step. ",
          "A clear understanding of a marketing strategy will allow you to reach the customer better, meet your goals and objectives, and attract more customers. Differentiating your marketing through strategic marketing is essential as this is your opportunity to stand out from your competitors and be different from the rest. Strategic marketing helps others distinguish you and your services, which is vital in the competitive market. It also enables you to understand better the industry you are engaged in, as it requires you to do some extensive research and have a thorough understanding of the competitive market of your product. If done wisely and in the correct form, strategic marketing is a valuable marketing tactic that can significantly benefit you and your business.",
          "",
          "References for “What is Strategic Marketing”",
          "",
          "",
          ""
        ]
      },
      {
        "writtenBy": "Written by Natalie Montoya"
      }
    ]
  },
  {
    "date": "June 29, 2022",
    "shortDescription": "Not only do consumers benefit from inclusivity in marketing.",
    "path": "/blog/2022-06-29-inclusivity-diversity-and-lgbtq-community",
    "title": "Inclusivity, Diversity, and LGBTQ Community",
    "details": [
      {
        "fullDescription": [
          "",
          "Not only do consumers benefit from inclusivity in marketing, however companies and brands are also able to expand their consumer market as well as they reach and target more groups in their advertisements. June, which is considered the month of Pride, is the month where  not only do we celebrate the rights of the Lesbian, Gay, Bisexual, Transgender, and the Queer community, however, companies have the opportunity to demonstrate their support for the community and inclusivity in their marketing strategies.",
          "",
          "Here are some ways in which we can all support the LGBTQ community through marketing in branding. It is important to remember, however, that more important than justmarketing, your company practices what they preach, and treats everyone with inclusivity and equality as well. Your company can be an ally to the LGBTQ community by,"
        ]
      },
      {
        "writtenBy": "Written by Natalie Montoya"
      }
    ]
  },
  {
    "date": "April 26, 2023",
    "shortDescription": "It is a methodology that focuses on understanding and providing solutions to the real needs of users",
    "path": "/blog/2023-04-26-what-is-design-thinking",
    "title": "What is Design Thinking?",
    "details": [
      {
        "fullDescription": [
          "What is Design Thinking?",
          "It is a methodology that focuses on understanding and providing solutions to the real needs of users, which is why it is also known as human-centered design. It seeks to address challenges, or complex problems to define and solve, while facilitating their solution and the design and development of products and services of all kinds. For this reason, it utilizes innovation, creativity, and motivation of the team as a base foundation.",
          "It is a non-linear process, in which you can take steps backwards or forward at any time if you have the adequate tools and techniques necessary to guide you. It can help you enhance creativity and analysis, and discover the insights that will make your project successful.",
          "",
          "EMPATHY PHASE:",
          "It seeks to reach a deep understanding of the needs and environment of the users involved. We must be able to put ourselves in their shoes to be able to generate solutions consistent with their realities.",
          "To reach an understanding of potential clients/users, the use of some techniques is suggested, such as: Interviews; 5w's; Ethnography; Observation; Moodboard; Focus Group; Etc.",
          "DEFINITION PHASE:",
          "We filter the information collected to keep the valuable findings that lead us to see interesting new perspectives based on the demands and needs of the user.",
          "After identifying the problem or challenge, we proceed to define and validate it with the target; remember that it is based on this that we will seek key and innovative solutions.",
          "IDEATION PHASE:",
          "Its objective is the generation of endless options. We shouldn’t stay with the first idea that comes to mind. In this phase, methods that favor expansive thinking and the elimination of value judgments are used. Sometimes the most outlandish ideas are the ones that generate visionary solutions.",
          "It is a stage of creativity, innovation and pure and hard realism. The challenge is creative, to put the minds of the team to work. Space, ideas, tools, materials and all kinds of utensils are required.",
          "PROTOTYPING PHASE:",
          "In this stage we turn ideas into reality. Building prototypes makes ideas tangible and helps us visualize possible solutions. In addition, it reveals elements that we must improve, refine, or change before reaching the final result. The goal is to achieve a mockup or prototype as close to the reality of the desired solution. This way we can later validate it, and perhaps more importantly, that it meets the initial needs of your target audience.",
          "TESTING PHASE:",
          "During the Testing phase, we will test our prototypes with the users involved in the solution we are developing. This phase is crucial, and it will help us identify significant improvements, bugs to resolve, possible shortcomings, and more. During this phase we will evolve our idea until it becomes the solution we are looking for."
        ]
      },
      {
        "writtenBy": "Written by Melisa Torres"
      }
    ]
  },
  {
    "date": "March 22, 2023",
    "shortDescription": "We will review three concepts related to technology and the future digital",
    "path": "/blog/2023-03-22-chatgpt-metaverse-and-nft",
    "title": "ChatGPT, Metaverse and NFT",
    "details": [
      {
        "fullDescription": [
          "In this document, we will review three concepts related to technology and the future digital ChatGPT (AI), NFTs, and Metaverse. We will also see some examples related to one of these, which plays a lot these days.",
          "ChatGPT",
          "ChatGPT is a next-generation natural language processing artificial intelligence (AI), created by OpenAI. This technology allows users to interact with a virtual entity that can understand and generate human language similar to a person.",
          "ChatGPT's architecture is based on natural language processing and machine learning models.",
          "NFTs",
          "NFTs (non-fungible tokens) are unique digital assets that can be bought, sold, and owned. Each NFT represents exclusive property, meaning it cannot be exchanged for something else of equal value. NFTs have become a popular way to collect artwork, music, and other digital content. The architecture of NFTs is based on blockchain technology, which is a distributed and secure database that allows the creation and exchange of unique and unrepeatable digital tokens.",
          "Metaverse ",
          "The metaverse is a term used to describe a shared virtual universe in which users can interact with each other in real-time. The metaverse has the potential to become a new form of socialization and commerce, as it allows people to meet and engage in activities in a virtual environment.",
          "The Metaverse architecture is based on virtual and augmented reality technologies, as well as online social interaction.",
          "ChatGPT focuses on automating tasks that previously required human intervention, and NFTs focus on the ownership and value of unique digital assets. The metaverse for its part focuses on social interaction and the creation of a virtual universe.",
          "In short, ChatGPT, NFTs, and Metaverse are innovative technologies that have the potential to change the way we interact and do business online.",
          "",
          "ChatGPT and the rise of AI today",
          "We have been hearing a lot recently about chatGPT and the impact it is having due to its natural way of interacting as if we were interacting with a real person through a chat.",
          "At the end of 2022 and the beginning of 2023, we have seen how AI has taken on a new impulse after the release of the tool created by OpenAI.",
          "There are many competitors in this field such as Google, Microsoft, and Apple that have seen how chatGPT is positioned in the market and how many companies want to use this tool.",
          "The Redmond company (Microsoft) has even made a large investment in OpenAI to allow chatGPT to be integrated into its search engine (Bing)",
          "Daily uses",
          "In the world of technology, there is a lot of scattered information about specific topics which sometimes generates more doubts and concerns.",
          "Not long ago I started the task of reviewing and making use of this tool (ChatGPT) to solve some doubts or to remember necessary concepts in the work I was doing and to determine how useful it could be on a day-to-day basis.",
          "It is no secret to anyone that one of the most used tools to solve doubts in the field of technology is stackoverflow.com, which helps us find solutions to problems that people have had to face at a certain time.",
          "Stackoverflow has a very large community and someone has already faced a technical challenge before and they have been able to provide a solution and other people do not have to \"reinvent the wheel.\"",
          "Sometimes there are many answers and they are all different according to the errors presented by each person and each technology and/or specific version that sometimes the solution does not seem to be adequate and even generates more consultation time.",
          "At this point, I found that chatGPT can serve as an ally.",
          "By asking a certain question and with some criteria we can obtain a concrete answer and a more efficient search which can include specific steps including points to take into account.",
          "During a \"chat\" conversation, you can even continue asking about the same topic but in more detail and it provides answers in the same context as the initial question.",
          "Example: When asking for a DB configuration in an operating system. chatGPT responds to things like:",
          "1. Open Terminal",
          "2. Run with system administrator permissions",
          "3. Run",
          "4. Remember to change certain parameters",
          "5. Close connection",
          "",
          "But if I write: “Now this other error is appearing:”",
          "The answer will be connected to the original question.",
          "If you still get the error when trying to execute these commands then check",
          "1. Have the execution permissions",
          "2. Check that this parameter is being assigned",
          "3. If you have not assigned certain permissions before then you can execute <comando>",
          "",
          "These other steps above using a browser on some page like StackOverflow would have required me to enter several of them reviewing responses from various people with problems very different from what is really required.",
          "Integration with VSCode (CodeGPT)",
          "This Visual Studio Code extension allows you to use the official OpenAI API to generate",
          "code or natural language answers to your questions from GPT3 or OpenAI ChatGPT, directly inside the editor.",
          ""
        ]
      },
      {
        "writtenBy": "Written by Juan Torres"
      }
    ]
  },
  {
    "date": "March 14, 2023",
    "shortDescription": "One of the tools we use today, generally known as the web",
    "path": "/blog/2023-03-14-the-internet-throughout-the-years",
    "title": "The Internet Throughout the Years",
    "details": [
      {
        "fullDescription": [
          "The web, also known as the internet, is an amazing tool that many of us have had the opportunity to use. This great creation was invented by Timothy John Berners-Lee, a British computer scientist, in the year 1989. The internet has had a huge impact on us worldwide, and has gained much popularity throughout the last decades. Today, the vast majority of us use the internet for many different purposes, such as communicating with others, learning, researching, shopping, entertainment, and much more.",
          "",
          "The Internet has gone through many different changes which has allowed it to remain at the leading edge for more than 33 years. People use the web daily for many different things such as for research, to browse, and to learn new information. It is a utility many of us have been fortunate enough to have available to use to our advantage, and has allowed us to learn many new things. As a graphic designer, I can personally confirm that the web has allowed me to attain many new abilities, and has taught me many new things. It has allowed me to express my creativity, and many of us can obtain an income from our capabilities taught by using the web.",
          "Navigating the web has become much more accessible as time goes by, however, it was born like most of us, inexperienced. The internet was born many years before the first website was created, and as time goes by, we gain more knowledge of it, and it has become easier to use. Before, the internet seemed to be something only younger generations had knowledge of, now however, even older generations have been able to learn how to navigate the web. We could say that we already live in the future, but the web went through a long process before getting this far. Many progressions have been made, and between the years 1995 and the early 2000’s, we were introduced to the JavaScript language, Java, and also new mechanics such as animations and videos on the web.",
          "",
          "In the beginning of the year 2000, we were also introduced to search engines such as Safari and Chrome, that allow the use of the web on portable devices such as cellphones and tablets. The calendar was also implemented, as well as the introduction of 3D design and tactile devices.",
          "",
          "The internet continues to improve and evolve as time goes by. The social media platform known as Facebook, was the ultimate trending topic when first released. Afterwards, many other social media platforms were created such as Instagram, Twitter, Tinder, Whatsapp, TikTok, and many more. Through the use of these social media platforms and apps, we have been able to stay connected to one another across the globe, and are able to stay informed and in touch with people thousands of miles away. The creation of the internet has changed our lives forever, and there is no going back. It is constantly changing and evolving, and we can only wait and see where it will take us in the future."
        ]
      },
      {
        "writtenBy": "Written by Gustavo Arias"
      }
    ]
  },
  {
    "date": "March 07, 2023",
    "shortDescription": "As a society, we become so invested in earning money, however",
    "path": "/blog/2023-03-07-learning-to-budget-this-2023",
    "title": "Learning to Budget this 2023 ",
    "details": [
      {
        "fullDescription": [
          "As a society, we become so invested in earning money, however, learning to budget our money is just as important, if not more.",
          "If you are a beginner when it comes to budgeting money, here are a few helpful tips that can get you started. If you become organized enough with your finances, you can even start your own savings account, which would be the ultimate goal. ",
          "First and foremost, however, you need to get organized and hold yourself accountable for your spending habits: ",
          "Start off by making a list of your goals, and what it is you want to ultimately achieve. Do you want to save up for something you’ve been wanting? A vacation, a new expensive purchase? Next, take a look at your income, and see how much of your income you must spend on necessities first. Get organized by planning how much money you are spending on bills such as your internet, phone, groceries, rent, car utilities, and more. ",
          "After you have taken a look at how much you must spend on your obligations, you can then move on to look at whether you have any pending debts you must pay off. ",
          "The popular suggestion is to make sure you are spending 50% of your income on your needs, 20% on savings and any pending debts, and 30% on anything else you might want such as leisure activities and pampering yourself. There are plenty of online resources and applications that can help you get organized as you budget your expenses. Take a look at how much you are spending on eating out, or on clothes. If you find yourself tight on money by the end of the month, figure out how much less you should spend on things such as these, so you can use your money more wisely. ",
          "Set up a goal of how much you want to save each month, even a small amount of money saved a month can gather up in no time. Adjust your lifestyle to make sure you are living according to your income. Having separate accounts also makes saving easier, in which you can place the amount of money you want to save monthly. ",
          "Lastly, but I would say most important, is to track your spending. After you have set up how much money you can spend on each category, make sure to keep up with it. For example, after you’ve gone grocery shopping, subtract the amount you’ve spent from the total monthly grocery shopping budget. This way you can see how much money you have left to spend on your next grocery trip, and so on. It might seem difficult at first, but it will get easier as you learn. ",
          "Once you have learned to track, you can then make any further adjustments. If you see one of your monthly bills is higher than it usually is, then adjust your expenses and spend less on a different category. ",
          "Tracking will help you stay on track with your monthly budgeting expenses and will hold you accountable for what you are spending, while also preventing you from overspending. ",
          "Learn to take charge of your finances, and start saving for that big purchase or vacation you’ve been dreaming of!",
          ""
        ]
      },
      {
        "writtenBy": "Written by Natalie Montoya"
      }
    ]
  },
  {
    "date": "February 21, 2023",
    "shortDescription": "A responsive web design is one that is capable of adapting to different screen",
    "path": "/blog/2023-02-21-basic-best-practices-for-responsive-web-design",
    "title": "Basic Best Practices for Responsive Web Design",
    "details": [
      {
        "fullDescription": [
          "",
          "A responsive web design is one that is capable of adapting to different screen sizes, the system detects the width of the screen and from there it adapts all the elements of the page, from the font size, to the images and texts. Menus offer the user the best possible experience.",
          "Below I'm going to share some basic tips to make a good responsive design.",
          "",
          "Set the viewport",
          "HTML5 introduced a method to let web designers take control over the viewport, through the <meta> tag.",
          "You should include the following <meta> viewport element in all your web pages:",
          "This gives the browser instructions on how to control the page's dimensions and scaling on the base of the width of the device's screen.",
          "In addition to setting an initial-scale, you can also set the following attributes on the viewport:",
          "When set, these can disable the user's ability to zoom the viewport, potentially causing accessibility issues. Therefore, we would not recommend using these attributes.",
          "",
          "Size content to the viewport",
          "If the user is forced to scroll horizontally, or zoom out to see the whole web page, it results in a poor user experience.",
          "Percentage units will allow elements to be fluid. Setting minimum and maximum widths can be helpful, but don't go smaller or bigger than its container.",
          "Use Media Queries based on viewport size",
          "Media queries allow us to create a specific style for different screen resolutions. In most cases, only three viewports are considered:",
          "But there is a wide range of resolutions, so what this tells us is that we should consider all of them when thinking about responsive web design.",
          "",
          "Make Layouts Flexible/Adaptive",
          "Layouts should be flexible , they need to naturally adapt as the browser resizes.",
          "Modern CSS layout techniques such as Flexbox, Grid Layout, and Multicol make the creation of these flexible grids much easier."
        ]
      },
      {
        "writtenBy": "Written by Erik Beltran"
      }
    ]
  },
  {
    "date": "February 14, 2023",
    "shortDescription": "When applying for a job, there are many skills that are taken into account.",
    "path": "/blog/2023-02-14-the-importance-of-confidence-in-the-workplace-and-in-life",
    "title": "The Importance of Confidence in the Workplace & in Life ",
    "details": [
      {
        "fullDescription": [
          "When applying for a job, there are many skills that are taken into account and into consideration, especially considering the position one is applying for. Confidence is a skill that may take time to develop and achieve, however, it is not impossible. Outside of the workplace, confidence is also very important and can come in handy in many other situations in life. Confidence can help you succeed in aspects of your life such as in love, in obtaining things you want, in relationships, and in your career. Many entrepreneurs have started empires because they had the confidence and believed in themselves. When trying to achieve something we want, we must trust that we are capable of reaching our goals. Although confidence is necessary, it is obviously not the only thing needed when it comes to reaching your goals, but it’s a great place to start. When one has a defined personality, it is less likely that people will undermine you. This is why it is important to know exactly what you want, and to voice your opinion when needed. Being unapologetically ourselves shows others we believe in ourselves, and demonstrates confidence. In addition, when we demonstrate to others that we lack confidence, this weakens your image of self worth and allows for others to make you feel less.",
          "So how do we build and gain confidence, you may ask? Well first of all the work must be done by ourselves, we must recognize our strengths and learn how to be assertive. We must work on our mindsets, and have a growth mindset in which we aspire for improvement. People with a fixed mindset, who believe that their abilities are fixed from birth and that success is related to other factors, are less likely to believe that their own hard work can help them reach success. Learning to say no to others and to stop people pleasing is an important part of being confident as well. When we create boundaries, and do not let others walk all over us, you show others you are confident, in a tactical and polite manner of course. Your self image and self care also play a major role when it comes to being more confident. If you feel and look good, others will perceive that as well. Invest in your personal hygiene, your wardrobe, and make sure to look presentable. Exercise and personal groom can greatly contribute to making us feel better about ourselves. When trying to be confident, one must try to be careful of not coming off as arrogant, as there is a fine line between confidence and arrogance.When someone is confident, they believe in themselves and know their abilities. On the other hand, someone who may come off as arrogant, is someone who believes their abilities and knowledge make them superior to others, and this is not the goal we are trying to achieve. ",
          "Moreover, building healthy relationships can significantly impact our confidence level. As humans, healthy relatioships with others can help our levels of happiness, and our confidence as well. Avoiding relationships that may be considered unhealthy is important, as they can be emotionally draining. Lastly, not being afraid of trying new things and challenging yourself is a great way to build confidence. By learning new skills, and overcoming fears such as going out to eat alone or going to the movies alone, you are showing yourself you are capable of overcoming a challenge, and can help you significantly. All of these skills, if practiced correctly, can help you gain confidence in life, and in your careers. Having confidence is a great skill to have that can guide you in many right directions, and can help you with your communication skills as well. "
        ]
      },
      {
        "writtenBy": "Written by Natalie Montoya"
      }
    ]
  },
  {
    "date": "February 07, 2023",
    "shortDescription": "Should graphic designers have a career focused on a single skill.",
    "path": "/blog/2023-02-07-is-the-evolution-of-design-pushing-us-aside",
    "title": "Is the evolution of Design pushing us aside?",
    "details": [
      {
        "fullDescription": [
          "In order to become a graphic designer, one usually must attend a prestigious school, or simply become well equipped and prepared. This however, is what designers may least have in common. It is no surprise that the more you educate and prepare yourself, the more you are able to obtain knowledge. However, we may ask ourselves, should graphic designers have a career focused on a single skill, or should we focus on having multiple?",
          "Why do we study graphic design?",
          "Among all the professional careers you can pursue, design is constantly being updated as it can still be considered a relatively new profession. It started at the end of the 19th century, and its evolution has allowed artists to experiment with different techniques and design processes. This led to what we now know today as the current modern design.",
          "The desire to stand out, to express ourselves as artists, or simply as a way of expressing our emotions through artistic expression, have all led us to decide to work in the world of design.",
          "We went from painting rocks, to printing with stencils, to finally dedicating ourselves completely to digital work. Throughout all these years, the concept itself has been reinvented more than a dozen times, and artists and professionals may usually come back to the same dilemma that can cause them to even take a break from their professional career. This is whether or not a graphic designer should obtain knowledge on many topics in his career, or solely focus on just one.",
          "Definite artist or an all-rounder in the profession",
          "If you are born with a gift, whatever it may be, you should dive into the profession without any hesitation. Once you have discovered your gift, you should try to exploit it, such as by capturing your art through works that can display or sell quickly. Although this may not always be the case, considering we live in a world where we all want to stand out, and therefore there is a lot of untapped and exploited talent.",
          "Another aspect one must consider in this field, such as in many, is overworking and exploitation from companies. Not all workspaces have to ask you to go the extra mile, put on your shirt, or work for collective productivity. So you must know how to identify when this happens and take it as a clear alarm when a change in your work environment is necessary.",
          "",
          "My experience",
          "During my long journey as a graphic designer, I have had the opportunity to learn and teach an infinite number of skills, from managing an app to resolving situations in real-time, as well as operating machines that allow us to deliver a job or product. Finally, being in a world that advances in favor of technology, we must evolve with it and learn more every day. We must stay at the forefront, stretch out our hands towards what we once thought was impossible, and bring on technology in peace.",
          "",
          "Learn from innovation, don't swim against it",
          "It is no surprise that we are constantly being flooded with more and more apps everyday. At first glance, it may be intimidating and may seem like they are going to replace humans in the long run with advances such as AI, rendering, and 3D printing. It is also no secret to anyone that artists and designers can feel threatened and even left behind by these new technologies, as these machines claim to be able to not only to do our job, but to do it even better than us.",
          "We as professionals, empirical or street artists, are trained to innovate together with them, learn how they work, and apply it to our works; which can only lead to one thing: survival.",
          "Red or blue pill?",
          "Should we focus on learning and improving a single skill, or should we learn more than we should in order to offer a wide range of services and products? From my experience, the designer should make the decision, and it is only up to him. You can learn along with new technologies, expand your portfolio and experiment with new techniques, increase the level of knowledge you store on your hard drive (yes, your brain) and nobody can tell you how much information you should include in it. This is something we must take into account to work in a company, or in daily life itself. After all, you may never know when you will need that acquired knowledge you have stored in the long run."
        ]
      },
      {
        "writtenBy": "Written by Gustavo Arias"
      }
    ]
  },
  {
    "date": "January 31, 2023",
    "shortDescription": "As a senior developer it was a big upgrade to go into the action immediately",
    "path": "/blog/2023-01-31-my-experience-at-parrolabs",
    "title": "My experience at Parrolabs",
    "details": [
      {
        "fullDescription": [
          "My early experience was in companies that hire their developers for their own projects, and this was my first time in a company working as an outsourcing developer. Initially, I was afraid of what kind of customers we were going to work for, how I would handle the work schedule, and many other concerns I had from my previous positions.",
          "Once I started working at Parrolabs, I got directly involved with the customer. As a senior developer it was a big upgrade to go into the action immediately; all the administrative tasks of being new in a company were already solved.",
          "When you work for a company that allows you to handle your own schedule, it is quite challenging as you need to be very disciplined, however, this pushes you to have better habits.",
          "The project I am currently working on is for a company in California. The people there are very humane and kind, and they are culturally aware. They are sensitive to the fact that I have good English speaking skills, however I am not native, and they do not mind repeating or making their requirements more specific when we have meetings, that are typically on a daily basis.",
          "I am very grateful to work for the customers we have at Parrolabs, as I have a purpose here and day by day I feel useful and allowed to do the job at my own pace. I am also given the opportunity to provide value and results to our customers, and have been able to learn new things, even with technology I have been using for more than 10 years. Working for this company has been a great experience and never fails to stop surprising me."
        ]
      },
      {
        "writtenBy": "Written by Uriel Moreno"
      }
    ]
  },
  {
    "date": "January 16, 2023",
    "shortDescription": "SEO stands for Search Engine Optimization, and it’s basically a technique that can help you",
    "path": "/blog/2023-01-16-what-is-seo-and-why-is-it-important",
    "title": "What is SEO and Why is it Important?",
    "details": [
      {
        "fullDescription": [
          "When trying to write a good and successful copy, there are many factors to consider. Paying attention to content length, including a call to action, being persuasive, and more, are all important when trying to write a successful copy. However, the ultimate purpose and intent of your copy should be to get yourself noticed as much as possible, as a popular phrase once said, “any publicity is good publicity.” This is where SEO comes in handy, and can help your copy reach that next step. So, what exactly is SEO, and what does it stand for? SEO stands for Search Engine Optimization, and it’s basically a technique that can help your website rank higher in the search engine results pages. SEO helps increase the visibility of your website or product, in order to get more people to view your product and perhaps more people interested in buying your product or service. Search engines such as Google, Bing, and Yahoo, utilize bots that specialize in collecting information that can help you find exactly what you are looking for when searching for something online.",
          "Keyword research is vital in Search Engine Optimization, as the use of keywords helps with ranking higher in search engines in order to increase the flow of traffic to your website. So, you might be wondering what are keywords exactly, and how they relate to Search Engine Optimization. Keyword optimization is specific words that are analyzed and selected to target and help drive the qualified audience you are looking for from search engines to your website. Target keywords are extremely important, as choosing the correct keywords plays a huge role in your internet marketing, and are words that sum up everything on your website, including images, copy, video, etc. There are four main categories in which keywords can be summed up, which are commercial keywords, transactional keywords, informational keywords, and navigational keywords. Informational keywords are keywords used when searchers look for an answer to a specific question or general information. Navigational keywords are keywords used when searchers intend to find a specific site or page. Commercial keywords are keywords used when searchers look to investigate brands or services. And lastly, transactional keywords are keywords used when searchers intend to complete an action or purchase. More importantly, choosing the keywords your customers are looking for will help drive them to your website.",
          "There are plenty of keyword optimization tools and resources that can aid and guide you in searching for the most popular keywords, that are also the least competitive. The Free Keyword Tool is a website that can help you find some of the most suitable keywords for you and your website. Other websites that can guide you are websites such as Keyword Research Guide, Ubersuggest, Keywordtool.io, and more. Start your keyword research today in order to get the most out of your Search Engine Optimization, and introduce more customers to your website and products and services now."
        ]
      },
      {
        "writtenBy": "Written by Natalie Montoya"
      }
    ]
  },
  {
    "date": "January 02, 2023",
    "shortDescription": "With 2022 coming to an end, many of us are looking forward to the new year",
    "path": "/blog/2023-01-02-incorporating-technology-into-our-2023-goals",
    "title": "Incorporating Technology into Our 2023 Goals",
    "details": [
      {
        "fullDescription": [
          "With 2022 coming to an end, many of us are looking forward to the new year and a fresh start. We are closing chapters and starting new beginnings while looking for ways to improve ourselves, hence the saying “New year, New Me.” Luckily, technology is a great aid in self-improvement and is something many of us already use on a daily basis. We can incorporate technology into many aspects of our lives in order to achieve new year goals such as fitness goals, financial goals, mindfulness goals, and many more. These goals are goals a grand majority of us set and strive to achieve when coming into a new year, however, studies have shown that not many of us actually achieve these goals once the year has come to an end. Why you may be asking? Well, because these goals aren’t specific, rather they are goals that can be considered far-reaching.",
          "If you are like the vast majority of the population, one of your New Years' resolution goals is perhaps to lose weight. First and foremost, this goal is more attainable if you set a specific goal weight you hope to achieve. For example, think of a specific number you’d like to reach, and then make your plan to execute it. Your weight goal number should be specific, and this will aid you much more in your weight loss journey. Once you have committed to a number, you can then look for apps that can help you achieve your goals. Think of a number of daily walking steps and aim to reach that number every day. Plan and cook more meals at home and plan how many meals you can eat out per week. Set limits with alcohol and cigarettes if you drink or smoke, such as only drinking and smoking on the weekends, and work towards those goals. Tons of devices can help you count your daily step count such as an apple or Xiaomi watch, and many apps available on the app store which allow access to influencers in the fitness industry with tons of workouts and food recipes, all from the convenience of your very own phone.",
          "Moreover, now that we have stated that to reach our fitness goals we must be specific in creating these goals, financial goals are something that many of us also struggle with and strive for when thinking of our New Years’ Resolutions. First and foremost, we should define our financial goals before anything. Set measurable, clear goals, and specific time frames to help keep you on track. Write down your goals, such as “I want to save for my retirement plan,” and install a savings app on your phone that can help you plan how much you can save per month. Try to track how much you are spending, and use banking apps that can help you track your spending habits. These applications allow you to separate your spending habits into categories such as utilities, rent, groceries, grooming, and more. There are tons of apps and resources available to help guide you into the new year, and help you reach all those New Year Resolutions goals with technology.",
          ""
        ]
      },
      {
        "writtenBy": "Written by Natalie Montoya"
      }
    ]
  },
  {
    "date": "December 27, 2022",
    "shortDescription": "Personal growth and development are vital in order",
    "path": "/blog/2022-12-27-personal-growth-and-development-this-new-year",
    "title": "Personal Growth and Development this New Year",
    "details": [
      {
        "fullDescription": [
          "Personal growth and development are vital in order to reach your desired goals. There are many ways to become the best version of yourself, however, it is a gradual process that does not happen overnight. Everyone’s personal growth and development processes look different, as we all have different values and long for various things, however, there are methods we can all use in order to try to help us accomplish those desired goals. Strategizing yourself and organizing specific, small, and attainable goals first is crucial in order to execute a big overall goal. It helps to visualize your exact goal, write it down, and manifest it as much as possible. This is why vision boards are popular and many would say effective, because they allow you to have a clear direction on what you want to achieve. Visualizing is the first step before manifesting, and should be done in a strategic manner.",
          "Establishing a clear set of goals is fundamental when trying to reach personal growth and development, however, there’s much more one can do in the process. Becoming emotionally intelligent is also something to take highly into consideration, as being able to understand your feelings and emotions can also greatly help you improve and grow on a personal level. Having control and a thorough understanding of one’s thoughts and emotions, and being able to act accordingly in certain situations is essential, and can really help you in your personal growth processes. In order to acquire emotional intelligence, one can read literature, begin journaling, seek a guidance counselor or life coach, examine how one reacts in stressful situations, and take responsibility for your actions. Acquiring emotional intelligence is a lifelong process that one must try to work on every day to see gradual progress.",
          "Another aspect one may take into consideration when trying to grow and develop personally is acquiring social skills. Being able to communicate and engage with others is also a fundamental skill that can help you get further ahead in life. Learning how to communicate with others, having confidence, and the ability to socialize in different social settings with different people is vital. In addition, learning a new skill can also aid in your personal growth and development process, as learning new skills comes with learning new knowledge. By acquiring new skills, you are opening yourself up to new opportunities and possibilities. Lastly, physical health is also something to highly consider when working towards personal goals and development. When one is physically active and healthy, this can aid you mentally and emotionally, make you feel and look better, therefore giving you more confidence as well. A healthy body cultivates a healthy mind, so nutrition, sleep, exercise, and meditation are all things to work on when working toward your personal wellness and development goals.",
          ""
        ]
      },
      {
        "writtenBy": "Written by Natalie Montoya"
      }
    ]
  },
  {
    "date": "December 20, 2022",
    "shortDescription": "Technology has facilitated many aspects of our daily lives...",
    "path": "/blog/2022-12-20-apps-to-use-in-your-daily-life",
    "title": "Apps to Use in Your Daily Life",
    "details": [
      {
        "fullDescription": [
          "Technology has facilitated many aspects of our daily lives and continues to do so through its daily advancements. Many apps have been made with the purpose of helping organize and structure our routines, plan ahead, and schedule our events. One of the best apps we have incorporated into our daily lives here at Parrolabs is ClickUp, an app that allows you to manage all your tasks in the most efficient way possible. With its To-Do list option, In Progress, and Completed, this app helps coordinate and arrange all your assignments in an organized manner. In addition, it has a calendar view, where you can see daily tasks, weekly tasks, and monthly tasks. Clickup also helps break down tasks into detailed checklists, and goal checklists, that you can check off once completed. Collaborate with other team members and coworkers, where you can all see what tasks are designated to whom, and when they are due. Moreover, you can set reminders, set specific due dates, add thorough details and descriptions, attach files from the internet, and even work in offline mode when you don’t have access to the internet.",
          "Another great app that has facilitated working remotely here at Parrolabs is Slack, which allows businesses to work together as a unified team. This app is a game-changer if you are looking to communicate with your team in a fast and organized fashion, without the need to email or call one another. This app allows you to attach files, video call, and makes communication a breeze for everyone. It also gives you the option to have multiple group messages, so you can organize your team messages in an easy manner. For example, you can have one channel for your entire team and all of your coworkers, and you can have a separate channel with only a few of your colleagues. This is a great option to keep information and tasks organized.",
          "By opening up a Gmail account, you can have access to many amazing tools such as these. Not only are they free, but, they also come with other cool features such as your own customizable email, which allows you to incorporate your company name in the email, it also comes with data storage “in the cloud,” which means your documents are always available anywhere you can get online with a web browser. With Google Drive, you can easily store your files in a secure manner and you can edit them from any device using Google Drive. Google Drive can also protect your files from suspicious activity and against malware, making it a very efficient app to use, especially within your company. Like the other few apps previously mentioned, this app allows for teamwork and collaboration with all of your employees, colleagues, and even your customers. These apps have made working with one another in the workplace much easier, organized, and have helped facilitate collaboration within your team.",
          ""
        ]
      },
      {
        "writtenBy": "Written by Natalie Montoya"
      }
    ]
  },
  {
    "date": "November 23, 2022",
    "shortDescription": "With technology taking over today’s times, digital marketing is the new desirable marketing method.",
    "path": "/blog/2022-11-23-the-power-of-digital-marketing",
    "title": "The power of digital marketing",
    "details": [
      {
        "fullDescription": [
          "With technology taking over today’s times, digital marketing is the new desirable marketing method. With tons of digital marketing strategies to choose from, it is essential to stay up to date with the best marketing trends and techniques, especially if you have a company with a brand or product you are trying to sell.",
          "Digital marketing is any type of marketing that utilizes some sort of electronic device in order to advertise or promote a product or message. It usually appears on a computer, tablet, or phone, and even extends to television, although this is sometimes still considered traditional marketing. In previous times, marketing such as magazines and billboards took over the marketing industry, however, the internet has allowed us to use many different platforms and methods of marketing to get a message across to a wide variety of people and large audiences.",
          "Search engine marketing, social media, search engine optimization, and keywords, are all methods that the internet has allowed us to use in order to get a message across to as many people as possible. These methods allow for a bigger flow of traffic and visibility to your website or advertisement, and as a very large amount of people around the world use the internet on a daily basis, it is important to utilize these digital marketing strategies.",
          "Pay-per-click marketing for example is a form of digital marketing in which instead of paying a set amount of money to constantly run ads online, it allows you to only pay when someone clicks on your digital advertisement. Through the use of popular search engines such as Google, companies use google ads when using pay-per-click advertising. The better quality your advertisement is, the more relevant keywords it has, and the better the landing page quality, the more likely your ad is to be placed at the top of the search engine results.",
          "Another digital marketing method you should consider keeping in mind is affiliate marketing. Affiliate marketing is a type of marketing that allows others to gain income by promoting someone else’s business. ",
          "It is using a promoter to advertise your business, and giving someone commission when someone purchases an item from the promoter. Through the use of digital platforms that connect both the affiliate and the merchant, you can make your product appealing to promoters who can help you sell your product. Another great form of digital marketing is known as Influencer Marketing. ",
          "This form of marketing is similar to affiliate marketing, as it uses someone else to promote your products or services. Influencer marketing works with someone who may be well known, have a large platform or following, and can endorse your product. When using this form of marketing, it is important to make sure the influencer you are using is someone you want related to your business. ",
          "As they are essentially promoting your brand, they represent your brand, and if not chosen wisely, they can sometimes hurt your brand more than favor it. In addition, Native Marketing is another form of paid digital advertising, and it advertises discretely by trying to blend in with its surrounding content.",
          "Native ads label their advertisements with words such as “sponsored” or “promoted,” and they aim to match the content of the media source they are being promoted on. For example, an ad on Youtube may perhaps advertise something that is related to the content someone is searching for, and may appear in recommended videos. Lastly we will discuss marketing automation, which uses software to handle routine marketing tasks without the need for human action, and instead does things automatically. Marketing automation can handle marketing tasks without the need of a sales team, and this is what makes it so efficient. This allows for employees to be freed of certain tasks, and can also reduce human error while maximizing efficiency. Digital marketing has facilitated marketing in many aspects, and can target audiences effectively through multiple marketing strategies. This is why it is crucial for marketers to be up to date with all the multiple forms of digital marketing, to improve their methods of marketing and reach as many people as possible.",
          ""
        ]
      },
      {
        "writtenBy": "Written by Natalie Montoya"
      }
    ]
  },
  {
    "date": "October 18, 2022",
    "shortDescription": "We understand by cyber security the strategies and actions carried out by a company or individual",
    "path": "/blog/2022-10-18-what-you-should-know-about-cyber-security",
    "title": "What you should know about Cyber Security",
    "details": [
      {
        "fullDescription": [
          "When talking about cybersecurity, it is generally associated with cyberthreats and cybercrime, however, cyber security also has to do with good practices implemented in order to protect information. In addition, cyber security is also used to prevent or detect cyber attacks to which any organization or person is exposed to. We understand by cyber security the strategies and actions carried out by a company or individual to protect and defend their digital assets from possible cyber attacks, such as theft of information and control of devices.",
          "It is not only necessary to protect computer equipment, however network connections as well. Any technological device can and should be protected against these possible threats, especially if they have access to personal, banking, or company data.",
          "How to prevent computer attacks?",
          "Cybercriminals operate covertly and are often difficult to detect, so it can take a long time before problems are visible to the organization. For prevention and early detection, keep these following tips and good practices in mind.",
          "",
          "1. Avoid threats through emails",
          "E-mails are one of the weakest points of a company, because through them virus threats and information theft can be easily introduced. Many companies may believe that these emails are not dangerous and ignore the activity of internal emails, and can then become victims of data hijacking.",
          "For this reason, we recommend that you periodically monitor the activity of suspicious messages. In addition, you should also monitor the downloads of attached files and educate your company's personnel on the proper use of this medium so that it is used for work purposes, and to alert the company in case of suspicious mail.",
          "",
          "2. Detect malicious codes early",
          "It is common for these codes to be hidden in PDF, Html, GIF and Zip files. A good practice that should not be neglected is to choose an antivirus that can discover, decode, and decipher these hidden codes and thus avoid being a victim of information theft.",
          "",
          "3. Recognize suspicious connections",
          "Cybercriminals often use IP addresses, websites, files, and email servers with a history of malicious activity, so it is recommended you use tools capable of examining the reputation of untrustworthy sources located outside of your organization.",
          "",
          "4. Monitor databases",
          "The modification of the structure in the database and unauthorized attempts to access critical data can be a warning sign that indicates that the network would be threatened. To prevent this, use tools that help you monitor databases and record attempts of unauthorized access.",
          "",
          "5. Keep your systems up to date",
          "The best way to ensure that company equipment is in good working order is by taking an inventory of all available hardware. Then choose a plan to manage your teams in the most effective way.",
          "There are two ways to do this: train your employees to update periodically or automate the process through a tool that automatically updates the system. This last option will allow updates to be downloaded once and then distributed within the company.",
          ""
        ]
      },
      {
        "writtenBy": "Written by Mauricio Mejía"
      }
    ]
  },
  {
    "date": "October 11, 2022",
    "shortDescription": "With the internet, advertising has expanded beyond measure.",
    "path": "/blog/2022-10-11-different-methods-of-online-advertising",
    "title": "Different Methods of Online Advertising",
    "details": [
      {
        "fullDescription": [
          "",
          "Brands must keep up with the latest marketing trends to sell and try to stay on top. There are always countless new techniques and different methods and strategies when it comes to advertising. Email marketing, for example, is an effective method used to reach a large number of people, without much difficulty. Through email newsletters, one can reach people of different ages, genders, and in different places all at once and all over the world. This is why online advertising has become so popular and effective.",
          "Email newsletters are effective, however, they are not the only way to go when it comes to online advertising. Creating ads on targeted websites can also help you reach a large variety and a large audience. When you run a banner ad or text ad campaign, site visitors can select your advertisement and then be led to visit a landing page on your website. Having a website is also crucial when it comes to online advertising, as this is where your audience and customers can go and buy your products and/or services if interested. Additionally, affiliate marketing programs can also be very beneficial.",
          "In order to do so, however, you must give companies a commission every time a visitor clicks the link and purchases something. Companies such as Facebook and Amazon are great examples of websites that affiliate marketing programs by allowing other companies to post advertisements on their page.",
          "Making sure your messages are captivating and attention-grabbing is needed in order to generate a large number of clicks on your advertisements and lead them to your landing page. It is crucial to drive visitors to your page in order for them to be able to buy your products and or services in which you can meet their needs. Moreover, just as you need captivating messages, you also need media that grabs your audience’s attention. Make sure you are guided by a graphic designer that can create “rich images” by making them animated, and using online videos as well. Use these different methods of online marketing and advertising in order to get more of an influx of people to your website and get new customers.",
          ""
        ]
      },
      {
        "writtenBy": "Written by Natalie Montoya"
      }
    ]
  },
  {
    "date": "September 13, 2022",
    "shortDescription": "We have always been required to maintain an active interaction for the longest of times",
    "path": "/blog/2022-09-13-maintain-good-communication-with-your-customers-on-social-media",
    "title": "Maintain Good Communication with your Customers on Social Media",
    "details": [
      {
        "fullDescription": [
          "We understand that humans have always had a need to communicate through different methods in order to achieve something specific, such as a particular goal. We have always been required to maintain an active interaction for the longest of times, but how can we create good communication on social networks in today’s day in age?",
          "In order to understand the purpose of communication, we are going to take a look at the role it plays in social networks and why it is so important. Social networks are formed by a person or organization that seeks to connect with the common interests of those who see their publications, thus quickly creating relationships between individuals or companies, regardless of physical limitations or beliefs.",
          "",
          "Another important factor of communication in social media is maintaining the constant interest of a specific target audience, as you do not want to lose your audience base. There are many ways social media can work to your business’s advantage, as there are also ways it can go wrong. When communicating through social media, you are providing your followers with useful, entertaining, and attractive content while promoting your brand effectively.",
          "Social networks and media have the ability to help rapidly grow your business, however, it is crucial to keep your platforms updated. Through the use of social networks, you can constantly publish news and company milestone announcements to keep your audience up to date and informed. It is also essential to answer any questions and/or concerns about what consists of the experience for the customer with your brand, however, it is vital to avoid autoresponders. Although there may be many customers to attend to at once, there are tools such as Grammarly Business that can be used to help you optimize your responses and make sure that every answer and any sort of communication you have with your customer is clear, attractive, and consistent with your brand. It is also very important to note that having a way to get feedback from your customers is useful, as this can provide your company with valuable information. You can obtain feedback through fun and exciting surveys or quizzes given to your customers, in order to see what may need improvement, and what is working effectively with your brand and/or business."
        ]
      },
      {
        "writtenBy": "Written by Laura Morales"
      }
    ]
  },
  {
    "date": "August 30, 2022",
    "shortDescription": "Brave travelers, have you come here looking for answers? ",
    "path": "/blog/2022-08-30-why-you-need-to-use-php-on-your-website",
    "title": "Why You Need to Use PHP on Your Website",
    "details": [
      {
        "fullDescription": [
          "",
          "In technical terms, PHP is a programming language made from C language and it is nearly 30 years old. PHP doesn’t need a hard compilation process and deployment on an I.T. infrastructure to be an executable program. PHP is already precompiled on demand and sent to the user's browser (or command line), and it’s one of the most used and always evolving programming languages out in business right now. ",
          "The boss path: As a project manager or business owner, the easing of implementation and low cost is always expected, and because of its C heritage, PHP can be easily learned by most developers in the market today. C is the core of teaching in most universities in Latinamerica for the last 2 decades. Jumping from desktop C to web PHP is not a big deal for talented programmers, as there is plenty of documentation on the internet for every single function, product or library. Therefore, your team should not have trouble getting the hang of things, for example, a particular situation would be a bug. Keep in mind, an application made by a team could be in most cases easily taken by a different one.",
          "The artisan path: One of the things I enjoy most about being a PHP developer, is that you can model business logic effortlessly by only following design patterns such as MVC, even if doing  so from scratch. Now, if you are using a framework such as Laravel, you can move forward fast and with precision to fulfill the needs of your clients. This is probably the greatest advantage PHP has, it is just you as a developer and your programming logic and creativity. So the daily deals in PHP projects are how to solve business problems through a flexible programming language.",
          "The potions store: As PHP now has a legacy of 30 years, there are several frameworks and premade applications, such as content management systems like Drupal, ticket systems like GLPI, online stores like Magento, and the list goes on. You can easily get new libraries from third parties or from PHP distributions itself for very specific problems such as email and soap messages, and of course database connection and APIs to connect your business to the right customer.",
          "Because of its less steep learning curve, easing of configuration, multiple sources of information, and a very active community, PHP keeps being a key tool for all small, medium and large businesses around the world, so it will definitely fit on your website to help you succeed.",
          ""
        ]
      },
      {
        "writtenBy": "Written by Uriel Moreno"
      }
    ]
  },
  {
    "date": "August 23, 2022",
    "shortDescription": "You should first be aware that learning to code is almost like learning an alien language.",
    "path": "/blog/2022-08-23-are-you-interested-in-learning-how-to-code",
    "title": "Are you Interested in Learning How to Code?",
    "details": [
      {
        "fullDescription": [
          "In order to learn how to code, you should first be aware that learning to code is almost like learning an alien language. Frustration, imposter syndrome, and discouragement can be common visitors, however, if one is truly motivated and persistent, you can overcome the negative feelings that may arise. ",
          "If you don't go to a CS program or bootcamp, it is important to spend a good amount of time in front of a computer looking for tutorials, doing courses, developing projects, and visiting sites like stackOverFlow or codeSandBox. Ah! Also make sure to develop soft skills because technical skills alone are not enough.",
          "Having a passion for coding would be ideal, but there are many who land in the technology world simply due to the monetary compensation. Although economic reasons may be important, genuine interest is the key to success.",
          "The Computer Basic Structure input, output, memory, and control units ",
          "The input unit is the one that receives data entered by users, normally through devices such as the mouse or keyboard. When a key is pressed, the matching letter or number is sent to the memory or the processor and does a compilation which is translated to binary code (computer language). A compiler is a program that translates human language to machine language.",
          "The output unit is in charge of sending the results as information after processing the data entered by the user. Data are integers and encoded characters. The term data is frequently used to refer to any digital information even if it's just a character.",
          "The memory unit stores program data. The memory has a large number of semiconductor storage cells, each capable of storing one bit. To this day, most computers use 32 or 64 bits.",
          "The Control Unit coordinates the processes from instructions and identifies the devices involved and the data to process.",
          "How the web works",
          "The web works with the following components to facilitate user-machine interaction:",
          "The Client is a regular computer or any device connected to the internet that interacts with a user taking user inputs and translating them to another computer called a web server. A browser is used in the client-server model.",
          "The Server is a computer connected to the internet that hosts websites and waits for other machines' requests so they return a response. A web server stores, processes, and delivers an output to clients.",
          "TCP/IP: Transmission Control Protocol/Internet Protocol. It’s a widely used standard communication protocol to transmit data over networks.",
          "The IP address is the Internet protocol for locating a device on the network. Each device connected to the Internet has an IP address, which is needed to communicate with other machines. The format of this address is a set of 4 numbers separated by periods (e.g. 179.19.107.124).",
          "The Domain Name is a unique address for a website consisting of the site name and the domain name extension. The domain name must be human-friendly (e.g example.com). The domain name works as a link to the IP address.",
          "HTTP stands for  Hyper-text Transfer Protocol. It's a standard used to communicate web browsers and web servers across the Internet.",
          "The URL stands for Uniform Resource Locators. It identifies a web resource (e.g https://example.com), the protocol (e.g https), and the hostname (e.g example.com).",
          "Repository",
          "It’s a storage location for software packages, kind of like a save button for files and directories. We use a version control system called Git that locally stores our software packages and allows us to push software projects to remote storage facilities such as GitHub, Bitbucket or GitLab. This way developers can have portfolios in the cloud and make sure that projects are in a safe place.",
          "Program",
          "A program is stored in memory as a set of instructions that executes a computer operation. They need compilers - machine translators - to convert source code into machine code using languages such as C, C++, Java, Javascript, and many more. Text editors are used to develop software programs.",
          "Frontend",
          "This is what users see, the graphical user interface of a website. Its main technologies are Javascript, HTML, CSS, Flutter, Vue, and everything that goes with it (React, Angular, Web Assembly, Bootstrap, Tailwind, etc.). The front end must be intuitive and easy to use. An application developed for mobile could be significantly different from a desktop application.",
          "Backend",
          "This takes care of all server-side development users do not see what happens behind the scenes. It includes databases such as SQL, MySql, PostgreSQL, SQLite, etc. Some popular backend languages are Python with frameworks like Flask or Django or libraries like Numpy, Ruby and its RoR framework, the Golang language created by Google, Rust created by Mozilla Foundation, PHP and its Laravel framework, and of course NodeJS which is the server-side JavaScript. Javascript is a versatile language that can be backend or frontend.",
          "There are also FullStack developers. These guys write code in backend and frontend.",
          "DevOps - Development & Operations",
          "This is not only programming but a whole culture, a set of practices that includes (CI)  continuous integration and (CD) continuous delivery.  The DevOps guys work with networks and servers. They are responsible for doing the integration, deployment, and monitoring of the development as well as the entire technology infrastructure of an organization, if something fails, everything fails and only they can solve it.",
          "The infinity loop seen in the image below symbolizes the constant need for collaboration and iterative improvement throughout the whole life cycle.",
          "Its technologies are Ansible or Terraform, containers used by Docker servers, network infrastructures supported by technologies like those provided by Amazon Web Services or Raise Firewalls, and monitoring tools such as Nagios. It’s surely a demanding and complex job.",
          "There are affordable or even free boot camps like The Odin Project or freeCodeCamp.  Courses on platforms like Coursera, EdX, Udemy, Udacity, and many more. Take advantage of the web as much as you can."
        ]
      },
      {
        "writtenBy": "Written by Karen Campo"
      }
    ]
  },
  {
    "date": "August 16, 2022",
    "shortDescription": "Java is one of the most popular programming languages so far since its first release in 1995.  ",
    "path": "/blog/2022-08-16-latest-java-trends-to-keep-in-mind",
    "title": "Latest Java Trends to Keep in Mind",
    "details": [
      {
        "fullDescription": [
          "Java is one of the most popular programming languages so far since its first release in 1995. Today it is still being used for enterprise applications.",
          "At the enterprise level, it has been useful due to its special characteristics such as interoperability and big support in terms of security which allowed Java to be one of the most used technologies recently and trending.",
          "Recently, the latest 2022 JRebel Java productivity report shows a change in tendencies in the most used JAVA LTS (Long term support) version which was dominated by Java 8 up until a few months ago. Now we can see Java 11 is taking the throne.",
          "In the next paragraphs, we’re going to take a look at technology keeping Java programming language as an option to develop in different areas in 2022.",
          "Spring Framework:",
          "Spring is a Lightway framework that has gained popularity because of its multiple projects and libraries like data, security, integration, cloud, etc,",
          "After the release of Spring boot 2, many developers are taking advantage to develop backend services, microservices, and serverless applications.",
          "The recent JRebel report shows spring boot growth as the main application framework used for microservices implementations.",
          "Big Data ",
          "Large data should be analyzed precisely even when data stored grows quickly.",
          "Java takes part in Big Data combined with open-source-based tools like Apache (Hadoop, Spark, Mahout), and Deeplearning4j which allows larger data problem-solving.",
          "AI (Artificial intelligence)",
          "Artificial intelligence is one of those technologies which has gained popularity in the last years.",
          "Java is no stranger to AI and is used by many developers based on its main strengths (maintainability, portability, security).",
          "Multiple libraries have been developed to be used in Java on different AI topics.",
          "Expert systems:",
          "Neural Networks:",
          "Natural language processing:",
          "Machine learning:",
          "Genetic Algorithms:",
          "Automatic Programming:",
          "Cloud computing",
          "Cloud computing brings the ability to use resources provided by a third-party company in order to reduce infrastructure maintenance.",
          "Many companies prefer to have data using cloud-based applications instead of stand alones because they are easier to access from multiple locations.",
          "Java security and interoperability make cloud computing-based applications available from different Operating systems (Linux, Mac, Windows, Android, iOS)",
          "Serverless Architecture:",
          "Serverless architecture defines an application that runs without the need to manage the infrastructure of a physical server.",
          "Java is a great language for serverless because it works well with different tools for cloud computing technologies like Oracle cloud service, Google Cloud Platform, and AWS.",
          "AWS Lambda functions with Java implementations have been more popular due to large amazon libraries support keeping developers focused on the main product.",
          "",
          "",
          ""
        ]
      },
      {
        "writtenBy": "Written by Juan Torres"
      }
    ]
  },
  {
    "date": "August 05, 2022",
    "shortDescription": "Define the project in general terms. (Set up a project management plan)",
    "path": "/blog/2022-08-05-5-tips-for-project-management",
    "title": "5 Tips for Project Management",
    "details": [
      {
        "fullDescription": [
          "1. Define the project in general terms. (Set up a project management plan)",
          "Asking yourself the following questions can help:",
          "2. Project Planning",
          "Set clear goals using a project roadmap. (Keep project documentation in order). Remember that the project files are temporary in that they will only be used until the project is complete. While there are several ways to execute goal planning, SMART goals, CLEAR goals, and Objectives and Key Results (OKRs) are three project planning strategies that can help you get started.",
          "3. Project Execution",
          "In this stage, your team will focus on achieving the goals that have been set. They will use the information gathered in the first two steps to build and launch the project within the specified time frame through teamwork and collaboration.",
          "4. Project Performance",
          "Measure project effectiveness with key performance indicators (KPIs). Define and achieve strategic objectives (consider initial project objectives, analyze key performance indicators, share performance with participants).",
          "5. Project Closing",
          "Organize an analysis meeting with the project participants. This phase is the one that varies the most between different companies and teams. While some like to acknowledge hard work, others like to get started on the next important task right away. There is no right or wrong way to close a project, and it's up to you to figure out what works best for you and your team.",
          "When closing a project, a good practice is to meet with the project participants to get a more detailed view of the success.",
          ""
        ]
      },
      {
        "writtenBy": "Written by Mauricio Mejía"
      }
    ]
  },
  {
    "date": "July 22, 2022",
    "shortDescription": "The dollar is reaching levels that haven’t been reached in nearly 20 years.",
    "path": "/blog/2022-07-22-the-rise-of-the-dollar",
    "title": "The rise of the dollar",
    "details": [
      {
        "fullDescription": [
          "It is no secret that the Corona Virus Pandemic is a situation that greatly affected all of us, worldwide. Many aspects of our lives have been impacted, including the global economy. Now, although we are currently still experiencing this pandemic, we are also experiencing the consequences of the pause there was on the economy in 2020. ",
          "The rise of the dollar has been significantly rising, particularly over the last couple of weeks, and it has become a hot topic. According to “The U.S Economy Today,” the dollar is reaching levels that haven’t been reached in nearly 20 years. “Since the start of this year, it has gained 8 percent, and in the last 12 months, it has risen 14 percent.” As we are experiencing inflation after the pandemic, due to there being a stop in production of goods, prices are now spiking in almost everything. We are also experiencing some drastic situations around the world, such as times of uncertainty with the war between Ukraine and Russia, the zero-COVID policy in China, global sanctions on Russia, soaring commodity prices, and Europe and Japan’s economic slowdown. This caused global investors to store their cash in the U.S. for “safekeeping,” which consequently contributed to the dollar to going up.",
          " The U.S. is buying more goods from other countries, which is helpful, however, this is causing things to get more expensive in other countries. As commodities such as oil and nickel are priced in dollars, this means other countries have to pay more to convert their currency into dollars to buy it. The Federal Reserve is trying to fight high inflation in the U.S, and according to the article “U.S. dollar touches 20-year high as markets shun risk,” Minneapolis President of the Federal Reserve Neel Kashkari said the U.S. bank may not get as much aid from easing supply chains as it is hoping for in helping to cool inflation. The Federal Reserve is making attempts to help lower inflation without tilting the economy into a recession, however it is expected there will be more rate hikes. It is a dangerous time for the economy, and there is speculations and chances of a recession."
        ]
      },
      {
        "writtenBy": "Written by Natalie Montoya"
      }
    ]
  },
  {
    "date": "July 14, 2022",
    "shortDescription": "Technology has become a part of our daily lives, more than we may be aware of.",
    "path": "/blog/2022-07-14-best-technology-products-in-2022",
    "title": "Best technology products in 2022",
    "details": [
      {
        "fullDescription": [
          "",
          "There are always tons of innovative products coming out on the market, and most of them are worth the hype. ",
          "Many technology products help improve our quality of life, including our health. For example, after the pandemic, many new technology gadgets have come out on the market in the fitness industry, such as the VAHA S Fitness Mirror.",
          "When people were no longer able to go to the gym, technology found a way to make the gym come to us. The VAHA S Fitness Mirror is a full-size mirror that allows you to have access to 850 workout classes all from the comfort of your home, while also providing you with personal trainers in real-time.",
          "The mirror is a 32-inch Full HD touchscreen mirror with speakers, that gives you an HD workout experience all while being able to workout from home. ",
          "Another great technological invention in the fitness industry that has come out on the market is the Therabody Wave Roller, which takes a regular foam roller and adds vibration therapy and wave-style texture to help work out all of your aches and pains. This is a great gadget for those in the fitness industry/ lifestyle, who know how painful and uncomfortable one may feel when sore. ",
          "This tool helps soothe and ease pain and discomfort, which is extremely beneficial and necessary after working out the body’s muscles.",
          "Additionally, another technology product out on the market is an electric bike that can be folded. The new GoCyle G4 electric bike differs from other electric bikes as it allows you to fold the bike, which is super convenient as it can be easily taken with you to many places. ",
          "For those who are constantly on the go and depend on public transportation, this bike can be a great investment. In addition, similarly to how there are many electric bikes on the market, there are many drones on the market. ",
          "However, a new drone has come out with never before seen features. The Skydio 2+ is a new drone that has different camera speeds, and allows you to choose different camera movements as well as different speeds. Through technology known as “Keyframe,” you can plan out routes that the Skydio 2+ will follow. ",
          "The Meeting Owl Pro, although may be considered a more simpler gadget, is one of the most efficient considering the times we are living in. The Meeting Owl Pro works for those who work remotely, which after the pandemic increased significantly. It replicates an in person meeting, while being separated from colleagues as it comes with a 360 degree camera, 8 microphones and a speaker.",
          "It also has an automatic zoom that responds to who is speaking at the time with an 18 foot audio radius integrating Zoom, Slack, and more. This is perhaps one of the most useful technological tools in my opinion, and very creative.",
          "Technological advancements are always improving and seeking new ways to improve, to make life easier. Remote work has become essential, and has transformed our lives in many ways, and through the use of technology such as The Meeting Owl Pro, it continues to keep us integrated and connected with one another, even if from a distance. ",
          "New technological advances are constantly coming out, and it is good to be informed of the latest gadgets that could potentially be useful to us.",
          "Similar to the very well known GoPro, the DJI Action 2 is gaining much popularity in the action camera market. The DJI Action 2 is water, dust, and dirt proof, and can easily be attached to a tripod, waterproof cases, a screen, and other features. It also offers 4k, 120fps footage and image stabilisation. These newest technology products out on the market are great products that offer many different services, depending on the product, all which can help facilitate your life and improve your lifestyle.",
          ""
        ]
      },
      {
        "writtenBy": "Written by Natalie Montoya"
      }
    ]
  },
  {
    "date": "July 08, 2022",
    "shortDescription": "Strategic marketing is marketing with a specific purpose and intention.",
    "path": "/blog/2022-07-08-what-is-strategic-marketing",
    "title": "What is Strategic Marketing?",
    "details": [
      {
        "fullDescription": [
          "",
          "",
          "It is marketing targeted to a particular audience or population, advertising a product or service effectively and strategically. First and foremost, when marketing strategically, one must plan; this is the very first step in strategic marketing. Here, one must develop a specific goal or objective and plan how you will execute it to reach these goals. ",
          "Planning is of utmost importance with strategic marketing, as here, one must brainstorm how to differentiate yourself from your competitors. When planning and setting goals and objectives, one must create a specific timeline and schedule to stay on task and on time; this will encourage you to meet your goals in a particular frame of time and will help you stay organized and on task. Try to ensure your goals and objectives are attainable, particularly in the time frame desired.",
          "Once you have your concrete plan, you can move on to the next step, the analyzing phase. In this step, one must research the market you are advertising for, competitors, and industry. One must also make sure there is demand for the product or service you are planning to market, so this next phase is where you conduct all your research. When researching the market, you will better understand the market field for your product or service. When analyzing the market you plan to advertise for, an essential tip is to look at competitors’ customer testimonials. When researching other’s testimonials, you can see your competitor’s strengths and weaknesses and use their shortcomings in your favor.",
          "After you have planned and researched, you can begin to develop and clearly define your product offering. Here you will build your marketing plan, and you will come up with the strategies you will use to execute your marketing plan. During this phase, you should have a set price on your product offering; you should know where your product will be sold (whether online and on what website, or in-store and what store), and lastly, how you will promote your product. However, it is essential to be aware that strategic marketing may have some obstacles. For example, strategic marketing can be expensive, as marketing campaigns, research, and advertising can be pricey. As a company, one must try to outweigh the pros and cons and decide whether strategic marketing is suitable for you and your services or products.",
          "Once you have completed these steps and sorted them out, you may begin the final step, which is implementing all your efforts after planning and researching. Strategic marketing is having all your resources in order to market your product/services in the most effective way possible. After you have a thorough idea of who your target audience is, what the value of your product is, and how to execute your marketing strategies, you should be able to meet your goal objectives set during the very initial step. ",
          "A clear understanding of a marketing strategy will allow you to reach the customer better, meet your goals and objectives, and attract more customers. Differentiating your marketing through strategic marketing is essential as this is your opportunity to stand out from your competitors and be different from the rest. Strategic marketing helps others distinguish you and your services, which is vital in the competitive market. It also enables you to understand better the industry you are engaged in, as it requires you to do some extensive research and have a thorough understanding of the competitive market of your product. If done wisely and in the correct form, strategic marketing is a valuable marketing tactic that can significantly benefit you and your business.",
          "",
          "References for “What is Strategic Marketing”",
          "",
          "",
          ""
        ]
      },
      {
        "writtenBy": "Written by Natalie Montoya"
      }
    ]
  },
  {
    "date": "June 29, 2022",
    "shortDescription": "Not only do consumers benefit from inclusivity in marketing.",
    "path": "/blog/2022-06-29-inclusivity-diversity-and-lgbtq-community",
    "title": "Inclusivity, Diversity, and LGBTQ Community",
    "details": [
      {
        "fullDescription": [
          "",
          "Not only do consumers benefit from inclusivity in marketing, however companies and brands are also able to expand their consumer market as well as they reach and target more groups in their advertisements. June, which is considered the month of Pride, is the month where  not only do we celebrate the rights of the Lesbian, Gay, Bisexual, Transgender, and the Queer community, however, companies have the opportunity to demonstrate their support for the community and inclusivity in their marketing strategies.",
          "",
          "Here are some ways in which we can all support the LGBTQ community through marketing in branding. It is important to remember, however, that more important than justmarketing, your company practices what they preach, and treats everyone with inclusivity and equality as well. Your company can be an ally to the LGBTQ community by,"
        ]
      },
      {
        "writtenBy": "Written by Natalie Montoya"
      }
    ]
  },
  {
    "date": "June 03, 2022",
    "shortDescription": "IT jobs are in high demand team is an excellent asset to any company.",
    "path": "/blog/2022-06-03-advantages-of-hiring-in-latam",
    "title": "Advantages of hiring in LATAM",
    "details": [
      {
        "fullDescription": [
          "IT jobs are in high demand, and a good software development team is an excellent asset to any company.",
          "Recruiters know that high-demand jobs often imply high salaries especially when the positions require specific qualified expertise, but what to do when you want to hire the best and keep a cost-effective approach to hiring?",
          "Let’s explore the main reasons why hiring in LATAM can be the next best step for your company.",
          "Although hiring in LATAM is definitely beneficial for your company, it does come with some risks, so make sure to work with a company that will help you liaison with your intended markets."
        ]
      },
      {
        "writtenBy": "Written by Meliza Espinosa"
      }
    ]
  },
  {
    "date": "May 31, 2022",
    "shortDescription": "Good branding and copywriting strategies are important. take this tips",
    "path": "/blog/2022-05-31-tips-to-write-a-copy-that-sells",
    "title": "Tips to write a copy that sells",
    "details": [
      {
        "fullDescription": [
          "Good branding and copywriting strategies are important when wanting to stay relevant with your business. Being able to create persuasive ads can make a huge positive impact on your brand or company, so it is important to know how. Effective copywriting that sells is a skill acquired overtime, not overnight. However, following these tips given is a good start in the right direction to becoming an efficient copywriter. ",
          "So, what exactly is an ad copy? Well put simply, it is a headline, a body, and a call to action that form an ad. Ad copies are used for branding in the marketing world, and can significantly boost sales if done correctly. Ad copywriters are in charge of highlighting fundamental components of a product and try to market it to their customers in a way that draws their attention. ",
          "Having a powerful headline is crucial in an effective copy, as this is what customers first see. As a copywriter, one must do extensive research on the topic you are writing for, and really get to know your product. One must also make sure you know about everything relevant to your topic/product, in order to make sure everything flows smoothly, and you can efficiently write a good copy that sells.",
          "In order to create a good copy, it is very important to:",
          "This will ultimately help you write a better copy overall. A great marketing strategy that can positively influence your copy, is making sure you are speaking to the reader, and making sure you are describing what the product or service can do for them. ",
          "The reader is more interested in what the product or service can do for them, rather than reading about the product or service in general. This is a key component to making sure you are writing a good copy that sells.",
          "It is important to be very specific about your product and know all the details about your product. On your sales page, make sure to include specific features about your product in order to help you sell. Moreover, customer testimonials are also a great tool one should include when writing a copy that sells. ",
          "Reviews and testimonials are great sources when trying to sell, as people feel more confident in buying a product when others can testify that it is worthy of buying. Obtaining a clear idea of the value of this product is extremely necessary when writing a copy that sells, as you also need to have an idea of how much you should sell it for.",
          "Moreover, one should also use engaging language, in order to engage the reader and get them interested in the text. Using language that generates emotion with your customer is important, therefore one should try their best to target a specific audience and know what captures their attention and emotions. “Studies that have been conducted show that emotions caused by ads usually include happiness, trust, anticipation, and gratification,” according to the article, Harvard Professor Says 95% of Purchasing Decisions Are Subconscious.” In addition, the text should be concise, not too lengthy, or wordy, which can perhaps bore the reader. Keeping it simple and short while maintaining an approachable tone is important. Making it easy to read to keep their attention is recommended. Make sure your reader finds the ad copy interesting, entertaining, and useful. Lastly, end your sales copy with a purpose, making sure it motivates the customer to buy the product. Overall, this is the end goal, so you want to make sure your sales copy is effective enough to encourage your customer to further explore your business.",
          "References"
        ]
      },
      {
        "writtenBy": "Written by Natalie Montoya"
      }
    ]
  },
  {
    "date": "May 24, 2022",
    "shortDescription": "Currently, the rapid evolution of the Internet of Things (IoT)",
    "path": "/blog/2022-05-24-let-s-learn-about-iot",
    "title": "Let’s learn about IoT",
    "details": [
      {
        "fullDescription": [
          "Currently, the rapid evolution of the Internet of Things (IoT) has become very popular due to the need of its consumers to be in places where they cannot be physically present. The IoT is equipped with sensors, software, and other technologies that allow your devices to have the possibility of capturing the data that they will be able to see, hear, or perceive.",
          "The internet of things encompasses any thing or object that can be connected to an internet network, taking into account that this can range from factory equipment and internal transportation to mobile devices and smartwatches, so any object that we can imagine could be connected to the Internet and interact without the need for human intervention, recognizing that its main goal is machine-to-machine interaction and assisting industries to grow and develop to stay on track.",
          "On the other hand, IoT has become mainly all the applications it provides to improve and facilitate the daily lives of consumers, especially in business environments, as previously mentioned, but without neglecting the possibility of connecting everyday objects, such as household appliances, cars, thermostats, and baby monitors, to the internet through integrated devices, allowing us to have seamless communication between people, processes, and things. So we use these technologies extensively on a daily basis without having the technical knowledge that the technological devices we use are part of the IoT family.",
          "As a consequence of the recognition of the internet of things, we must not leave aside technologies such as sensors, connectivity that facilitate connection, and cloud computing and artificial intelligence (AI) platforms that offer us the possibility of a life with many facilities and greater challenges in the future."
        ]
      },
      {
        "writtenBy": "Written by Laura Morales"
      }
    ]
  },
  {
    "date": "May 17, 2022",
    "shortDescription": "Canva operates an online design platform that provides ready-made media and content.\n",
    "path": "/blog/2022-05-17-canva-break-in-case-of-an-emergency",
    "title": "Canva: Break in case of an emergency",
    "details": [
      {
        "fullDescription": [
          "First of all: What the heck is Canva?",
          "It is a not-so-new tool but has been growing gradually after the pandemic due to its easy access and free version. Launched in 2013, Canva is an online design and publishing tool with a mission to empower everyone in the world to design anything and publish anywhere.",
          "Canva operates an online design platform and media licensing service that empowers members, artists, designers, and photographers to design and collaborate, providing ready-made media and content that is licensable for use following various licenses.",
          "Is it free?",
          "The digital ecosystem of the platform was initially based on having a graphic resource to develop attractive presentations in an agile and easy way through predetermined templates; nowadays, they offer a wide range that goes from templates for social media, videos, and printables.",
          "The free version limits us with the number of templates and space to have its cloud, basically up to 5 GB. It is not that it falls short with this, but if you are looking to make designs characterized by their uniqueness, we will not obtain that added value for our projects with this option.",
          "The pro version presents us with two quite logical options; one in which after a 30-day free trial, they would charge you $199.99 for one year of the service using the application or the platform through the web for up to 5 people, with more than 600,000 templates and millions of stock photos with a storage limit of up to 100 GB.",
          "As a last option, among the most attractive: total control of what your team uploads to the platform as well as access to the application of each one of them, graphics, color, etc.; unlimited storage and 24/7 enterprise-level support. Sure, this magic for as little as $30.00 per month.",
          "Is it helpful?",
          "Today's world is advancing by leaps and bounds; the use of Canva as a graphic resource on a day-to-day basis or even in a planned project is a beneficial tool due to its simple nature and its free version, which can support a short term project. However, it is not the most versatile on the market.",
          "Canva is not a portable designer.",
          "Many discussions about the cold war between designers and this type of platform usually draw a critical panorama for the guild as if they were feeling replaced by machines, in the best style of \"the matrix.\"",
          "In my opinion, a designer must always have an open mind to the advancement of technology and its variables and adapt to them by expanding knowledge, leaving the comfort zone, and exploring perspectives that can always serve as a personal and professional future.",
          "Saying that Canva is against designers is wrong and counterproductive since the platform provides more than half a million templates and assets designed by professionals in the field.",
          "Even though the platform gives you the resources, it couldn't replace the job of a graphic designer in a company or project since there is a preparation and exploration of content also the gift of creativity that is applied in each of these moments in which it is necessary to call a designer.",
          "Alternatives to put out the fire",
          "Just like a fire extinguisher, Canva can be used in an emergency to provide support at certain times that require the use of graphic and creative applications. Still, we also have other options that can be the same or more recursive. that this platform",
          ""
        ]
      },
      {
        "writtenBy": "Written by Gustavo Arias"
      }
    ]
  },
  {
    "date": "May 03, 2022",
    "shortDescription": "Many valuable reflections were made after COVID, one of those being learning how to work remotely. ",
    "path": "/blog/2022-05-03-how-to-build-a-hybrid-approach-to-remote-work",
    "title": "How to build a hybrid approach to remote work",
    "details": [
      {
        "fullDescription": [
          "Additionally, we witnessed how new companies were born, how others began to innovate their work methods, and how some simply could not resist the toll taken on the economy during that time.",
          "As a result of this, diversity was formed in the workplace, which focused on building a hybrid work model. Many leaders chose to provide opportunities to those who are part of their organizations by allowing and providing flexibility and balance in their work.",
          "This way, agreements were characterized whereby employees could work remotely for a few days a week and then work in person at the office at a predetermined time. An example of this work method is the company Parrolabs, which is focused on the growth of all its services without neglecting the benefits of its employees as well as the opportunity to have an adequate space to carry out the functions of each one of them.",
          "In conclusion, it is important to remember the times when attendance was important, however nowadays it is not seen as necessary as it once was. There are still exceptions, such as those jobs that require your presence at the facilities of the company which you are a part of. It is essential to be aware that there are many jobs that offer remote work.",
          "In these hybrid jobs it is important to create a plan and execute a series of operations that help the well-being of those who are part of the company to achieve the objectives of the organization."
        ]
      },
      {
        "writtenBy": "Written by Laura Morales"
      }
    ]
  },
  {
    "date": "April 26, 2022",
    "shortDescription": "Perhaps you’re not aware of the difference between these two symbols in Javascript.",
    "path": "/blog/2022-04-26-or-or-and",
    "title": "|| and ??",
    "details": [
      {
        "fullDescription": [
          "",
          "|| (OR)",
          "The “OR” operator is represented with two vertical line symbols:",
          "In classical programming, the logical OR is meant to manipulate boolean values only. If any of its arguments are true, it returns true, otherwise it returns false.",
          "Nullish coalescing operator '??'",
          "The nullish coalescing operator is written as two question marks ??.",
          "As it treats null and undefined similarly, we’ll use a special term here, in this article. For brevity, we’ll say that a value is “defined” when it’s neither null nor undefined.",
          "The result of a ?? b is:",
          "You have probably used these two expressions in Javascript, let’s examine the next snippet.",
          "As you can see, the result string is joe - because lastname is null, so the expression || checks for null and undefined values, in this case the expression chooses the second value - as result.",
          "Now, if for some reason you declare the initial value of lastname as an empty string, you’ll get the same result: joe - , that’s because for || , the empty string is a valid data, let’s go further and declare the initial value as zero 0 , surprise! you got the same result joe -",
          "So, now it’s time to test the ?? expression, let’s see the next code:",
          "As you can see, even though i declared the initial value of lastname as an empty string, you get joe , and of course if you change the value as zero, you also get the same result.",
          "To wrap it up, you must to know that ?? is more permissive that || , so in case you want to catch empty strings or 0 values, the || is the way to go, else ?? is pretty sufficient for you, it’s up to the requirement."
        ]
      },
      {
        "writtenBy": "Written by Dair Diaz Rambao"
      }
    ]
  },
  {
    "date": "April 14, 2022",
    "shortDescription": "\"cryptocurrency\" is because of the means of advanced coding that are involved",
    "path": "/blog/2022-04-14-what-is-a-cryptocurrency",
    "title": "What is a cryptocurrency?",
    "details": [
      {
        "fullDescription": [
          "",
          "Much of the interest in these unregulated currencies is to trade for profit, although the name \"cryptocurrency\" is because of the means of advanced coding that are involved in storing and transmitting cryptocurrency data between wallets and to public ledgers, and also because encryption aims to provide security and safety.",
          "There are over 10.000 cryptocurrencies, but the most important ones at the moment are Bitcoin, Ethereum, Binance Coin, Tether, Tezos, EOS, and ZCash. Bitcoin was invented in 2008 by an unknown person or group and began use in 2009 when its implementation was released as open-source software.",
          "If you are interested in buying cryptocurrency, you need to know this first. It is important to decide which platform to use. Consider which cryptocurrencies are offered, what fees they charge, their security features, storage and withdrawal options. You can also choose between a traditional broker and a dedicated cryptocurrency exchange. ",
          "The next step is to fund your account so you can begin trading. Most crypto exchanges allow users to purchase crypto using fiat currencies such as the US dollar. But you must remember that crypto purchases with credit cards are considered risky and some exchanges do not support them. That is because cryptocurrencies are highly volatile, and it is not advisable to risk going into debt, but there is another way to invest in crypto, which can be done through payment services like Paypal and Venmo, which allow you to buy, sell, or hold cryptocurrencies.",
          "It is important to always remember that in this process of handling cryptocurrency, the knowledge of developers is necessary, such as the services offered by Parrolabs, experts in coding languages such as Java, PHP, Python, Ruby On Rails, C#, Node.js, and others. The cryptocurrency developers are responsible for understanding the crypto coin mining concept and implementing the related features in the applications and systems, assessing existing transaction and exchange infrastructure, developing applications and systems based on blockchain technology, and integrating the software applications with the APLs of major cryptocurrency systems such as bitcoin, Ethereum, and other altcoins. They have a strong knowledge of powerful computer languages and working principles, as well as all of the skills of a cryptocurrency developer coder.",
          ""
        ]
      },
      {
        "writtenBy": "Written by Laura Morales"
      }
    ]
  },
  {
    "date": "April 05, 2022",
    "shortDescription": "Technology has made it easier to farm, build cities, and travel",
    "path": "/blog/2022-04-05-technology-and-society",
    "title": "Technology and Society",
    "details": [
      {
        "fullDescription": [
          "Technology has facilitated our lives and has improved the standard of living of human beings in many ways; however, the rise of technology also has negative consequences on the environment and on human health.",
          "What is technology?Technology refers to all the methods, systems and devices used for the use of any research in the world of science.",
          "What is society?A society encompasses any organized group of people living together in a community, which often includes some form of government/governance, ≥along with laws, roles, and an economy.",
          "As humanity evolves, technology accompanies its growth. Every day we see how technology becomes a part of our daily lives, from the simplest things such as making breakfast in the mornings to the construction of ships and other forms of technology that improve our daily quality of life.",
          "Technology has made it easier to farm, build cities, and travel, among other things. It has also effectively connected all countries, assisted in the creation of globalization, has made it easier for economies to flourish and has allowed businesses to effectively function. Using technology solutions, virtually every aspect of human life has been made easier, more effective, and faster, resulting in fewer issues in one direction however different problems in another.",
          "Learning has been significantly impacted through the use of technology in society. Learning has become more interactive and collaborative, allowing people to better engage with the topics they are learning and having difficulty with. It has also significantly improved access to resources.",
          "With the invention of the internet, we now have access to information at all hours of the day and can find just about anything online. However technology comes with a lot of problems as well, like the depletion of resources, pollution increase, and population increase/health concerns.",
          "Therefore, it is important to understand that even though technology has made our lives easier in many ways, we must consider the amount of technology we use and consume. As mentioned before, there are many consequences that may affect our health and life spans, so we must take care of ourselves in order to live longer on this earth."
        ]
      },
      {
        "writtenBy": "Written by Laura Morales"
      }
    ]
  },
  {
    "date": "March 16, 2022",
    "shortDescription": "Leading work teams in the digital age is not an easy task.",
    "path": "/blog/2022-03-16-project-management-tips",
    "title": "Project Management Tips",
    "details": [
      {
        "fullDescription": [
          "Leading work teams in the digital age is not an easy task. Digital media have successfully established themselves in our daily lives. Our way of working is constantly taking new forms in project management; this has opened up new opportunities and challenges that require some project management advice to handle this complex arena properly.",
          "Today we want to share with you six project management tips that will surely help you manage tasks and projects more efficiently and increase the performance of your team and your company.",
          "1. Clearly define your goals",
          "Having a company is quite an adventure. And although it is impossible to avoid some unforeseen events, having a predefined plan to stick to can help you overcome some setbacks.",
          "Before taking any steps, you should ask yourself what your goals are. Where are you going? When do you want to arrive? Otherwise, you would sail aimlessly, and it would be impossible to measure the company's performance and determine the subsequent phases.",
          "These objectives can be established as KPIs form, help you verify at the end of each exercise if the progress is as expected, where there are difficulties in advancing or if you have rushed in some aspect. Take advantage of technological advances and project management tools to record and review progress in this digital age.",
          "",
          "2. Anticipate problems",
          "Be proactive, carefully evaluate the possible complications that may arise in the future, and design contingency plans and possible solutions.",
          "In the best case, you will not need to apply them. And at worst, you'll be prepared to deal with whatever obstacles come your way.",

          "3. Be realistic",
          "It's okay to be ambitious and think big. However, you must have your feet on the ground and know what you can encompass. It is something that you should always keep in mind if you want to see your business prosper.",
          "When you seriously consider growing, do it consistently and with foresight.",

          "4. Define the roles well",
          "Interdisciplinary profiles can be handy in a company, but each has its skills and shortcomings.",
          "One of the talents of a good leader who manages any project in the digital age is knowing where each piece should be on the board to take advantage of their strengths and ensure that their weaknesses do not disadvantage the team. This is especially important in projects in which different profiles collaborate, where each one must know the extent of their skills and abilities.",

          "5. Promotes a good work environment",
          "As we mentioned in the first of our project management tips in this digital age, communication between the different team members is essential for the project's progress. To achieve this, you must foster a good work environment.",
          "Worry about the workers. Be interested in their concerns, ask their opinion, make them participate in decision-making. People need to feel valued to stay motivated. And a good leader gets his workers motivated.",
          "6. Facilitates communication between workers",
          "The last project management tip in the digital age is closely linked to many companies' main problems: the lack of fluidity in communication.",
          "For a project to progress correctly, promoting communication between team members is essential. There must be a constant exchange of information from the assignment of tasks to reporting or the approval of processes.",
          "In this sense, it is advisable to hold weekly meetings and frequent fast tracks so that all the professionals involved in each project are up to date at any time and from any place through software to collaborate optimally."

        ]
      },
      {
        "writtenBy": "Written by Mauricio Mejía"
      }
    ]
  },
  {
    "date": "March 03, 2022",
    "shortDescription": "UX/UI design in a resounding conclusion from a creator's perspective.",
    "path": "/blog/2022-03-03-the-importance-of-ux-ui-design",
    "title": "The Importance of UX/UI Design ",
    "details": [
      {
        "fullDescription": [
          "Before cities, inspirational land was planned to serve future generations; versions of themselves in fields, gardens, indentations, doors, and wallpaper. Just as real estate reinvents itself year after year, design for apps and websites does it constantly.",
          "The construction or development of an app or a website can involve the outpouring of color rain and shapes that, without a basic structure focused on success, can be malicious or simply not have any specific meaning.",
          "A well-executed user interface can generate an almost immediate bond with your interaction, thus making a strong impression on users.",

          "UX / User Experience",
          "UX is the acronym that defines user experience, and its definition is summed up in the experience that a user has when entering an app or a website and when he is on it until he leaves it. For this very reason, a good experience strategy defines its focus.",
          "The UX's importance is built by differentiating and executing the preferences and behaviors of the users within the management of the app or website; to offer the service or product in a comfortable, natural, and organic way. Like when you enter a supermarket, and you intuitively know where each one of the groceries is, and at the same time, you are obtaining information that determines your final purchase. It is a unique experience that can interfere with the user's emotions.",

          "Check the experience",
          "UI/User-interface",
          "The acronyms that define the interface, that is, the design of the app or website, focusing on the resources obtained from the user experience, objectively define its interaction within the interface.",
          "Considering that the UI is purely based on the visual part, colors, shapes, fonts, distribution of elements (headers, images, size) always relate to the UX to verify the results and that everything is on the right track.",

          "Beyond its function",
          "Just as in real life, the world of apps and websites stands out for the user's interaction with them. After a well-detailed investigation and structured planning, that process can guarantee that all the content in them is born in the proof a good UI/UX design highlighting improvements such as:",
          "Which is more important?",
          "Neither one is more or less important than the other. Both processes complement each other to the point that if one of them lacks a piece, the other is compromised, in the sense that if a web page or an app is \"beautiful\" but not fluid, it does not strengthen the user experience. Likewise, a well-structured app, with the elements that the user requires, does not ensure that the interface guarantees the link between the user and the product or service in the absence of visual harmony."

        ]
      },
      {
        "writtenBy": "Written by Gustavo Arias"
      }
    ]
  },
  {
    "date": "January 17, 2022",
    "shortDescription": "In recent years, new tools have evolved that give us alternatives to achieve our work goals. ",
    "path": "/blog/2022-01-17-serverless",
    "title": "Serverless",
    "details": [
      {
        "fullDescription": [
          "In recent years, new tools have evolved that give us alternatives to achieve our work goals. Generally, hosting a software application on the internet implies managing some type of server infrastructure, which means that a virtual or physical server must be managed, along with the operating system and other web server hosting processes.",
          "Traditionally, web applications have been created and implemented in which we have a certain degree of control over the HTTP requests that are sent to a server. Providers (AWS, Azure, or Google Cloud) focus on helping users not worry about configuring infrastructure, allocating resources, and managing them because they are the ones who are in charge of these processes.",
          "The main focus of Serverless is to help us focus on what matters in the web application as the project progresses and to become effective in our work functions. Among its advantages are the facilities it has in infrastructure management, but without forgetting that we must always be active in writing codes, defining events to trigger the actions to be executed, and the services that make the project work, it is necessary to take into account that one of the advantages of serverless is that it allows us to pay for what is consumed, but it is necessary to pay attention to the servers.",
          "In conclusion, normal servers could be replaced by clouds that manage the consumption of resources of the machine, so you can ignore general problems such as configuration, installation of programs, packages, and libraries, and everything you need when you are running an application. Serverless consumes services that are ready and you only focus on the application."
        ]
      },
      {
        "writtenBy": "Written by Laura Morales"
      }
    ]
  },
  {
    "date": "January 13, 2022",
    "shortDescription": "Software testing is a combination of checking.",
    "path": "/blog/2022-01-13-software-testing",
    "title": "Software Testing",
    "details": [
      {
        "fullDescription": [
          "Software testing is a combination of checking, exploration, and documentation, more or less a scientific method that helps us achieve better results in the software lifecycle, otherwise products may fail in production, which is critical for any team. Testing can be done manually or through test automation frameworks.",
          "Exploring uncovers risks in our projects, asks deeper questions that allow us to find defects that could affect UX quality, and identifies possibilities that no one has thought of before because we are learning about the system while exploring,  designing and executing at the same time.",
          "Documenting is a good practice that seeks continuous improvement, it helps us not to make the same mistake twice so that we can focus on the objectives and guide others towards achieving them, it also allows us to consult, give or receive feedback and reviews of previous tests to inform the next ones.",
          "Why is software testing important?",
          "Testing, in general, has always been used to prevent accidents and catastrophes. The Pareto 80/20 rule states that 80 percent of the consequences come from 20 percent of our causes, which translated to software means that 80% of system failures are caused by 20% of bugs.",
          "We live in a world in which technology is part of life, it even controls many aspects of it, such as finances, insurance, devices, transportation, security, information, entertainment, etc. Therefore, software should not fail, at least not that much, but it does. To be agile and accurate is necessary to have a correct understanding of the requirements, good teamwork, attention to detail, and assertive communication, typical skills of software testers.",
          "It is much better to catch bugs on time, correct them and make sure that the defects are not in other steps of development or already in production. Basically, software testing is important to ensure the quality of the product.",
          "To perform testing, make sure of...",
          "TYPES OF TESTING",
          "Black Box Testing",
          "Here, testers don't need to have any knowledge about the code, the software architecture, or any other technical aspect, they just need to interact with the application, to explore it to test functional and non-functional behavior.",
          "White Box Testing",
          "Here, testers know about the code and the structure of the application, it is mainly used by developers to perform Unit Testing for control flow, to test data, flow testing, branch testing, path testing, and so on.",
          "Grey Box Testing",
          "This one is a mix of the previous ones, meaning that testers have information about certain factors",
          "Unit Testing",
          "This one focuses on the correct functionality of the standalone module so the smallest pieces of code referred to as Units should be tested here. The Units to test could be functionality specifications, a piece of code or anything else that needs to be isolated and verified.",
          "Integration Testing",
          "Here is where different modules, units, and software components of the application are integrated. It is meant to verify the functionality, stability, and reliability of the modules when they are combined. This type of testing verifies the correct communication between all units.",
          "System Testing",
          "It is done after all functionalities have been checked and approved. Evaluate the system's compliance with its specified requirements.",
          "Acceptance Testing",
          "Formal testing that is done based on the user requirements, performed in real-life situations for end-users."
        ]
      },
      {
        "writtenBy": "Written by Karen Campo"
      }
    ]
  },
  {
    "date": "December 02, 2021",
    "shortDescription": "If you’re a web developer, probably you’re aware of the amount of HTML",
    "path": "/blog/2021-12-02-useful-html-tags-for-your-tool-belt",
    "title": "Useful HTML tags for your tool belt",
    "details": [
      {
        "fullDescription": [
          "If you’re a web developer, probably you’re aware of the amount of HTML tags in the standard, there are about ~142 HTML tags and you most likely use ~10 of them for your projects.",
          "I want to take this chance and show you 3 useful HTML tags that can make your project a bit better in terms of semantic.",
          "This tag is capable of highlight shortcuts that you want to display to the reader, in a basic but noticeable way:",
          "kbd tag example",
          "This one as the name suggests is for highlighting sections of text, of course, you can use CSS for styling it as you want:",
          "mark tag example",
          "This one is for display abbreviation with an optional attribute title that describes the content, the title is like a tooltip:",
          "abbr tag example",
          "These tags can help you improve your syntax and in a sense help you with the SEO; you could use simple div tags to visually create the experience for the user, but for some the web crawlers that represents different content.",
          "Hope this helps you a bit in your upcoming projects."
        ]
      },
      {
        "writtenBy": "Written by Dair Diaz Rambao"
      }
    ]
  },
  {
    "date": "November 25, 2021",
    "shortDescription": "Many companies at the beginning of the pandemic in 2019 thought that this would be temporary.",
    "path": "/blog/2021-11-25-manage-a-remote-team",
    "title": "Manage a Remote Team",
    "details": [
      {
        "fullDescription": [
          "In 2020 during the very beginning of the pandemic, many companies believed this situation would only be temporary. Now, after almost two years, we are still in a crisis, however this time the crisis is employees no longer want to return to the office. Most managers don’t know how to keep motivating a team in order to be successful in their company goals. Here are some tips on how to keep remote workers productive and happy.",
          "1. The key to success is communication.",
          "While working online, communication is likely to be affected, but in today’s times, different tools allow us to access resources that help us strengthen and continue to advance. For example, one of the many tools we use in ParroLabs is Slack. Through this application we can create channels to make sure we always have effective communication and we can create activities that allow efficient communication between employees and their team.",
          "The key to successful communication is to clarify what you expect from your team by having important discussions and giving them the flexibility and resources to get things done. Moreover, we should not forget the importance of constant group meetings, and making sure to announce and schedule beforehand, to agree on a time and day that works for most people.",
          "2. Expectations: Delegate responsibilities",
          "Through communication processes and meetings, it is important to delegate the functions and expectations of each individual and each team. During the job induction, it is important to be clear about the position to be occupied and the functions that are to be expected.",
          "Using apps can be helpful to manage the extra time that your employees are working and reminding them that it is important to manage their time. As a leader, some things are out of our control, whether employees are working in the office or working remotely. However, ultimately the overall outcome will show the hard work they have put in.",
          "3. OnBoarding",
          "Good onboarding can make a difference in your team. A lot of companies send emails with company information and their expectations from the employee at the end of the onboarding process. On the other hand, there are other companies that help the employees understand everything related to the company and their responsibilities, updating them with all the tasks that their teamwork is focused on and letting them know how important they are to the company.",
          "4. Motivating your team",
          "Doing activities that all your employees can participate in is a great idea to work on team work abilities and to strengthen different areas that can help the company grow. Additionally, showing gratitude and letting workers express themselves in their own individual style is helpful, and placing more of the focus on the overall end goals.",
          "Today, most employees are working remotely, so we can use activities to make  connections on a more personal level between the team, since it is easier to talk to colleagues when they have things in common. In this case, we can try to bring the team together by using tools that make activities easy, like creating a Slack channel to share stories, music, books or making a party on Netflix to share a great movie.",
          "Also, it is always important to remember to celebrate the success of the company with your employees. All of these factors can help contribute to a healthy and united work environment and team, even when working remotely."
        ]
      },
      {
        "writtenBy": "Written by Laura Morales"
      }
    ]
  },
  {
    "date": "November 17, 2021",
    "shortDescription": "If you are learning or interested in mobile application development.",
    "path": "/blog/2021-11-17-react-native-app-ideas-for-beginners",
    "title": "React Native app ideas for beginners",
    "details": [
      {
        "fullDescription": [
          "If you are learning or interested in mobile application development. React Native is a great option to create your applications. At the beginning it may seem a bit scary but if you have previous knowledge in React js, learning React Native will be easier.",
          "One of the most important points is the configuration of the setup environment, this varies depending on the device we use to develop or the operating system in which we want to run our application, in the following link you will find the complete guide to configure ​​ your setup environment.",
          "After having correctly configured our setup environment, the first thing to do will be creating the app, in this case I will use React Native CLI",
          "npx react-native init myFirstApp",
          "Once our app has been created correctly, we will delete all content of the App.js file located in the root of the project, here we will develop the code of our app.",
          "One of the main differences between React js and React Native are the components, while in React js HTML tags are used, React Native uses its own components, let's see some examples:",
          "If we want to use a container of other elements instead of using tags like <div>, <section>, <main>, etc. we must use <View>, for the texts instead of tags like <h1>, <span>, <p>, etc. we use <Text>, for the images we change <img> to <Image> , in the following link you can consult all the components that are used in React Native.",
          "For our application we will use some of the components mentioned above",
          "",
          "To run our app we go to the directory we just created cd myFirstApp, and run one of the following commands:",
          "npx react-native run-android",
          "npx react-native run-ios",
          "or if you use yarn as your dependency manager with:",
          "yarn run android",
          "yarn run ios",
          "",
          "It should look like this:",
          "As we can see, some components will take up all the available space, for some it is necessary to give them values, ​​for this it is necessary to apply styles, the styles can be applied directly in the component but to move the styles away from the rendering function and that the code is easier to understand it is recommended to create a style sheet, for that we will use StyleSheet that is an abstraction similar to CSS.",
          "We will create a constant that will receive an object and we define the different classes with their styles, in the component that we want to apply the style, in the style property we reference the constant and the class with the corresponding styles.",
          "React Native allows us to use React js fundamentals such as states, props and event handling",
          "The next step will be to create a new component which will receive the name as an argument and will display a message on the screen.",
          "After pressing the button, the onPress function will be called, which activates the variable that will show us the message on the screen",
          "I hope this blog has helped you, below I will leave you a list of project ideas that you can create to test and improve your skills in React Native:"
        ]
      },
      {
        "writtenBy": "Written by Erik Beltran"
      }
    ]
  },
  {
    "date": "November 09, 2021",
    "shortDescription": "Nearshoring keeps gaining more traction. ",
    "path": "/blog/2021-11-09-5-reasons-why-nearshoring-is-getting-more-popular",
    "title": "5 Reasons why Nearshoring is Getting More Popular",
    "details": [
      {
        "fullDescription": [
          "Nearshoring keeps gaining more traction. As Colombian outsourcing keeps gaining more traction as per Nearshore Americas review, so do others. In recent years both Clutch and DesignRush have made a special ranking for nearshore software development companies.",
          "In this blog post, we are looking into the details of the increase in popularity.",
          "Covid did seem to make the world a bigger place. One day to the next, many of us were in complete Covid Lockdown and we had to stay in our houses. For most the only contact we could have with colleagues, family and friends are through apps like Google Meet, Zoom, FaceTime, WhatsApp, and Teams.",
          "It did also make the world a smaller place. Instead of moving from one Meeting space to the next (and maybe even communiting), we were suddenly brought to the confinements of our screens. This also meant that suddenly the world got smaller, bringing with it opportunities. Soon people started flocking to Latin American Companies.",
          "Ever gotten to a vacation destination and the internet was extremely slow? Well, in recent years even small towns have gotten Fibre Optic internet. Also, international sea cables are making the world a smaller place. So working remotely is not as cumbersome as it used to be. Sending documents and transferring large quantities of them is not as difficult as it used to be.",
          "Flights to and from Latin America, as well as Eastern Europe, have gotten a lot cheaper over the last few years, and also there are more options. New Airlines have been opening new routes and prices have dropped.",
          "At a government level, the focus is more on international Business than there was before. Meaning that many regulations now favor international Business. Whilst, certain tax regulations are still very murky and favor those with huge budgets, but it is nothing like it was 10 or 20 years ago."
        ]
      },
      {
        "writtenBy": "Written by Niels Siskens"
      }
    ]
  },
  {
    "date": "October 27, 2021",
    "shortDescription": "Monolithic applications are applications that are running on the same server and all the calls it makes are local. ",
    "path": "/blog/2021-10-27-monolithic-and-headless",
    "title": "Monolithic & Headless",
    "details": [
      {
        "fullDescription": [
          "Monolithic applications are applications that are running on the same server and all the calls it makes are local. While headless applications are applications that have the frontend separated from the backend, thus allowing to remove the server overhead.",
          "It is not appropriate to say that one is being used more than the other, in what I have been working as a developer, the 2 types of systems are very required since large monolithic platforms allow faster development, for clients who are only looking for a website or a Simple e-commerce, based on templates, but on the other hand there are also clients who need more robust web applications and who require headless systems for higher performance.",
          "Monolithic Systems",
          "In this case, the frontend and the backend are closely linked and inseparable. The monolithic CMS interface accesses content from a backend database, and then this content is used within the website design. By default, from a design and presentation perspective, all content is transferred to the platform.",
          "Headless Systems",
          "The term 'headless' comes from the concept of cutting off the 'head' (the front-end, that is, the website or application) from the 'body' (the back-end, that is, the content repository, the database, etc.). Therefore, a headless CMS is a back-end only CMS built from the ground up as a content repository that delivers database content (SQL and NoSQL) and files to any platform or device via API.",
          "A headless CMS remains with an interface to manage content and a RESTful or GraphQL API to deliver content where you need it. The main focus of the Headless CMS is to store and deliver structured content and allow content publishers to collaborate on new content. In a headless CMS, the responsibility for the presentation and design of the content is given to the distribution channels. Due to this approach, a headless CMS doesn't care about how and where its content is displayed. Allow each channel to represent content in its own individual way.",
          "Differences",
          "There are a number of differences between monolithic systems and a headless system, including:"
        ]
      },
      {
        "writtenBy": "Written by Julian Alzate"
      }
    ]
  },
  {
    "date": "October 07, 2021",
    "shortDescription": "Front-End Development has changed significantly in the last decade. \n\n\n\n\n\n",
    "path": "/blog/2021-10-07-top-5-most-popular-front-end-frameworks-for-web-development-of-fall-2021-spring-2022",
    "title": "Top 5 most popular Front-End Frameworks - Fall 2021 - Spring 2022",
    "details": [
      {
        "fullDescription": [
          "Front-End Development has changed significantly in the last decade. With new Frameworks popping up to facilitate Mobile Responsiveness, as well as more modern headless frameworks.",
          "Here are the most popular front-end frameworks and the ones that our team at Parrolabs feels will have the best future.",
          "1. React & React Native​",
          "It is hard to bet against a Framework that is being backed by Facebook. This opensource framework is the absolute standard in Web Development these days and we expect its popularity to not wane for many years to come. As its sister framework - React Native - can be used for Native App Development, it will be a good choice for startups and companies on a tight budget for the foreseeable future.",
          "2. Gatsby JS",
          "It might be a surprise that this one will make it to the list. It is a framework that will make your websites blazingly fast. We recently turned one of our clients websites - called playershealth into an instant UX dream by leveraging the new Gatsby4.0 framework. While this is a static site generator, it deserves a place in this list as it keeps things simple and can be integrated with React and other frameworks. If you want your site to be extremely fast and perform well in SEO, than I would say Gatsby is the way forward.",
          "3. Next JS​",
          "This one for sure deserves a place in this list. You might wonder what is the benefit over pure React or why use Next if we can use Gatsby. Well, where Gatsby leaves us with purely rendered HTML & CSS, NextJS will allow us to render HTML & CSS at runtime. Some more detailed benefits and differences can be found in this great article.",
          "​I would say Next is potentially the future. Some of our clients that currently work with NextJS include Bespoke Blossoms and Misfit. ",
          "4. Vue JS & Vue Native​I",
          "Would argue that VueJS is as good as React. However, it lacks the backing (and the marketing) of a Facebook. This framework is really backed by a large community of smaller companies, developers and other tech people. I would argue that it is the wordpress of Front-End Development Frameworks. It has great potential for the future​.",
          "5. Ember JS",
          "​Ember is a framework that belongs in this list. While having a much smaller community than React or VueJS, it deserves to have a spot in this list. In our opinion, we prefer using React or Gatsby, but that is more preference. Ember has a great community as well and therefore belongs in this list.​",
          "What happened to Angular? Well, while it is a great option still. I would argue that other frameworks have taken the lead. As such we will give it an honorable mention, but we would recommend going with one of the other frameworks."
        ]
      },
      {
        "writtenBy": "Written by Niels Siskens"
      }
    ]
  },
  {
    "date": "September 28, 2021",
    "shortDescription": "Please, useCallback: is rerendering again and again without need.",
    "path": "/blog/2021-09-28-please-usecallback",
    "title": "Please, useCallback",
    "details": [
      {
        "fullDescription": [
          "If you’re a junior/mid-level developer, usually you don’t care too much about performance at the beginning when you’re creating a ReactJS component, that’s why I just want to put on the table this topic in order to improve your code since the first lines of code.",
          "What is useCallback?",
          "First we have to define this concept if you’re not familiar with the it, useCallback is a ReactJS Hook, if you want to go deeper go here​.",
          "I can’t get a better explanation rather than the official one:",
          "but first, if you’re not familiar with the expression memoized , let’s just say that is a technique to speed up expensive processes, I’ll explain this more in a bit.",
          "",
          "So, the code above is the syntax, a function that receives a function and an array of inputs or dependencies.",
          "Let’s explain what we’ll get, as you might guess, the outcome of the function is a memoized version of the first parameter (the function) and during the lifecycle of the component you’ll get the same cached reference to the function at least until the input a or b changed. In other words, if a or b changes, you’ll get a new version of the function, this enables you to have a optimized component because you’re not allocating a new function (the annonymous function which has the`doSomething()` call), every time the component renders.",
          "That’s easy, you’ll get a single and unique reference to the function that it’s going to be ready as soon as the component is created, and it’ll keep the same reference during the lifecycle of the component.",
          "Just be aware that every function is not suitable for useCallback , this is not a silver bullet, keep in mind all the inputs or dependencies you have; this hook could become a good friend but also a pain in the butt."
        ]
      },
      {
        "writtenBy": "Written by Dair Diaz Rambao"
      }
    ]
  },
  {
    "date": "September 09, 2021",
    "shortDescription": "Basic UX review: airline case study",
    "path": "/blog/2021-09-09-basic-ux-review-airline-case-study",
    "title": "Basic UX review: airline case study - part 1",
    "details": [
      {
        "fullDescription": [
          "The demand for UX has increased considerably in the last few years. Companies rush to create products that meet the demands of its users, and big organizations often have large teams and resources to focus solely on UX. What about a one man team? As it is common in UX research, there is little to no resources for testing and very limited time. We’ll review a case study on how to tackle a really bare bones UX review of an existing digital product.",
          "In this first part we will start with setting the framework for the process and analyzing the user flow of the task at hand, but first let's set some rules. The main focus will be on a low cost airline based in Colombia and its website is the product to review. The idea is to limit the scope of the analysis to only a single aspect of the site, also using what is called opinion mining with online reviews as our source of user data. Let's begin.",
          "PROBLEM",
          "This airline has a common low-cost airline strategy when managing its services, starting with a basic fare for the ticket and multiple tiers that add additional services, such as extra bags.",
          "Another important part of its revenue comes from extra services that offer a better experience for the user, such as sittings with more space and express boarding and insurance. They aim to increase one of its major KPIs: Additional services sales through the web channel. As of now, the airline has noticed a significant drop-out rate in the purchase flow in this specific stage, and they are willing to begin a redesign process to provide an enhanced experience that increases business performance.",
          "The process is the following:",
          "USER FLOWS",
          "This Simple framework in phases will analyze the situation and define what needs to improve, allowing for iteration of the design to finally arrive at a final delivery.",
          "What you are seeing is the diagram for the user interaction on the current website, in this first part the user must:",
          "The airline has 3 tiers for the type of ticket, offering different experiences depending on the price: BASE, MEDIUM and FULL.",
          "This second part shows us the data needed for the personal information form and gives us an option for people with special needs.",
          "Further, the main part of the flow will be the focus of our analysis. The option for extra services and insurance represents the main source of income for this airline, so in order to improve the dropout rate and to increase the sale of these services, the focus of our hypothesis will be in this section.",
          "OPINION MINING",
          "Due to limitations in this scenario, it is not possible to have actual user interviewees to understand more thoroughly their opinions on the services.",
          "However, it is possible to use user reviews to get insight of the experiences of users (this process is",
          "called opinion mining) in this case using trip advisor as a source. This allows us to understand pain points and emotional reactions to experiences of the product from a firsthand perspective, whether they are positive or negative.",
          "This allows us to have a human centered design approach to the reviews and a better understanding of the main cause of their reaction.",
          "HUMAN CENTERED DESIGN",
          "Users desire the cheapest price possible, but they do not take into account the considerations and conditions for the specific type of price tier.",
          "They have negative experiences due to the clarity surrounding the value and offerings of a certain ticket tier.",
          "Users avoid inquiring more about the services in the moment of purchase or deselecting the extra services, because the value is not expressly shown to them.",
          "This approach to problem solving will allow us to eliminate bias and subjective positions regarding our analysis.",
          "With the conclusions from the reviews, it is necessary to focus on the problem rather than the specific case of the reviewer. This situation can also present itself when hearing requirements from stakeholders or directly from users, our analysis must focus on the problem at the core of the product.",
          "Using a human centered approach to problem solving will allow us to “translate” any conclusion that may come out of our analysis, into a hypothesis that we can understand and target the main pain points which allow us to get the necessary criteria to continue our review of the website.",
          "HYPOTHESIS",
          "We have reached the hypothesis and at the end of the first part of our bare bones UX review, we have analyzed user data, user flows and hypothesis.",
          "In the following weeks we will be continuing with benchmarking, expert review and some conclusions."
        ]
      },
      {
        "writtenBy": "Written by Juan David Rivera"
      }
    ]
  },
  {
    "date": "July 29, 2021",
    "shortDescription": "The back-end communicates between the database and the browser. ",
    "path": "/blog/2021-07-29-top-5-popular-backend-frameworks-in-2021",
    "title": "Top 5 Popular Backend Frameworks in 2021",
    "details": [
      {
        "fullDescription": [
          "The Backend in development is the side that we don't see, it communicates between the database and the browser. Whenever we log in an accountor make a purchase from an online store, our browser sends a request to the server-side, which returns information to the frontend side to be displayed in the browser again.",
          "What are Backend Frameworks?",
          "Backend frameworks are server-side libraries that help build the backend structure and configuration of any website, they bring us the tools and libraries needed so that operations can be simplified.",
          "Below we’ll see some of the most popular Backend Frameworks based on the number of Stars of the repositories exported from GitHub Archive.",
          "1. Laravel",
          "Laravel is one of the best frameworks for backend development, it’s based on the PHP language andthe MVC ( Model-View-Controller) design architecture. It’s beginner-friendly and its primary aim is ‘create a process of upgrading fun and simple for websites’, the community is active and has extensive documentation.",
          "2. Django",
          "Django is a high-level framework based inPython language and theModel-View design architecture; almost everything any developer would require is already included.",
          "Django doesn’t need installing and maintaining third-party plugins, as everything in the framework functions together, it’s a good option for complex projects.",
          "3. Flask",
          "Flask is a microframework based on the Python programming language. It’s described as a microframework as it doesn’t need any particular libraries or tools, it doesn’t contain form validation and database abstraction layer.",
          "Flask supports extensions that can add utilities and features for a well developed dynamic web application.",
          "Unlike Django, Flask is a good optionfor developing smaller projects.",
          "4. ExpressJS",
          "Express, is a backend framework for Node.js, released as free and open-source software under the MIT License, thanks to the skyrocketing popularity of Node.js, Express is quickly becoming one of the best frameworks for web development nowadays.",
          "It's one ofthe best backendframeworks for building RESTful APIs and web applications,it's verypopular in the development stacks like MEAN, MERN or MEVN together with the MongoDB database and any JavaScript front-end framework or library.",
          "5. Ruby on Rails",
          "Ruby on Rails is basedon the Ruby programming language and theMVC design architecture, it’s open source software and is considered a beginner-friendly framework.",
          "Ruby on Rails is used for having a faultless database table formation, the scaffolding of views, and migrations. It could be combined with JavaScript, CSS, and HTML to develop dynamic applications."
        ]
      },
      {
        "writtenBy": "Written by Erik Beltran"
      }
    ]
  },
  {
    "date": "July 22, 2021",
    "shortDescription": "Home office forever? Or do you prefer the interaction again?",
    "path": "/blog/2021-07-22-work-from-home-or-office",
    "title": "Work from home or office?",
    "details": [
      {
        "fullDescription": [
          "The year 2020 taught us that as much as we may plan for the future, it remains very unpredictable. No one had imagined that our lifestyles would change so drastically. In fact, we were taken out of our comfort zone to a completely new one that many of us were not accustomed to. What for many was a dream, for others, became a nightmare. Working from home is not easy, it is a very new and different process, and it consists of new habits and spaces. There are people who really enjoy it and work well from home, while there are others who still have not been able to adjust completely. However, I consider that once you get used to working from home, it has many benefits, for example:",
          "On the other hand, there is the human part of us that desires to be social or to have human contact, which I believe to be very valid. Despite the fact that there are so many benefits to working from home, there are different things that need to be addressed and discussed in person, including sensitive work issues in the company. If you have an administrative role or if you are one of those people who prefers explanations in person, working from home may also disadvantage you greatly. There are some ideas that flow better when you work in teams or perhaps, you are one of those people who enjoys the company of your colleagues. Some may feel time goes by quicker while working in the office, and slower while working from home. There are also people whose internet connection may not be the best at home, so they must make the investment of paying for higher speed internet or alternatively, disconnecting other devices to not slow down the wifi. In addition, there may be more distractions from home if you live with children, siblings, parents or pets.",
          "However, as mentioned before, everything is a process, and we must take into consideration that nothing is ever really fully guaranteed in this life. We will never be ready for such sudden changes, we simply must be open to the idea of reinventing ourselves every day, looking for new strategies and not forgetting that we are part of a company made of humans, regardless of the virtual situation.",
          "Home office forever? Or do you prefer the interaction again?"
        ]
      },
      {
        "writtenBy": "Written by Karen Gutierrez"
      }
    ]
  },
  {
    "date": "July 09, 2021",
    "shortDescription": "Outsourcing is one of the most resilient industries amidst the crisis.",
    "path": "/blog/2021-07-09-6-trends-in-outsourcing-in-2021",
    "title": "6 Trends in Outsourcing in 2021",
    "details": [
      {
        "fullDescription": [
          "6 Trends in Outsourcing in 2021",
          "",
          "Introduction",
          "Outsourcing is one of the most resilient industries amidst the crisis. It has its advantages and disadvantages too.Outsourcing reduces labor and overhead costs and focused more on the company’s core competencies and thus improving its competitive advantages. While Outsourcing on the other hand also has its own disadvantages, it involves handing over direct control over a business function or process to a third party. As such, it comes with certain risks. For example, when outsourcing, you may experience problems with confidentiality and security or management difficulties.",
          "Somehow, Outsourcing has experienced disruptions that may have changed the expected trends in the future.",
          "",
          "Would the outsourcing trends remain as close as to what is expected?",
          "",
          "",
          "“6 Outsourcing Trends this year to watch out for”",
          "",
          "",
          "In times like this, remote work has increase and most employees worked at home five days per week during the outbreak. Outsourcing can also be a fantastic way for small business owners to improve efficiencies and bolster their company’s bottom line.",
          "",
          "Many organizations may likely get the services of outsourcing companies that have the capacity, stability, and compliance for work-from-home functions.",
          "",
          "",
          "Automation has already changed the world. The manufacturing sector overhauls have been the most visible for the business sector, but many other areas are being shaped by innovation.",
          "",
          "Global businesses recognize RPA’s potentials in outsourcing as the sector relies on advanced technology to process tasks efficiently.Automation continues to revolutionize finance, customer service, and the offshore services world, more people are coming to believe that the future won’t necessarily be worse for employment — it will simply be different.",
          "",
          "",
          "Cloud Computing helps organizations to lower operational costs, access resources quickly, increase efficiency, and secure data.",
          "",
          "It reduces CapEx and OpEx expenses.One of the main reasons businesses move to the cloud is to decrease costs. By sharing a pool of servers instead of buying and maintaining their own, and by relying on an outsourced IT staff and data facility, companies dramatically decrease capital and operating expenses.",
          "",
          "",
          "Outsourcing social media is in demand as businesses want to leverage social media for customer service and engagement.",
          "",
          "82% of B2B organizations outsourced content creation last year.Social Media is also in demand in Outsourcing because of the advantages it has.",
          "Outsourcing social media is that an agency typically has more experience and expertise than just one social media manager.",
          "",
          "",
          "A unified communication strategy across channels is essential in providing a seamless experience to customers.",
          "",
          "Outsourcing to an omnichannel customer support team you can provide better customer service to your customers. By providing them access to multiple easy options to reach you at any time of the day, you can then handle queries and resolve issues on time.A positive experience will drive an increase in customer satisfaction and most likely lead to referrals and potentially good reviews, which are hugely beneficial for business.",
          "",
          "Since outsourcing companies are adept with technology, they will be able to develop tools and resources in establishing an omnichannel experience.",
          "",
          "",
          "The Outsourcing market today shows that startups and small businesses believe that outsourcing can help their companies to improve efficiency and business growth. 80% of small businesses in the US plan to outsource this year.",
          "",
          "Also, the biggest benefit of outsourcing is that it frees the small business owner up to concentrate on the core business. Every small business can struggle to find the resources they need to grow. Outsourcing can level the playing field by allowing outside experts to contribute to making your company a success.",
          "",
          "On the other hand, the industry keeps on evolving to tailor-fit the needs of existing and potential clients. Thus, outsourcing companies are in need of talents with upgraded skills.",
          "",
          "We all know employee turnover is expensive. According to Gallup, the cost of replacing an individual employee can range from one-half to two times the employee's annual salary—and that's a conservative estimate.",
          "",
          "Upskilling, or reskilling, is a smaller investment than hiring and training a new worker. As you reskill your employees, you create a more well-rounded, cross-trained workforce, and increase your team’s effectiveness.",
          "",
          "",
          "",
          "",
          "",
          "",
          "",
          "SO WHY OUTSOURCED?",
          "",
          "",
          "",
          "Outsourcing Lowers Barriers to Entry and Increases Competition. While increased competition is encouraged by free markets and generally benefits consumers, it can hurt businesses that can't keep up. Outsourcing allows new entrants to industries where labor would have been too expensive otherwise.",
          "",
          "",
          "",
          "",
          "",
          "",
          "",
          "",
          "",
          "",
          "",
          "",
          "",
          "",
          "",
          "",
          "",
          ""
        ]
      },
      {
        "writtenBy": "Written by Dina Maculada"
      }
    ]
  },
  {
    "date": "June 24, 2021",
    "shortDescription": "You can observe the growth and reception of Svelte as a favorite in Satisfaction and Interest.",
    "path": "/blog/2021-06-24-top-javascript-trends-to-watch-in-2021",
    "title": "Top JavaScript Trends to Watch in 2021",
    "details": [
      {
        "fullDescription": [
          "During the last years a top 3 of the most used frontend frameworks has been maintained, which are: React, Angular and Vue.js, but according to the latest State Of JS survey, You can observe the growth and reception of Svelte as a favorite in Satisfaction and Interest, while React ranks as a favorite in terms of usage and awareness rating rankings.",
          "",
          "",
          "React continues to have a strong position in the frontend community and this will not change in 2021. The constant development of this tool combined with some pioneers in the frontend world ensures that it is a future-proof solution that many developers and customers want to use. In the development of web applications, features such as hooks, concurrent mode, and component-based servers in the future ensure that React is convenient to use, widely used, and properly optimized for the web development landscape in 2021.",
          "Vue continues to evolve, 2020 was marked with the release of Vue.js 3.0. Noteworthy is improved application performance and smaller packet sizes. Additionally, there was a significant improvement in TypeScript support.",
          "TypeScript is a superset of JavaScript, released by Microsoft in 2012. The idea behind this comes from the fact that JavaScript does not restrict object types. As the name of this language suggests, it supports optional types that JS lacks. TypeScript also adds enums to make organizing your code easier. Microsoft's solution is not the only one on the market.",
          "",
          "",
          "However, the latest State of JS survey shows that TypeScript is the most widely used language here. TypeScript took the syntax and semantics of JavaScript, and it brought in some additional features that JavaScript developers longed for. TypeScript increases developer productivity and makes it easy to maintain growing codebases.",
          "According to Marcin Gajda Svelte in a few years and with some new features, it will easily dethrone Vue as a lightweight and interesting alternative to giants like Angular and React. Especially in the development of applications for so-called \"thin clients\". This in terms of Frontend Frameworks.",
          "Now it is pertinent to talk about the management of the data layer.",
          "GraphQL is a query language launched in 2015 by Facebook. This data management tool provides a flexible syntax for querying data from both the back-end and front-end and is currently used by many companies such as GitHub, Pinterest, Shopify, and many more.",
          "In 2020, GraphQL had the highest interest among all the technologies that developers know about. 89.6% of developers who have heard of this language want to study it. However, the leader in the provision of data management is still Redux, which is used by 67% of developers. But JS trends show that this technology is losing satisfaction among programmers.",
          "",
          "",
          "In conclusion, for 2021 not much will change with respect to 2020 but we cannot let go of unnoticed those new technologies that are becoming increasingly popular such as TypeScript, Svelte, Apollo, etc. The objective of this article was to show the panorama of the JS trends for Frontend and the management in the data layer. In future articles, I will talk about Trends for the backend, Mobile development and go a little deeper into the data layer since it is something very important in development."
        ]
      },
      {
        "writtenBy": "Written by Julian Alzate"
      }
    ]
  },
  {
    "date": "May 27, 2021",
    "shortDescription": "There are a lot of online tools that you can use to work on your brand to improve your digital marketing process",
    "path": "/blog/2021-05-27-apps-to-improve-the-design-of-your-brand",
    "title": "Apps to improve the design of your brand",
    "details": [
      {
        "fullDescription": [
          "Hyperconnectivity has become one of the main characteristics of this generation, for this reason, the digital presence of a brand has become fundamental for its development and the use of digital marketing as its most powerful weapon.",
          "Surely, your brand is already on social networks but algorithms can make it difficult to see your business, especially if you do not publish frequently; and take into account that stories are the most powerful means of maintaining contact with users.",
          "In this blog post, we will teach you some tools to create Instagram Stories content that will be very useful to keep you growing.",
          "",
          "Before recommending apps and tricks, we must be clear that an attractive visual identity is essential to attract users, in addition to assertive and clear communication according to your consumers.",
          "To improve the design of your stories, we recommend Mojo, an app that can help you with the production of your audiovisual content, providing you with fully editable templates of various styles, so that it's very easy to convert static content into animated content. It also provides royalty-free music for your use. Only available for mobile.",
          "If the design is not one of your strengths, Adobe Spark post allows you to use photos and videos to make your content more interactive, it also allows you to create your own filters. Achieving a differentiating style is very easy with its free image bank. You can find it on mobile and desktop.",
          "",
          "If your brand is much more spontaneous than neutral, we recommend Prequel, an image editor with filters and effects focused on beauty and aesthetics. It allows you to use stickers, flashes, and presets not only on images but also on videos. Available only for mobile.",
          "",
          "And finally Word Swag. If your brand is much more active in communication, this app allows you to convert the text into amazing designs that will be very attractive for your feed and stories. Available only for mobile.",
          "In conclusion, there are a lot of online tools that you can use to work on your brand to improve your digital marketing process."
        ]
      },
      {
        "writtenBy": "Written by Daniel Medina"
      }
    ]
  },
  {
    "date": "May 13, 2021",
    "shortDescription": "Are there any of the elements that can make a company a “good employer” or an “appetizing company",
    "path": "/blog/2021-05-13-manage-the-brand-as-an-employer",
    "title": "Manage The Brand As An Employer",
    "details": [
      {
        "fullDescription": [
          "Brands' reputation are managed intensively in organizations to create a positive image with its customers and to differentiate their brand. But, what are the requirements to be hired as a good employer?",
          "Employees are part of a group of collaborators that organizations should value greatly because they are dedicated individuals with talent who are ready to work, and keep a company going.",
          "Being a good employer is not necessarily just offering superior salaries to the labor market without any additional economic benefits. Efficient employer brand management aims to work towards harmony between human talent and the marketing management process. It also needs an initiative with clear objectives in terms of skills to retain and attract talent to their company.",
          "Every now and then, people in the recruitment process who look for employees have been known for working in the design world as well. Selection processes can take up to many years. The initial step of the process starts within a single life, which is when the employer chooses his employees. Afterwards comes the conversion to double life, which is the aspirant who decides whether this will be his future job. Lastly, recruiters decide whether to invest in different sources that are more available such as social networks, among others.",
          "From the point of view of employees, the reputation of the organization in which it is built is based on trust, admiration, and respect that belongs to the poor. Charles Fombrum (Co-founder of Reputation Institute) defines it as “the expectations that the person has in relation to the company and what it means is that the company has been successful in meeting their expectations. The better you are, the better your reputation will be. ”",
          "Managing a brand as an element of attraction is a strategy to train the most talented, and used to differentiate in an entity that is more competitive.",
          "One must ask, are there any of the elements that make a company a “good employer” or an “appetizing company”?",
          "Organizational culture, directive capacity, clarity of objectives, communication and leadership styles, humanitarian management policies, livelihood activities, promotion of sustainable living styles, work-life and work-life balance, are some of the characteristics that identify companies that manage their brand as employers.",
          "Evidently, managing a brand as an employer is not an astute relationship made up of only communication. It requires all action and sustainable behavior for a long time.",
          ""
        ]
      },
      {
        "writtenBy": "Written by Alejandra Berrio"
      }
    ]
  },
  {
    "date": "April 30, 2021",
    "shortDescription": "DesignOps “The focus now is to reinvent, pivot, or create new experiences.”",
    "path": "/blog/2021-04-30-designops-product-strategy-and-organizations",
    "title": "DesignOps: Product, strategy and Organizations",
    "details": [
      {
        "fullDescription": [
          "DesigOps is a somewhat new term in organizations, but not a really new position or career, there’s a high chance that in your business or team is already a person with the responsibilities of a Practice Designer, Organizational Designer, or Program Manager.",
          "The principle for DesignOps is that you can't change the product without changing the organization, based on that statement, more and more teams in the tech industry and many other industries that rely on design are starting to implement design systems and design thinking, not only into their service areas but also on the management side, especially after the pandemic left the business without a path forward or showed many flaws and lack of planning on the inside. the focus now is to reinvent, pivot, or create new experiences.",
          "We used to think that in order to deliver great experiences we just need to get the design right, which is still true, but now what we are seeing it's that not only we need to focus on product, design, or strategy, but that the unseen stuff behind the scenes, that ultimately affects the quality, is what we really need to focus on, and as designers, we need to intentionally design and redesign the organization in order to get it right.",
          "This is especially true if you want to realize the investment that companies are making into the design. After covid what we are seeing is companies making an effort and putting more resources into design, but they are not really recognizing the potential that they could. The reason for that could be, that business leaders are not familiar with design, or don't know how to establish it in the context of the organization, in this case, is the responsibility of the designers to take the initiative and to push change within the company, like Bob Schwartz said: “designers need to show up as business people first”.",
          "And it makes sense, we have a lot of discussions about design thinking or design making in our businesses, if it is one or the other or both when the key thing is to define design roles that adapt to the need of our organization and optimize the company for the result we expect.",
          "The same way we put so much effort into designing software that doesn't have a single point of failure, that way, we should design our organizations."
        ]
      },
      {
        "writtenBy": "Written by Juan David Rivera"
      }
    ]
  },
  {
    "date": "April 15, 2021",
    "shortDescription": "Let’s face it, there are many Javascript Frameworks these days.",
    "path": "/blog/2021-04-15-why-choose-react-as-your-javascript-framework",
    "title": "Why choose React as your Javascript Framework?",
    "details": [
      {
        "fullDescription": [
          "",
          "Let's face it, there are many Javascript Frameworks nowadays. From Single Page Automators like Gatsby JS or NextJs, to more advanced frameworks like Angular or React. The question remains, what benefits will these frameworks have for the many different types of projects out there?",
          "So first of all we must ask, why do we need a Front End Framework in the first place?",
          "Like with WordPress and quick site builders like WIX, having the majority of the internet in our hands, why should we consider working with a Front End Framework? I mean, if we can make a WordPress website for a few thousand bucks, why should we consider spending up to 50-times that price?",
          "From my perspective the difference is not that significant, however we can compare this with a sport. For example, there are plenty of people who play tennis, and the vast majority of them know how to hit a ball very well. Now let’s say you are facing Serena Williams, you will then have to come differently prepared. The same can be said about Web Development. In 2018 when Google put a bigger emphasis on website speed, getting a better site has gotten more important. Headless, is the way to go in this case.",
          "So while it would be hard to compare React to other frameworks from my perspective, as I have only studied React JS and Gatsby JS, this does not mean that React is easy to learn.",
          "This means that a lot of people can study React and the community will be supportive of new people. If you can pick up the basics in a few weeks, it is easy to see people will keep working with it and that the community will keep growing.",
          "React JS has an opinionated structure, meaning that guidelines for best practices will need to get followed. This means it is easy to see who is a great developer and which ones still have a few things to learn.",
          "React JS is backed by a Global Community of enthusiastic developers. There are huge corporations contributing to the open-source code. The Framework has come a long way since its release in 2013 by Facebook. Contributions and improvements to the framework are almost constant given the size of the community.",
          "Facebook and others keep focusing on contributing to the framework and with more and more devices coming, I would expect that the framework will continue being improved.",
          "Now let's get a bit more technical. What makes React great and also super fast to implement is its usage of components. If you look at the Parrolabs website, you will see that many elements are similar albeit with a different color. You might have noticed that the site is loading almost instantly, this is because the site is pretty much already loaded when you click a link.",
          "Using components in your website will speed things up tremendously and will ensure that things are moving quickly. So this is an absolute benefit of using ReactJS.",
          ""
        ]
      },
      {
        "writtenBy": "Written by Erik Beltran"
      }
    ]
  },
  {
    "date": "October 29, 2020",
    "shortDescription": "Covid-19 will impact the Real Estate Market, Outbreak Permanently Change America",
    "path": "/blog/2020-10-29-covid-19-outbreak-permanently-change-america",
    "title": "Will the Covid 19 Outbreak Change America like 9/11 did",
    "details": [
      {
        "fullDescription": [
          "It has been nearly 20 years since 9/11 happened. For those of us old enough, we do remember exactly where we were when we saw the first plane entering the Twin Towers. The Airport Security Measures afterwards as well as the many changes in Society might be shadowed by the impact that Covid-19 might have.",
          "While 9/11 and Covid-19 have some similarities in the sense that most of us did not see it coming, there are also definitely a lot of differences. Covid-19 directly impacts everyone where 9/11 was a more localized event and also Covid-19 will last a lot longer.",
          "It is hard to directly see the impact it will have in the long run, but what we do know is that likely Cities will get altered. I am seeing that in my hometown Medellin, where the demand for Apartments is on the decline and the demand for outside living is on a steep increase. People want more freedom and with the revolutionary WFH policies that likely last for the next few years, we will see that not only suburbs might increase and city centers might become less popular.",
          "Who would want to live in a small apartment if he can live in a Suburban House? We will see that people will live further away from their offices. It can be that working from a remote cabin has its appeals to many people, and that cities will become less crowded.",
          "Likely, people will spread more. I am seeing that Colorado will likely be overflown with people from California where the real estate market has reached peak pricing. So many people will be driven out, to make other decisions. It would be appealing to get a great house and have more money in the end of the month. Many people might also start to move outside of the US. Canada comes to mind, but so comes Latin America. I have seen his happening in the last 5-6 years. More and more people decide to work remotely. For a little bit or for a longer period of time.",
          "So yes, I think that Covid-19 will impact the Real Estate Market, but not for the reasons that it impacted before. I think it will equal out the real estate market further."
        ]
      },
      {
        "writtenBy": "Written by Niels Siskens"
      }
    ]
  },
  {
    "date": "October 16, 2020",
    "shortDescription": "Here's how the internet may help to make the world a contamination-free environment.",
    "path": "/blog/2020-10-16-the-energy-future-of-the-internet",
    "title": "The Energy Future Of The Internet",
    "details": [
      {
        "fullDescription": [
          "The internet has brought us some of the biggest technological advances in the last decades. It has brought us closer together, made access to information universal and lastly brought our sponsorships together.",
          "However, it also comes at a cost. As much as 10% of the world's Electricity Consumption can be attributed to the internet. Only a fraction of people who use the internet realize that their messages are going through servers and get processed by hundreds if not thousands of KM of Wiring.",
          "The issue is that all of these systems need to be powered and need to be powered on almost all the time. The trend luckily is that there are a few larger vendors that are taking a bigger market share. The good thing about that is that these vendors are able to balance the need for their servers and switch them off during the times where usage is minimal.",
          "That being said, it is something we will keep in mind. Given that having a physical location further away is no longer a real problem, it is time for us to think about the locations of our internet. There is a real opportunity here as some locations, like Iceland, Morocco, Colombia and China have the means and capacity to generate enough green electricity through Earth Warmth, Hydro and Sun to power most of our Data Servers Needs.",
          "Having these locations would mean a reduction in costs, but also it would mean a reduction in the CO2 needs of our daily internet usage. There is a tremendous opportunity to diversify our internet further.",
          ""
        ]
      },
      {
        "writtenBy": "Written by Niels Siskens"
      }
    ]
  },
  {
    "date": "September 30, 2020",
    "shortDescription": "Parrolabs joins the Seamless.ai presidents club due to the efforts of our Laura Cotes",
    "path": "/blog/2020-09-30-parrolabs-joins-the-seamless-ai-7-figure-presidents-club",
    "title": "Parrolabs Joins The Seamless.Ai 7-Figure Presidents Club",
    "details": [
      {
        "fullDescription": [
          "Getting our Strategy Sorted late last year, we have made the switch from purely focussing on Web & Mobile Development to becoming a Nearshore Partner for everything that can be done remotely, but where communication is required. One of the focal points is becoming an Outsourced B2B Sales Provider.",
          "We want to focus on getting proper Sales Teams for our Customers and Partners for whom Outsourcing Sales seems a little bit difficult at first. We do anything from Lead Generation, yes I know we have a lot of competition in that field, to setting up Sales Processes as well as getting the Sales Function and Sales Process to the next level.",
          "As such, we had to hire a rockstar for getting the Sales Function Setup properly in addition to getting Sales Professionals to join us. We started with improving the sales function for ourselves as there were several aspects that could be streamlined.",
          "The first aspect was getting lead generation sorted. When our new Business Development Manager joined us it could be said that the first thing that could be significantly improved is the fact that we were generating leads manually. While this was a strategy that worked for sometime, the process was slow and besides our best efforts leads weren't always the right person.",
          "Laura introduced us to seamless.ai an AI lead generation tool that we've come to love. For our customers, she has been able to generate nearly $2M USD in sales in less than 1 year. That is an impressive performance as that literally means tracking thousands of leads, which using modern sales tools she was happy to manage. In addition to managing several Sales Reps who contact our client's client's via phone, chat, email and whatsapp. The teams performance is impressive given how young the Sales Operation is. Proper Lead Generation is more important than ever given the dent that Covid-19 is having on most companies. Reaching the right people will affect your Bottom Line for the better and will ensure that your Sales Operation does get the boost it needs.",
          "All in all, congratulations to Laura and the rest of the Sales Teams. We are looking forward to getting to see you go to the 8-figure Diamond Level Presidents Club!"
        ]
      },
      {
        "writtenBy": "Written by Niels Siskens"
      }
    ]
  },
  {
    "date": "September 17, 2020",
    "shortDescription": "How to properly engage with an outsourcing partner and be successful at it.",
    "path": "/blog/2020-09-17-engage-with-and-outsourcing-partner",
    "title": "How to Engage with an Outsourcing Partner",
    "details": [
      {
        "fullDescription": [
          "This One Might Be Obvious, But Reviews Online Are Easy To Make. This Way You Can Create An Entire Bubble Around Your Company Of Positivity. You Can Even Place Them Online And I Have Recently Discovered Some Scammers Are Even Going As Far As Using Deepfake Videos To Show \"Reviews\". In The Near Future, It Will Be Much Harder To Check. As Such, Before Selecting A Dev Partner, Check If They Have Any Reviews On A Site Like Clutch.Co And Check Their Reviews.",
          "This One Might Be A Little Harder To See. You Have Been Given A Great Developer To Work With. Let's Call Him Sam Trudeau (Which Is A Fictious Name). You Are Chatting A Lot And He Is Having A Great CV And Went To The University Of British Columbia That You Can See On His LinkedIn Profile. You Are Truly Blessed That A Trudeau Will Actually Be Part Of Your Software Team. A Little Digging Further And You Start To Realize That He Only Has 25 Contacts On LinkedIn. You Just Think, He Must Not Have Been The Biggest Networker Out There.",
          "The Reality Is That Most Likely This Person Is Pretending To Be Someone Else. Identity Theft Happens On A Daily Basis And People Are Eager To Get Through Them.",
          "This One Is Much Harder To Fake. Yet, It Is Not An All Size Fits One. Before You Start Drawing The Wrong Conclusion, Not Every Great Developer Uses Github. When They Do, They Usually Have A Significant History On There. For Comparison, This Is Mine. If A Developer Has A Limited History It Can(!) Be An Indication That They Have Made A Profile Just For Their \"Vancouver Adventure\". So Always Check The History On The Github Profiles, There Have To Be People That Coded On A Day-To-Day Basis For Years.",
          "To Conclude This One. Be Careful Of Who You Are Dealing With. Check Online Profiles And If None Of The People Seem To Have Any Hobbies Or Online Trace (Like Sports, Church, Hobbies, Etc) Than Is Normally Expected You Are Likely Dealing With A Scam. If You Can, We Always Recommend Visiting Your Tech Partner Especially If You Are Planning On Doing A Larger >$50K+ Project. Due Diligence Is Needed At All Times!",
          "I Have Seen People Being Scammed This Way Thinking They Have A $100.000 USD A Month Vancouver Developer Team, While In Reality The IT Team Including The Owner Is Located In Central Asia Where Salaries Are Significantly Lower And Quality IT Staffing At Par With The Americas Is Hard To Come By. Total Damage Can Be $25K - $3M. Yes, I Have Seen Multiple Millions. Most Of The Time, There Is A Skeleton Built, But The Real Product Is Not There. Hence, You Need Someone On Your End That Can Check The Progress Of Work Completed."
        ]
      },
      {
        "writtenBy": "Written by Niels Siskens"
      }
    ]
  },
  {
    "date": "September 03, 2020",
    "shortDescription": "An overview of the rates and cost savings when outsourcing IT staffing",
    "path": "/blog/2020-09-03-an-overview-of-the-rates-and-cost-savings-when-outsourcing",
    "title": "An Overview Of The Rates And Cost Savings When Outsourcing",
    "details": [
      {
        "fullDescription": [
          "First of all, these terms all come down the same thing, meaning you are contracting someone else to do something for you somewhere else. Where On-shoring is considered you outsourcing to some firm in the same country, usually for process optimization and efficiencies, nearshore outsourcing and far-shoring usually mean that you are trying to optimize both processes as well as Cost given the optimized cost of labour.",
          "So having a Software Development Team at an Outsourcing provider will certainly benefit you the Time Difference when doing FarShoring will have a hidden cost. We will not bring that over in this overview as that would be hidden costs as it is hard to measure but when staying in a similar timezone you will certainly not have to worry about night or weekend work. As Nearshore Partners, Parrolabs certainly can be perceived as biased towards near-shoring, but here an overview of the rates that we see in the market from our colleagues. ",
          "These can have massive payrolls to pay to their developers. Imagine that you are a 10 person software house with each developer earning $150.000 USD. The average developer will work around 1800 hours per year. Given that only 65%-70% are really billable (so called utilization), these agencies need to charge at least $130 USD per hour just to break even on the hours alone.",
          "So there is no surprise that most On-shore Software Development Outsourcing Agencies have rates upwards of $150-$250 USD an hour. That is just to pay for their Developer Salaries, so they are under constraint to keep performing and to keep selling their outsourcing services. While there are certainly efficiencies with Communication to have an onshore outsourcing team, for many Clients these rates are no-longer attainable. There are also many On-shore Software Development Outsourcing Agencies that have partnered with Offshore Agencies to have a better rate mix.",
          "Farshore is the most complicated and while this can be beneficial for large corporations who have huge developer needs, the additional costs are in general not worth it if you are not a global fortune-500 company. Always remember that Fortune-500 companies are not farshoring because they want the cheapest prices, but they are doing it as the local talent pool is not cutting it. So they are merely doing it to keep their systems running even if it means adding a lot of complexities to their organization.",
          "Rates that we see in India/ Pakistan and Bangladesh Vary a little bit. It depends on the provider, but they should be around $25-$45 per hour for the majority of developers. They are somewhat on the lower end in Bangladesh and a lot higher on the spectrum in the Indian MegaCities. You can find rates that are significantly lower than the range, but great developers in India are in high demand and they have good salaries. So all in all, if you find a price that is significantly lower than the range, you are warned!",
          "Here we also see a range. The range is anywhere from $30 USD - $75 USD an hour and varies among countries and regions. Eastern Europe is the Nearshore Development Service Provider for Western Europe and has seen it's rates go up significantly with Poland now being in the +$40 USD an hour range.",
          "By far the most popular nearshore country in the Americas is Costa Rica. A relatively small country, but with a stable government and a highly educated workforce. In recent years, rates have gone up and many companies are forced to look somewhere else. Near-shoring new destinations are Colombia, Mexico, Argentina and Brazil.",
          "In recent years, many former Costa Rican Companies flung to Colombia and Argentina as they offer larger Talent Pools and due to the upswing in Costa Rican Prices. As Parrolabs is in Colombia, we can best talk about the market here. We see a huge difference in pricing of resources with just a basic level of English and resources that speak English.",
          "At the moment, Colombian Tech Resources typically go in the range of $35 - $55 Per hour."
        ]
      },
      {
        "writtenBy": "Written by Niels Siskens"
      }
    ]
  },
  {
    "date": "August 27, 2020",
    "shortDescription": "Our new abroad location is now open and available to the public.",
    "path": "/blog/2020-08-27-parrolabs-goes-texas-we-just-opened-another-location-in-austin-texas",
    "title": "Parrolabs goes Texas! We just opened another Location in Austin Texas",
    "details": [
      {
        "fullDescription": [
          "Austin Texas has proven to be an excellent location with a sprawling tech scene. It is providing us with the opportunity to get boots on the ground in a new location.As we are experiencing Covid-19, we will not have a physical presence for the foreseeable future and will use the facilities of Creative Scape for our virtual presence. Parrolabs is looking forward to partnering with Austin based companies or organizations.",
          "For the last few years, we have had clients from the area. Since 2018, We’ve seen a constant stream of client interest from the region. That made us believe that we would benefit setting up shop in the area.Parrolabs can be reached at +1 484-918-9765 and our Address in Austin is: 701 Tillery St #12 #27 Austin, TX 78702, USA. We are generally available 08:00 AM - 05:00 PM Austin Time.",
          ""
        ]
      },
      {
        "writtenBy": "Written by Niels Siskens"
      }
    ]
  },
  {
    "date": "August 21, 2020",
    "shortDescription": "In this week's blog we will discuss the most popular web development platforms.",
    "path": "/blog/2020-08-21-most-popular-web-development-platforms-of-2020",
    "title": "Most popular Web Development Platforms of 2020",
    "details": [
      {
        "fullDescription": [
          "The state of the internet in 2020 can best be described as a huge wasteland with a few oasis that are green. Where it started relatively small, it has grown to be a clutter of data that no human will ever be able to see the full size of.For example , to play all songs that are on the internet would take 2.2 billion years according to Starry. Let’s not start with how long it would take to read every website. So, the trick is no longer just about building a website, it is about building a website that performs.As such, probably the top 2M websites globally will get 99% of the traffic out there. If you are below that, you will for sure be in the dessert wasteland of the internet.So you might wonder how do you know where is my website ranked? For that we are using the popular Alexa Ranking. For the last 2 years, our website has been steadily above the 2 Million Ranking. In general our clients are well within that range.It is well-known that the most popular framework on the web today is Wordpress. It is being used by large corporations as well, but almost exclusively as a CMS as that is what it is meant for. It is widely present in the bottom half of internet websites, so we decided to check the top 100.000 for the most popular Web Development Platforms. Sort of, setting yourself up for success.",
          "Some of these platforms are really old. Getting your site out there and promoting it takes considerable time and effort. Many of the top-100 sites use legacy systems in the back. Think Airlines for example, they are using 30-40-50 year old software packages that yes have seen new hardware over the years and have been upgraded in terms of front-end. However, the core of the Technology has its origins when the internet was no more than an oil Drum.",
          "The web is constantly changing. Where the trend was to go from static websites to primarily Dynamic Sites (think Drupal, WordPress), it is reversing to go Static Again, but using Microservices to make your site dynamic.Overall, Static Websites are a lot faster and this will return in significantly better SEO. Like we wrote in our article about Serverless. This trend we see in the top 100.000.",
          "Top websites known that maintaining a website is just as important as actually building a website. You are never done, when a website seems done another issue pops up, a feature needs to be build, it needs to get promoted. So the top 100.000 websites set money apart for all of that. You can be in the top too, but you need to be wise and start humble. Again, think 10 years, not 1 year(!).",
          "The last couple of years, we see a trend that Speed in SEO is an increasingly important factor. Given the mobile compatibility it is more and more important to have a speedy website. So we see a trend that while internet speeds are going up, the size of websites decreases.This is especially true for the top 10000, where we see a lot of React, Angular and VueJS Websites.",
          "We feel that in conclusion when you start with a new website, keep it simple. If it is just you, do not attach a CMS. Build a very simple site using Gatsby or something similar. Structure it right, but do not go overboard. Sitespeed is your friend, and patience is another really important factor."
        ]
      },
      {
        "writtenBy": "Written by Niels Siskens"
      }
    ]
  },
  {
    "date": "August 13, 2020",
    "shortDescription": "Learn in a few short steps on how to nearshore an amazing logo from our guest writer.",
    "path": "/blog/2020-08-13-how-to-nearshore-an-amazing-logo-in-3-steps",
    "title": "How to NearShore a Great Logo in 3 Steps",
    "details": [
      {
        "fullDescription": [
          "Starting your own business? Need to create a logo? A company logo may materialize at different stages for different businesses, the important action is creating a logo that clearly communicates your company message and leaves an impression upon your customer.",
          "Whether you decide to dedicate the time to create your own logo, or you prefer to work with a Nearshore Digital Agency, these are the 3 fundamental steps to complete on your own logo creation journey.",
          "Step one: Define the values that represent your company. Conceptualize. This is the first step that lays the foundation for everything that follows. Based on company values, express the message you want to communicate with your logo.",
          "First impressions are everything, that’s why short, direct, and concise messages are often the most effective. Get rid of anything extra. Keep what's strong, get rid of what's not. If your message or logo isn’t clear and you rush your logo to the next phase, you will only confuse customers.",
          "Step two: To the drawing board! Now that you have your company values and message to lead you, you can begin to examine different sketches and visuals of your logo. Most designers recommend choosing the form of your logo first and then the color(s). While one isn’t necessarily more important than the other, order can optimize creation.",
          "In this phase, you can begin to get select feedback from trusted sources. The experts in this stage look for a form that is scalable and works on as many different surfaces as possible. The simplicity of a great logo allows your company the flexibility to take advantage of diverse and innovative marketing opportunities. You might want to put your logo on a t-shirt, a tennis ball, a water bottle, a website, a cell phone or an email. For this reason designers often prefer using just one principal color. Afterwards, if they want more color they may choose tones of the same color to highlight or accent.",
          "Step 3: This is the ultimate step. Focus on details. Now you should have chosen between the final versions of your sketches. Similarly to when you sought feedback from a select few friends, now you want to get feedback from everyone you can. This is the moment to make sure your customers understand your message and identify with your logo.",
          "This is where the experts really shine. This is your final draft, your final product, the decisive detailed revision before you present your masterpiece to the world. What separates the best from the rest? Some people reach this step and are already married to their idea, even when the user feedback shows that the customers don’t clearly understand the message. Many times you have to go back to the drawing board. The best logos can stand the test of time, but only when you invest the proper amount of time.",
          "In a nutshell, creating a logo, no matter who creates it, is done using these three steps. If you have the time, talent, and training to do so yourself you can get to work right away. If your business is in a position to grow, use a Nearshore Digital Agency and save time, money, and headaches.",
          ""
        ]
      },
      {
        "writtenBy": "Written by Thomas King"
      }
    ]
  },
  {
    "date": "July 30, 2020",
    "shortDescription": "An Article to open a discussion as we feel most SEO issues that we encounter are technical seo",
    "path": "/blog/2020-07-30-believe-me-most-seo-issues-are-technical",
    "title": "Believe Me Most SEO Issues Are Technical!",
    "details": [
      {
        "fullDescription": [
          "So you have hired this SEO guy from the Internet. So he is an expert in Copy and while your team had done some SEO keyword research, none of the keywords are showing up. You are getting upset and decide to hire someone that came recommended to fix your SEO issues.",
          "Yes, the world of SEO is definitely getting more complicated and for a Web Development Agency like Parrolabs, it is something that we have to Monitor Closely. The most important changes that were announced in the period 2017 until the middle of 2020 are:",
          "I am convinced (although any evidence is missing) that Google will rank your site higher if you are showing to them your page is able to handle more traffic. Nothing frustrates Google more than to link to pages that will crash under traffic. If you rewind the clock 15-20 years, it was not uncommon for servers to crash. While Autoscaling Cloud Environments have changed all off that, not everybody is using it. The fact that Google is now ranking pages by Loading Speed and Page Speed are described on their Blog here: Speed is now a landing page factor for Google Search and Ads | Web​ ",
          "The jury is still not out if Structured Data or Schema.org is a ranking factor. Some blogs suggest that it is not (Is Schema Markup a Ranking Factor for SEO or Not? - RankWatch Blog), while others are suggesting it is (How Schema Affects SEO). Overall, we feel there are some positive aspects of using it. So, we would recommend it as an extra push, but not as an absolute requirement. So while there are many ranking factors, the most important is Speed. Also, we think that there are many others that are more important than the exact phrase that you need to use. That being said, keyword research is definitely not something to ignore.",
          "The actual loading speed of a website is very important. Many websites run on servers that are single VPS. While, this is not necessarily a bad thing. Chances are that your site is also running a number of Plugin Processes and the bad thing about that is that your server might be under heavy load cause of these processes. This will affect your SEO heavily. We are recommending every",
          "We see a lot of small issues with URLs including redirects. You need to pay attention to the fact that sometimes URLs are duplicated and this is bad for SEO. Luckily the free Google Webmasters - Resources to Track Website & Search Performance has a nifty tool to see if this is the case. Pay attention to your Coverage Report in the Google Search Console",
          "This is an important Aspect and Oftentimes overlooked. If your HTML is not showing, it is not necessarily bad, but if you are using React or Gatsby or any other Single Page App (SPA), we would recommend having a look at predendering. See also here Vue.js SEO-Friendly SPAs: Tips, Tools & Prerender Example - Snipcart",
          "Admitting, this does not happen a lot, but we’ve seen it in the past. This one is like very basic, as every site needs to have a document called “robots.txt”. As we are working with a system called Git, it can happen that we want to have the Robots.txt in our Staging Environment to block all crawlers, so it does not show up in Google. However, in a clumsy moment and not QA-ing well the production it can happen that Google will not index it, like ever…whatever you do.So if you are struggling with your SEO. Do not hesitate to give us a call and see what we can do for you!"
        ]
      },
      {
        "writtenBy": "Written by Niels Siskens"
      }
    ]
  },
  {
    "date": "July 16, 2020",
    "shortDescription": "Is technology ruining our capability as humans to interact with each other?",
    "path": "/blog/2020-07-16-love-in-the-times-of-technology",
    "title": "Love In The Times Of Technology",
    "details": [
      {
        "fullDescription": [
          "This quarantine has us all analyzing what the best way to spend our time at home is and how to make the most out of it, but are we really spending our time in a healthy and productive manner?",
          "",
          "For those living with their partners, are you using this time to bond, to help, to serve as a companion, to show appreciation and love? Or are you self-isolating in your own personal interests, and using this time as a valid excuse to run away from your responsibilities?",
          "",
          "We are currently facing a different issue that many people may not be aware of. Many of us don’t know how to actually be present in the moment, we don’t know how to show appreciation for others, and we don’t have patience to deal with other’s emotions. People are filing for divorce over simply having to spend too much time with their romantic partners, which I think is a bit lunatic. Intimacy isn’t just about sex and romance; intimacy is about sharing, about supporting each other, getting to know each other, and trusting one another.",
          "",
          "It is evident that technology has made it easier to stay connected to the world, but how important is it to check our phones regularly and compulsively from the moment we open our eyes until the moment we fall asleep? Are we actually spending time with our families without the distraction of incoming messages? We are constantly wanting to be connected, and informed, but we are making those physically around us feel lonely in our presence due to the constant need of being tuned into our online conversations. This feels a little bit off to me. If the idea is to stay connected, why are we ignoring those who are there for us to talk to?",
          "",
          "Is technology ruining our capability as humans to interact with one another? As social beings, do we really feel more comfortable with virtual contact rather than with  handshakes and hugs? Are we being trained to lose our essence, our empathy, and are we finally becoming robots? Have we resisted our nature for so long already that we can no longer relate to feelings? I say, fuck you all, fuck your phones and fuck your shallow minds that don’t even let you live in the moment...now! Because that’s all we have! Being present, being here and now!",
          "What are your thoughts?!"
        ]
      },
      {
        "writtenBy": "Written by Laura Cotes"
      }
    ]
  },
  {
    "date": "July 09, 2020",
    "shortDescription": "How we helped an NGO in Medellin improve their Technology.",
    "path": "/blog/2020-07-09-how-has-technology-helped-you-build-your-business",
    "title": "How Has Technology Helped You Build Your Business",
    "details": [
      {
        "fullDescription": [
          "Hi, my name is Adam Armfield and I am the founder and CEO of a 3D printing business (Universo 3D) and also a non profit called Humanos3d.org in Medellin, Colombia. 3D printing is a hot topic and one of today’s most exciting and disruptive technologies. It is pushing the boundaries of many industries with advances in areas as diverse as biotechnology, aviation to arts and science. It’s rapidly becoming a core technology and is being integrated into STEM and Universities subjects on a global scale. Today I will highlight how my team at Humanos 3D uses this technology to positively impact the lives of those affected by Colombia’s ongoing civil war.",
          "We design and fabricate 3D printed prosthetics and robotics and recently, in reaction to the COVID-19 Crisis, we rapidly adapted our work processes to fabricate personal protective equipment and prototype parts for ventilators to donate to under-resourced hospitals within Colombia. A key part of running a non profit is prospecting and developing strategic relations to enable us to reach those in need and also to identify and build partnerships that allow us to fund our work. The second part of this blog will look at how we applied specific online prospecting and technology tools to take our fundraising and awareness-raising to the next level.",
          "3D-printed prosthetics are changing the face of medicine, as engineers, physicians and even students are able to develop prosthetics that are fully customized to the wearer. Consumer 3D printing is leading to an even bigger revolution: \"DIY\" assistive devices that can be printed by virtually anyone, anywhere. Humanos 3D works alongside e-Nable which is a network of passionate volunteers using 3D printing to give the World a \"Helping Hand.\" Besides 3D printing technology, what has really driven this movement is the open-source technology and designs.",
          "Every new invention can be replicated, tested and improved in a matter of days if not hours at minimal costs. Traditional methods of fabrication can take months and cost 10’s of thousands of dollars in design and production costs. A normal prosthetic can cost anywhere from US$5000 to US$150,000 dollars and take 6 months or more to deliver. Using 3D printing, volunteers and open-source designs, we have reduced this time to a matter of days and reduced costs to less than a thousand dollars. This is just one sign of the power of 3d printing in the 4th industrial revolution.",
          "Even with volunteers and open-source designs, we still have operational costs like any organization and logistical problems. 2 of the key problems that we faced were being able to find people in need in remote and war-torn locations. Many of these potential clients (we use this term loosely as all of our devices are donated and we never charge the recipients) are from rural areas with limited resources and access to technology. This presents 2 unique problems. Firstly they may never know we exist and secondly, it can be costly to travel across Colombia on several occasions to take measurements and receive training. The other issue we face is securing funding to cover the costs of the prosthetics and travel for those who are in need. We also provide transport and accommodation. Lack of funds to pay for a bus or hotel has restricted many of Colombia’s poorest people from ever receiving an assistive device.",
          "We recently worked with Laura Cotes from Parrolabs to assist us with new strategies to address these 2 key issues. Awareness raising and FundRaising. Using a set of digital prospecting and online tools which are provided by Parrolabs, we were able to identify and contact hundreds of high-value contacts. Traditionally we had 2 full-time volunteers researching organizations, writing grant applications and follow-ups. This is an extremely time consuming and lengthy process with a very low success rate especially for start-up nonprofits. Within weeks of utilizing Parrolabs prospecting tools, we were having direct conversations with the right people in organizations that aligned with our values and needs. Within 3 months of utilizing these tools, we had developed more strategic relations (which we utilized to achieve our awareness and fundraising goals) than 3 years of work!",
          "Technology can help us improve on costs and delivery outcomes in manufacturing. It can also accelerate our efforts in crucial areas such as partnership building, fundraising, awareness-raising and marketing.What are your organization's current goals and how has technology impacted your workflow? Leave your comments below or contact Parrolabs to see how they can potentially take your organization to the next level using some of today’s most powerful technology tools. If you would like to see more of our work please visit us at Humanos3d on Facebook and Instagram or www.humanos3d.org. If you would like to make a donation we accept most forms of payment https://humanos3d.org/en/donate/. Give us a hand and we promise to give many more."
        ]
      },
      {
        "writtenBy": "Written by Adam Armfield"
      }
    ]
  },
  {
    "date": "June 26, 2020",
    "shortDescription": "Netlify is one of the most solid hosting options in the market, this article may help.",
    "path": "/blog/2020-06-26-netlify-a-surprisingly-solid-hosting-option",
    "title": "Netlify A Surprisingly Solid Hosting Option",
    "details": [
      {
        "fullDescription": [
          "Those of you who have been following our blog over the last couple of years know our love for AWS and GCP. However, we also want to give other companies an opportunity in this space.",
          "Hence we decided to give the integration with Sanity.io (our CMS) and Netlify a try. For those who have no idea what we are talking about, a small introduction. Since a 6-months we have switched to another CMS, which we chose Sanity.io. There are many options, but being a firm believer in a headless CMS, given that this will almost certainly increase our pagespeed score and thus result in (way) better results in SEO. After chasing a CMS, you will need to choose what Front-end Framework you want to use. We chose for a simple Gatsby Framework as we only have public displayable pages.",
          "Then comes the hosting and as you can imagine there are many options. First, let me tell you that “Free” or “Cheap Hosting” where we started many years ago, is almost certainly going to hurt your results. Their business model is to get as many sites as possible on a single server in order to maximize profits. That is there good right and in many cases this is not necessarily a bad thing. Think websites that are build for Hobby pages. However, for any more serious sport or hobby organization a bigger hosting is oftentimes needed as there is a huge fluctuation of visitors as people might be checking sporting scores during the weekend, but your site might be getting a lot less traction during the week. Those hosting options traditionally start at around $15 USD for a single ubuntu instance.",
          "However, these days a new option is on the market, which is called server less. There are many options there from the more technically advanced do it yourself inside AWS to the more User Friendly Options including netlify. We have given it a try and here is our conclusion:",
          "1) The Hosting is Solid, it comes with many options including Form Processing (including a spam Filter), a solid CDN and CI is working as expected",
          "2) The setup was easy and we setup staging and production in less than 30 minutes using Github",
          "3) Forms can be integrated with our CRM (Yaaaaaay!)",
          "4) There is a solid Spam Filter on all Form Submissions so we do not need to filter (although on occasion some spam slips through)",
          "5) It is cheap",
          "6) It uses AWS infrastructure and is thus very solid",
          "1) There are weird charges for Build Minutes and we have not been able to see how we could speed that up. Expect to spend $20-$40 USD per month during the build phase",
          "2) Extra Members also cost more money ($15 USD per member)",
          "3) When scaling we expect the charges to go up significantly",
          "4) We do see a variation in performance, which is a concern to us. Sometimes, the site is blazingly fast with response times of <200MS, but other times it is over >600MS. Both are still sort of acceptable, but we are concerned about the ups and downs. This might have to do with traffic hitting the server throughout the day, but for us it be better to have it stable.",
          "Overall, we want to see why sometimes the loading times are not on par. That being said, when opening the site in any browser it feels snappy. I think that Netlify is a solid option for most situations."
        ]
      },
      {
        "writtenBy": "Written by Niels Siskens"
      }
    ]
  },
  {
    "date": "June 11, 2020",
    "shortDescription": "Outsourcing your technology, Marketing or Design is the best option especially in a nearshore agency",
    "path": "/blog/2020-06-11-7-reasons-why-outsourcing-can-be-the-smartest-option",
    "title": "7 Reasons Why Outsourcing Can Be The Smartest Option",
    "details": [
      {
        "fullDescription": [
          "7 Reasons Why Outsourcing Can Be The Smartest Option",
          "Having worked for several companies in the IT industry with a nearshore outsourcing model, managed workforce providers, and digital agencies, has given me a wider perspective on why this is such a brilliant solution, seeing all the benefits it brings to startups and well-established businesses.",
          "When I first started my professional journey, I was far from getting involved in what I currently do. Textile engineering and fashion design students don’t just come across software development or sales companies wanting to hire them! Being far from home and in need of a job, I started exploring other hidden talents I might’ve had, coming to the realization I was quite good at planning, organizing, and talking to people, which is why I came to join growth centers offering super talented teams for other companies to outsource. And oh boy, it has been a great journey so far!",
          "While most companies are still in denial about this, outsourcing is a great opportunity. Excuses such as not trusting someone who’s not physically in the office, or the need of external help, I would like to highlight here 7 reasons why outsourcing is great for any business, at any stage:",
          "Resources: Lacking the resources needed to complete a job can be frustrating. Step ahead, and have it done by someone who has the expertise in the specialized area of your interest.",
          "Flexibility: Get an additional workforce for the temporary requirements, set up flexible schedules and contracts.",
          "Reduce Costs: Choosing the perfect partner is going to significantly lower the prices of labor. The cost of some skills can be extremely high, particularly for entrepreneurs. By outsourcing those functions, overhead costs are diminished.",
          "Shared Risk: Every business investment carries a certain amount of risk. Outsourcing providers assume and manage much of this risk for you, with specific industry knowledge, especially security and compliance issues.",
          "Enables Focus on Core Business: Passing on supporting processes, you’ll be able to focus your skills on strengthening and improving the core processes that help make your business stronger.",
          "Enhances Quality Service: Talent and productivity are significantly above average, companies make sure they put and train outsourcing managers in place that will ensure quality remains superb.",
          "Solves Capacity Issues: If we were to go through another situation like the one we are currently facing, having to work from home, or not being able to meet expectations with an office space, this is such a great solution. Having an external team working from independent locations can definitely help get things done without having to be near you.",
          "These are just some of the really important advantages of outsourcing, easy, cost-effective solutions to keep your business running smoothly while you delegate responsibilities and concentrate on other important areas and keep on growing."
        ]
      },
      {
        "writtenBy": "Written by Laura Cotes"
      }
    ]
  },
  {
    "date": "June 04, 2020",
    "shortDescription": "5G is coming here's a brief explanation of what it means and what will change.",
    "path": "/blog/2020-06-04-5g-will-change-your-website-and-here-is-what-to-do-about-it",
    "title": "5G Will Change Your Website And Here Is What To Do About It!",
    "details": [
      {
        "fullDescription": [
          "You may already be familiar with the word 5G from conspiracy theorists believing it to be the cause of COVID-19, which led to some naive individuals burning 5G masts due to being concerned with the potential radiation that may come from these masts.",
          "What 5G can do depends mainly on what signal the 5G runs on. There are three categories of signal bands: high band, mid band and low band. The low band frequency is what 5G will run on.",
          "Early mobile internet was seen as mobile internet with a speed slower than people's WIFI at home, 4G is nearly at par with regular WIFI. 5G however has a 100x better capacity than 4G, and in a not so distant future this will lead to even better internet speed. For example, in order to download a two hour film with 4G, it would take about 6 minutes, meanwhile with 5G it could take as little as 3.6 seconds. An additional feature that 5G will bring is that response times will be almost instantly. Smartphone users will have benefits to help them have easier and more friendly interactions with their network carrier.",
          "This new technology will provide a much more personalized web experience using a technique called network slicing. This consists of creating new wireless networks on the cloud allowing users to create their own network. In simpler words, this means that every device would have its own network in the cloud depending on the specification it has. For instance, an online console game requires faster response times and a better data capacity than a user that just wants to surf the web. This will also benefit businesses such as convention organizers who would be able to purchase bigger slices of the cloud thus improving its visitors' online experience. Overall, a much more interactive internet will be the result. Using 5G, at least in theory, cars could be driven remotely and surgeons could operate surgeries from the comfort of their own homes.",
          "COVID-19 has increased the need for solid reliable 5G internet as more people now see the benefits of working remotely. Some experts predict that by 2025 nearly half of all mobile connections in the U.S. will be 5G. It is common that the west has a more gradual approach to 5G, since in the U.S. the carrier brand AT&T began installing 5G towers in 2018. In the case of industrial zones in selected cities, this technology will be adopted quickly due to their high data and internet speed requirements. In a not so distant future the time will come where 5G fulfills its potential, it will change the way we get internet at home and at work. This 5G wireless network will replace old fashioned phone lines and cables, the change may not happen overnight but 5G is coming.",
          "So what does that mean if you run a website on the internet?",
          "As 5G will make connections instantly, a focus on speed will become even more important than it is in 2020. Loading times that take longer than a few seconds will likely cause your website to be ranked significantly lower.",
          "We will see an increase in headless CMS-es and people will start thinking about offloading the many plugins and software from their servers. We feel that a hosting company like [strattic](https://www.strattic.com/), which hosts the entire site on a CMS will become the new standard.",
          "Therefore, it will not hurt given that Google and other search engines are starting to put more emphasis on speed to make sure your website is as fast as it can possibly be. If you run a CMS like Drupal or Wordpress it’s a good idea to make it \"headless\" and place something like Gatsby or React in front of it.",
          "If someone can download an entire movie of 2 hours in less than 4 seconds, it is not very likely that they will be willing to wait more than a blink of an eye for your server to respond and provide the content that is being asked. This calls for major shifts in the way most websites were built in the last decade or so. A great tool to see your website's loading speed is [GTmetrix](https://gtmetrix.com/reports/staging.parrolabs.com/nVdSKbDK), which you can use for your site."
        ]
      },
      {
        "writtenBy": "Written by Jose Salazar"
      }
    ]
  },
  {
    "date": "May 28, 2020",
    "shortDescription": "Cutting unnecessary expenses may help keep your business floating during this crisis.",
    "path": "/blog/2020-05-28-should-you-reduce-your-ad-spend-during-covid-19",
    "title": "Should You Reduce Your Ad Spend During Covid-19?",
    "details": [
      {
        "fullDescription": [
          "During a recent Marketing Agency Survey, 69% reported that they were expecting a decrease in revenues for the year. That means that many of their clients will likely reduce the number of Ads running through the year.",
          "It can be argued that Ad Spend needs to be a percentage of Revenues. However, if you have no clue what your revenues for the year will be, it is hard to see what you should spend on Ads. That being said, there is bottom of Revenues that you can predict, a kind of doom scenario.",
          "Some industries are more affected than others and wrongly many companies feel that Marketing and Ad Spend are extra costs. However, when companies are going bankrupt here and there it seems more important than ever to show to your customers you are still there.",
          "Additionally, Facebook & Google reported that costs per click have dropped significantly in the last 3 months, making placing ads significantly less expensive than it used to be and most likely will have a better visibility for each individual Ad.",
          "That being said, the counter argument goes that now people are much less likely to buy from you at this very moment. That might be true and for the last couple of month, many businesses have been what I would describe as a “holding Pattern”. They are waiting to see where things are going in the world and given that many don’t even have a physical location right now the decision process is slow.",
          "That does not mean however that you should cut or eliminate your ad budget all together. You need to remain visible on Social Media, in your ads and on different platforms. There are opportunities to reduce naturally as competitors will throw the towel in the ring, but it be better to keep the spend up."
        ]
      },
      {
        "writtenBy": "Written by Niels Siskens"
      }
    ]
  },
  {
    "date": "May 21, 2020",
    "shortDescription": "The pandemic has forced us to change and improve our lives. The virtual world is a new market.",
    "path": "/blog/2020-05-21-trends-that-will-change-the-world-s-consumerism",
    "title": "TRENDS THAT WILL CHANGE THE WORLD’S CONSUMERISM",
    "details": [
      {
        "fullDescription": [
          "The situation we have been facing for a couple of months now has left us a lot of time to reinvent ourselves as individuals and as responsible members of society.",
          "The pandemic has forced us to expand our vision and has evolved the way in which we coexisted with technology which has been a lot more accelerated.",
          "These are some of the trends that the pandemic will leave us as a legacy:",
          "1. Hello virtual world, goodbye to cash!",
          "It has never been so necessary to keep distance between us, and what we can learn from this, is that queuing is not as necessary as we thought, and cash can go into the background if we have a virtual payment method that allows us to do everything easier.",
          "2. Increasing time in front of the screen",
          "Media has been very useful to maintain economic movement in some sectors, but it has also shown that physical presence in an office is unnecessary, the use of smartphones and teleconferences will be endless.",
          "3. A new wardrobe",
          "The epidemic has hit many industries worldwide, and although fashion will have a hard time getting up, people are now aware of the damage we have caused to the planet. So sustainable consumption alternatives like second-hand clothing and the invention of reusable materials will have their moment to shine.",
          "4. Obsession with cleaning",
          "Until now people have dimensioned the importance of cleaning for survival. This situation has made tangible for many the fact, that something tiny could end the greatness of humanity.",
          "5. The way for telemedicine is open",
          "Based on the fact that this pandemic could make many country’s medical system collapse, and despite technological development, we still lack the necessary to face situations like this. Science will most likely develop new technologies to address the shortcomings in the health sector. These might include apps for self-treatment from the comfort of your home, also virtually accompanied by professionals.",
          "It’s a fact that something small can make big changes, this indicates the time of evolution that we have lived since confinement.",
          "It’s a good time to evolve your business, and at Parrolabs we offer a highly trained team to help you grow. We can increase your brand’s recognition on the internet through an eCommerce, an app, or just by being present on social networks.",
          "What are you waiting for? Leave us your contact information."
        ]
      },
      {
        "writtenBy": "Written by Daniel Medina"
      }
    ]
  },
  {
    "date": "May 07, 2020",
    "shortDescription": "AI has evolved through the years, now it's at a point where we have to start paying attention to it.",
    "path": "/blog/2020-05-07-is-artificial-intelligence-a-threat-to-our-society",
    "title": "Is Artificial Intelligence A Threat To Our Society?",
    "details": [
      {
        "fullDescription": [
          "It is an interesting idea that Artificial Intelligence (AI) would somehow take over the world. That being said, cambridge analytica already hacked our Democracies around the world and was (and its successors likely are) heavily using AI.",
          "AI is also being used on the battlefield, think drones that scan the earth's surfaces and AI can be a very useful tool to filter out objects of interest. In our beloved Medellin, the government recently installed camera's throughout the city that through AI can scan not only every license plate, but also every face and can see where that person has been in previous days, weeks or months. This new AI technology will potentially create an impact that we have not seen since the introduction of the internet.",
          "During the lockdown, we have come to realize that Governments have the ability to control pretty much our entire lives when we let them. So, if the government is able to scare people to stay in their houses, there might be a real threat to us when AI will be broadly rolled out.",
          "As many people have come to realize, the camera systems that are in place in Medellin when used correctly can help police to find Criminals quickly, but the same systems can be used to track dissidents or Journalists.",
          "As AI is currently in its infancy, there is no direct threat. However, it is not unthinkable that when AI is used more and more it can be used not only to track but also to control. For example a car that is self-driving could be locking up its passengers and bringing them to the police station for questioning.",
          "This might seem like a plot from a Hollywood movie, but can be turned into reality when AI is not controlled within an independent Body. It is a forceful tool.",
          "For now, luckily most AI applications are peaceful and can help society as more sophisticated products can be made without human labour. Overall, AI offers a real promise for the future. It is a tipping balance, and while there are threats to Society, the overall promise is more promising than its threats."
        ]
      },
      {
        "writtenBy": "Written by Niels Siskens"
      }
    ]
  },
  {
    "date": "April 30, 2020",
    "shortDescription": "Here's what its like to be an assistant in Parrolabs.",
    "path": "/blog/2020-04-30-my-experience-being-a-general-assistant",
    "title": "My Experience Being A General Assistant",
    "details": [
      {
        "fullDescription": [
          "When you hear the term general assistant, what do you think of? Some people might imagine the role as a secretary using a skirt and filing lots of papers, some others might imagine it as someone following administrative tasks. These might be correct, because something general is something without limits, being considered as inexact or undetailed. So to describe what a general assistant does, from my meandering experience, I would say it is basically to give help to daily management tasks.",
          "When I started working in Parrolabs, all that was required was a good level of English and openness to learn. I had already worked before as an adviser, and I kind of thought it was going to be something similar. However, my job was very different and much more diverse. I have been providing support to some development projects, like arranging copy, changing information, helping the QA team and many other smaller tasks. I didn’t know anything about development or digital companies, but I was willing to learn, and I did.",
          "As time passed and the team changed, I gained more responsibilities, mostly related with administration, human resources and accounting. I can say that there is no to-do list, almost every day requires something new; conducting market research, updating and filling databases, writing content for social media, keeping invoices, paying workers, are just some of the tasks.",
          "The main things that I need to have in order to be successful are a good attitude, discipline and order. It is also necessary to have the ability to receive many tasks and organise them in such a way that we can do them all. Grateful for my experience, with the knowledge gained, I can say Parrolabs has helped me to improve in many ways and prepare me for the future."
        ]
      },
      {
        "writtenBy": "Written by Sofia Velasquez"
      }
    ]
  },
  {
    "date": "April 16, 2020",
    "shortDescription": "The situation that the entire world is experiencing today may be improved.",
    "path": "/blog/2020-04-16-some-positive-aspects-of-working-from-home",
    "title": "Some positive aspects of Working From Home!",
    "details": [
      {
        "fullDescription": [
          "The situation that the entire world is experiencing today more than a catastrophe has become a challenge. This has tested our solidarity, trust, recursiveness and even our emotional resistance. Spending hours, days and even weeks in the same place might be challenging for many. Our homes have taken a new role in our lives since it is now an office, a classroom, a gym, and even an amusement park. Where activities and our daily routine has to be different. Getting along with the people you live with might be hard, but we need to make through this time.",
          "We are all going through an extreme situation at the moment. The world economy is being severely affected, people with fewer resources are seriously suffering. That being said, from change comes opportunity and as such our society is experiencing the beginning of a new era. What we are experiencing today is changing our way of thinking, studying, feeling, and working will change forever.",
          "Remote working or Work From Home (WFH) changed from a \"fashion\" to an absolute must. Many entrepreneurs and works alike had to adapt to his new reality and teams are now working remotely entirely. Where in Colombia, distrust is the main obstacle, most employers are now forced to quickly change. We should take this time to include the wonders of technology in our daily lives. This new era invites us to change, where we don’t let our dreams, goals, jobs, and education down. We will come out of this situation by commerce digitization, digital marketing and creating new technologies to help us under any circumstances.",
          "This will also change the way we live. Think about the fact that we may no longer need to live in Packed Cities, but can live more remotely, can travel and live in different places. All due to the fact that we finally embraced the fact that we no longer needed to be face-to-face. The result will likely be that we live longer happier lives.",
          "Today more than ever we have the challenge of working online, humanizing brands, and digitizing processes. Where Colombia is a heavily paper-based society, it will need to catch up if it were to upgrade itself into the 21st century. More than ever before, we need to embrace the 4th Industrial Revolution. We might finally see the need for good User Focussed Design, Great Web & Mobile Development, and Digital Marketing."
        ]
      },
      {
        "writtenBy": "Written by Angela Quinchia"
      }
    ]
  },
  {
    "date": "April 03, 2020",
    "shortDescription": "An environmental catastrophe should have happened years ago how can we prevent it from happening?",
    "path": "/blog/2020-04-03-life-as-we-know-it-should-have",
    "title": "Life As We Know It….Should Have Ended",
    "details": [
      {
        "fullDescription": [
          "All it took for humanity to slow down is a Virus that is more deadly than the seasonal flu, yet nowhere near any of the viruses that our ancestors had to deal with. That is the reality that we are living in today.",
          "As I am contributing to our blog, I am locked in a small apartment as we are fighting what can be my generation's war. That being said, I feel that overall it was Mother Nature starting to send a message and the message is that we are not on the right track.",
          "For years, environmentalists represented most recently by an 18 year old in the name of Greta Thunberg, have been saying we are not on the right track. I was horrified to read that Carnival Cruises pollutes 10-times more than all European Cars Combined ([Luxury cruise giant emits 10 times more air pollution (SOx) than all of Europe's cars – study | Transport & Environment](https://www.transportenvironment.org/press/luxury-cruise-giant-emits-10-times-more-air-pollution-sox-all-europe%E2%80%99s-cars-%E2%80%93-study)). Ironically, one of the first Covid-19 outbreaks was on a cruise-ship.",
          "The Coronavirus does bring people together and makes society more friendly. So now we know that we do not own planet earth, it is good to make use of the time we have to spend indoors for some reflection. It is still not too late to change our course and change the planet and make it more hospitable. For many year, the city that I currently live in, Medellin has been struggling with Air Pollution. However, in 2 weeks of isolation, the city has turned that around and the air is as pure as it ever was.",
          "I do think the current quarantine is an excellent opportunity to reflect on our lives and change it for the better. I would say, we owe it to not just Greta Thunberg, but to ourselves. Most of our most urgent problems aren't difficult to fix from a technological perspective, but it is more that we need to agree as human beings that we should make it a priority. From long supply lines that impact not only our health, but the environment to industrial practices. We can do much better than where we are right now.",
          "I feel that one thing that COVID-19 will bring is a realization that we do need to change course for the better and that we do have the opportunity to all be connected while not being physically connected.",
          "So, while I do fear for our near future, I do think that we are up for a carbon footprint free society and that COVID-19 will bring the change that was overdue for at least 10 years.",
          "Let's be clear, I am not your typical environmentalist, yet I do understand that we need to change course and I think that one pandemic can make us reflect and bring us back on course. Maybe we don't need as much oil to be happy, maybe all it takes is one pandemic and a couple of think-weeks to get things sorted out."
        ]
      },
      {
        "writtenBy": "Written by Niels Siskens"
      }
    ]
  },
  {
    "date": "March 12, 2020",
    "shortDescription": "Engage with Niels Siskens our founder and CEO on how to prepare your company for a downturn.",
    "path": "/blog/2020-03-12-preparing-your-company-for-a-downturn",
    "title": "Preparing Your Company For A Downturn",
    "details": [
      {
        "fullDescription": [
          "“You have to make sure you reduce your costs in order to stay competitive” - my boss at the time told me. It was early 2009 and the financial crisis had reached Europe.",
          "At the time, I did not really understand what he was referring too, but a decade later I full understand what he meant and have lived it myself. As an entrepreneur you are looking at value for everything you pretty much procure. At the beginning of a downturn, sales becomes more difficult and prices are going down. If you are a supplier of some sorts to another business, becoming more efficient and being able to lower your prices can give you the edge and make you stay in business.",
          "Fast forward 11 years, I have been able to change careers from a Procurement Consultant to being an entrepreneur and this life lesson sticks with me until today.",
          "The outsourcing industry usually thrives in a downturn as many companies are scrambling to get cheaper resources. However, I am in the strong opinion that it might be too late to outsource at that stage. While you were enjoying fairly high margins and did not really care about the procurement side of things, this might not have been the same for your competitors. So, while you need to find an outsourcing partner, they are kicking your ass as they already have setup a team remotely.",
          "What is more, your competitors are already in “Partnership mode” with their outsourcing provider and have had optimizations along the way. So, even if you were to obtain the same hourly rates, your competitors are more efficient and this can still give them the edge.",
          "We are in the strong opinion however that in tech outsourcing not only prices can give you the edge. When selecting an outsourcing provider also consider things as (1) Timezones (2) Cultural Backgrounds and (3) Training in Tech Resources / Availability.",
          "So, given the current bear in the Stock Market, it is time to start thinking strategically and reduce costs where you can. At Parrolabs we already made the decision to reduce costs in terms of Office in order to be able to offer a better price level to our clients. We are thinking longer term as we believe there will always be a need for technical resources and have made some Capex investments."
        ]
      },
      {
        "writtenBy": "Written by Niels Siskens"
      }
    ]
  },
  {
    "date": "March 05, 2020",
    "shortDescription": "Learn why animations play a big role in your website from the perspective of a graphical designer.",
    "path": "/blog/2020-03-05-the-5-main-reasons-you-should-never-launch-a-website-without-animation-in-2020",
    "title": "The 5 Main Reasons You Should have Animation In Your Website",
    "details": [
      {
        "fullDescription": [
          "Ever since the web evolved into web 2.0 in the early 2000-sands, web pages that had any moving elements on them got more traction. As people were invited to interact with the elements present on the page. An example that comes to mind is the historical website created for the promotion of the movie Space Jam. Through its design and small animated gifs gave a new sense to user interaction.",
          "In the past, hardware restrictions both on the server side as well as on the user side restricted the quality, length and volume of animations a website could bear. Today, with advances in mobile devices, tablets and desktop computers this no longer is a restriction. Ever since the creation of HTML 5, animations have become easier to implement.",
          "So here is my personal opinion as to why every website should use animations",
          "1. They are an aesthetic support of great value",
          "Modern looking animations give a website a modern look. It’s aesthetic gives it a look that distinguishes it from a website that was created let’s say 5 or 10 years ago. Browsing an older website is rough and slow, loading times oftimes do not live up to current Users who more often times than not are on their mobile phones. Having animations attracts people to interact with the page, leading to improvements of conversions.",
          "2. They are attractive to the public.",
          "Let's be honest, who doesn't like animated graphics?. In social networks video content is much more attractive than an static image. Interaction between the animation and the user creates a whole new experience. This tactic works just fine on social platforms, why not on websites?.",
          "3. They serve as instructions for visitors.",
          "Somehow, blinking buttons get Users attention. In Video Games these are used to push people in the right direction, so they do not get stuck (and likely lose interest in the game). In websites, these can be used to guide people in the right direction. For example to buy a product or to submit a form.",
          "4.They are simple to integrate into a website.",
          "Years ago, it was very difficult to implement any type of animated graphics into websites. The lack of Frameworks and documentation meant that developers were largely on their own. That said, hardware restrictions also meant that animations were limited. Additionally, most websites were using the then popular Flash Technology, which was proprietary and owned by Adobe Corporation.",
          "These days, it is extremely easy to add interaction to virtually anything on a website. There are countless frameworks and video editing software makes it easy to add Video’s or animations to any sort of website.",
          "The only restriction that we are still experiencing is that a background video that automatically loads will affect the size of the website and thus the pagespeed. That being said, there are certain tricks that can circumvent this issue. Webflow is an example of a tool that allows the integration of motion graphics into websites. A key factor that allows this kind of integration is modern day hardware which is powerful enough to handle the job.",
          "5. Rising popularity in modern web pages.",
          "As we previously discussed in social networks video and animations attracts more people than static images. Nowadays, users are not interested in spending time in a video or animation unless it is attractive to them. Implementing interactive and animated content it’s a must in today's world.",
          "These are the five reasons why you should integrate animations into your website. Taking advantage of the fact that in recent years the internet has been changing and improving. Nowadays users have more interactive experience with webpages."
        ]
      },
      {
        "writtenBy": "Written by Samuel Galvis"
      }
    ]
  },
  {
    "date": "February 27, 2020",
    "shortDescription": "Learn from one of our assistants what is like to work at Parrolabs.",
    "path": "/blog/2020-02-27-my-year-as-a-digital-marketing-virtual-assistant-at-a-cloud-specialist",
    "title": "My Year As a Digital Marketing Virtual Assistant At a Cloud Specialist",
    "details": [
      {
        "fullDescription": [
          "As an ambitious person, I entered this company thinking that it would give me the opportunity to improve my English Level. My expectations were high from the beginning as I had no idea what I wanted to work on and this company gave me the opportunity to work in the Digital Marketing area. I have been with them over a year now and we are like a small family. At Parrolabs, you can express how you feel, provide your opinion, and we work closely in a team with various skills.",
          "As an Augmented Digital Marketing Assistant, I am working directly for a US based client. Parrolabs has this model where we work directly with North American Companies and deliver them augmented skilled people from Latin America. As we are strategically located in Medellin, we are always close to our clients. My client is located in Los Angeles as such, we only have two or three hour time difference. That in contrast to other Outsourcing Companies who sometimes have more than 12 hours in time difference.",
          "My client manages Cloud infrastructure for Medium and Large Corporations. They are experts in this field and I am helping them to grow their business. Some of the activities that I do, include; Social Media Posting, Prospecting, Email Marketing and Event Coordination. Even though I am working remotely from another country, I try to be as close as possible to the team via Zoom, Slack and Email.",
          "Being part of both teams has really taught me how to multitask and be a proactive person. Over the last year, I have seen the Parrolabs team mature as well as that I have been able to grow professionally. My ambitions for the next two years are to grow into a fully fledged digital marketing professional. As such, I am currently studying in detail more about Email Marketing, SEM, SEO and Social Media Marketing. Parrolabs has shifted my career and I am now focussed on Digital Marketing.Learn from one of our assistants what is like to work at Parrolabs."
        ]
      },
      {
        "writtenBy": "Written by Karen Gutierrez"
      }
    ]
  },
  {
    "date": "February 20, 2020",
    "shortDescription": "Small glance to Redux Saga and how to start to handle asynchronous request in React.",
    "path": "/blog/2020-02-20-redux-saga-to-handle-asynchronous-request-in-react",
    "title": "Redux Saga to Handle Asynchronous RequestIin React",
    "details": [
      {
        "fullDescription": [
          "Javascript is a great programming language, as time goes by there are more and more new tools based on it, like React Js.",
          "We will review the usage of Redux Saga, which is a middleware library used to control side effects in React projects. To understand this article, a medium knowledge level in React and Redux is required.",
          "The Side Effects received are requests made mainly by us to obtain data from different sources. In general they are API's request or external services. Browser cookies interaction, databases and real time operation.",
          "Normally, In a React project these functionalities are implemented through a life cycle of a component with the code inside of the same file. Small projects are a great solution. When we have a big project we need to have the side effects centralized and Redux Saga Middleware comes in handy.",
          "The redux structure presents: Actions, Actions Creators, Reducers and a Single Store and thanks to Redux we know concepts like: Render, Props, State, Context, Lifecycle, Events.",
          "Reduce Saga aims to make handling side effects so we can introduce a new concept: Sagas, the saga is like a separate thread in your application that's solely for side effects, as the following shows:",
          "The sagas run like middleware because it has Watchers and Workers. The watchers intercept the actions and review a worker to this action and in this case, run the worker function where the steps to resolve the side effect and carry data to store.",
          "Redux Saga is based on Generator Functions, which are functions that can be exited and later re-entered and their context (Variable Binding) will be saved across re-entrances. Its syntax use asterisk to define a function* and the expression yield / yield*, to program steps, pause the function and give a value or delegate to another generator function respectively.",
          "Redux Saga has helpers and effects creators, to see more about it, check out this presentation​ ",
          "Some advantages of use Redux Saga Middleware:",
          "Reference:",
          "https://redux-saga.js.org/​ "
        ]
      },
      {
        "writtenBy": "Written by Maria Giraldo"
      }
    ]
  }
]