[
  {
    "date": "September 03, 2020",
    "shortDescription": "An overview of the rates and cost savings when outsourcing IT staffing",
    "path": "/blog/2020-09-03-an-overview-of-the-rates-and-cost-savings-when-outsourcing",
    "title": "An Overview Of The Rates And Cost Savings When Outsourcing",
    "details": [
      {
        "fullDescription": [
          "First of all, these terms all come down the same thing, meaning you are contracting someone else to do something for you somewhere else. Where On-shoring is considered you outsourcing to some firm in the same country, usually for process optimization and efficiencies, nearshore outsourcing and far-shoring usually mean that you are trying to optimize both processes as well as Cost given the optimized cost of labour.",
          "So having a Software Development Team at an Outsourcing provider will certainly benefit you the Time Difference when doing FarShoring will have a hidden cost. We will not bring that over in this overview as that would be hidden costs as it is hard to measure but when staying in a similar timezone you will certainly not have to worry about night or weekend work. As Nearshore Partners, Parrolabs certainly can be perceived as biased towards near-shoring, but here an overview of the rates that we see in the market from our colleagues. ",
          "These can have massive payrolls to pay to their developers. Imagine that you are a 10 person software house with each developer earning $150.000 USD. The average developer will work around 1800 hours per year. Given that only 65%-70% are really billable (so called utilization), these agencies need to charge at least $130 USD per hour just to break even on the hours alone.",
          "So there is no surprise that most On-shore Software Development Outsourcing Agencies have rates upwards of $150-$250 USD an hour. That is just to pay for their Developer Salaries, so they are under constraint to keep performing and to keep selling their outsourcing services. While there are certainly efficiencies with Communication to have an onshore outsourcing team, for many Clients these rates are no-longer attainable. There are also many On-shore Software Development Outsourcing Agencies that have partnered with Offshore Agencies to have a better rate mix.",
          "Farshore is the most complicated and while this can be beneficial for large corporations who have huge developer needs, the additional costs are in general not worth it if you are not a global fortune-500 company. Always remember that Fortune-500 companies are not farshoring because they want the cheapest prices, but they are doing it as the local talent pool is not cutting it. So they are merely doing it to keep their systems running even if it means adding a lot of complexities to their organization.",
          "Rates that we see in India/ Pakistan and Bangladesh Vary a little bit. It depends on the provider, but they should be around $25-$45 per hour for the majority of developers. They are somewhat on the lower end in Bangladesh and a lot higher on the spectrum in the Indian MegaCities. You can find rates that are significantly lower than the range, but great developers in India are in high demand and they have good salaries. So all in all, if you find a price that is significantly lower than the range, you are warned!",
          "Here we also see a range. The range is anywhere from $30 USD - $75 USD an hour and varies among countries and regions. Eastern Europe is the Nearshore Development Service Provider for Western Europe and has seen it's rates go up significantly with Poland now being in the +$40 USD an hour range.",
          "By far the most popular nearshore country in the Americas is Costa Rica. A relatively small country, but with a stable government and a highly educated workforce. In recent years, rates have gone up and many companies are forced to look somewhere else. Near-shoring new destinations are Colombia, Mexico, Argentina and Brazil.",
          "In recent years, many former Costa Rican Companies flung to Colombia and Argentina as they offer larger Talent Pools and due to the upswing in Costa Rican Prices. As Parrolabs is in Colombia, we can best talk about the market here. We see a huge difference in pricing of resources with just a basic level of English and resources that speak English.",
          "At the moment, Colombian Tech Resources typically go in the range of $35 - $55 Per hour."
        ]
      },
      {
        "writtenBy": "Written by Niels Siskens"
      }
    ]
  },
  {
    "date": "August 27, 2020",
    "shortDescription": "Our new abroad location is now open and available to the public.",
    "path": "/blog/2020-08-27-parrolabs-goes-texas-we-just-opened-another-location-in-austin-texas",
    "title": "Parrolabs goes Texas! We just opened another Location in Austin Texas",
    "details": [
      {
        "fullDescription": [
          "Austin Texas has proven to be an excellent location with a sprawling tech scene. It is providing us with the opportunity to get boots on the ground in a new location.As we are experiencing Covid-19, we will not have a physical presence for the foreseeable future and will use the facilities of Creative Scape for our virtual presence. Parrolabs is looking forward to partnering with Austin based companies or organizations.",
          "For the last few years, we have had clients from the area. Since 2018, We’ve seen a constant stream of client interest from the region. That made us believe that we would benefit setting up shop in the area.Parrolabs can be reached at +1 484-918-9765 and our Address in Austin is: 701 Tillery St #12 #27 Austin, TX 78702, USA. We are generally available 08:00 AM - 05:00 PM Austin Time.",
          ""
        ]
      },
      {
        "writtenBy": "Written by Niels Siskens"
      }
    ]
  },
  {
    "date": "August 21, 2020",
    "shortDescription": "In this week's blog we will discuss the most popular web development platforms.",
    "path": "/blog/2020-08-21-most-popular-web-development-platforms-of-2020",
    "title": "Most popular Web Development Platforms of 2020",
    "details": [
      {
        "fullDescription": [
          "The state of the internet in 2020 can best be described as a huge wasteland with a few oasis that are green. Where it started relatively small, it has grown to be a clutter of data that no human will ever be able to see the full size of.For example , to play all songs that are on the internet would take 2.2 billion years according to Starry. Let’s not start with how long it would take to read every website. So, the trick is no longer just about building a website, it is about building a website that performs.As such, probably the top 2M websites globally will get 99% of the traffic out there. If you are below that, you will for sure be in the dessert wasteland of the internet.So you might wonder how do you know where is my website ranked? For that we are using the popular Alexa Ranking. For the last 2 years, our website has been steadily above the 2 Million Ranking. In general our clients are well within that range.It is well-known that the most popular framework on the web today is Wordpress. It is being used by large corporations as well, but almost exclusively as a CMS as that is what it is meant for. It is widely present in the bottom half of internet websites, so we decided to check the top 100.000 for the most popular Web Development Platforms. Sort of, setting yourself up for success.",
          "Some of these platforms are really old. Getting your site out there and promoting it takes considerable time and effort. Many of the top-100 sites use legacy systems in the back. Think Airlines for example, they are using 30-40-50 year old software packages that yes have seen new hardware over the years and have been upgraded in terms of front-end. However, the core of the Technology has its origins when the internet was no more than an oil Drum.",
          "The web is constantly changing. Where the trend was to go from static websites to primarily Dynamic Sites (think Drupal, WordPress), it is reversing to go Static Again, but using Microservices to make your site dynamic.Overall, Static Websites are a lot faster and this will return in significantly better SEO. Like we wrote in our article about Serverless. This trend we see in the top 100.000.",
          "Top websites known that maintaining a website is just as important as actually building a website. You are never done, when a website seems done another issue pops up, a feature needs to be build, it needs to get promoted. So the top 100.000 websites set money apart for all of that. You can be in the top too, but you need to be wise and start humble. Again, think 10 years, not 1 year(!).",
          "The last couple of years, we see a trend that Speed in SEO is an increasingly important factor. Given the mobile compatibility it is more and more important to have a speedy website. So we see a trend that while internet speeds are going up, the size of websites decreases.This is especially true for the top 10000, where we see a lot of React, Angular and VueJS Websites.",
          "We feel that in conclusion when you start with a new website, keep it simple. If it is just you, do not attach a CMS. Build a very simple site using Gatsby or something similar. Structure it right, but do not go overboard. Sitespeed is your friend, and patience is another really important factor."
        ]
      },
      {
        "writtenBy": "Written by Niels Siskens"
      }
    ]
  },
  {
    "date": "August 13, 2020",
    "shortDescription": "Learn in a few short steps on how to nearshore an amazing logo from our guest writer.",
    "path": "/blog/2020-08-13-how-to-nearshore-an-amazing-logo-in-3-steps",
    "title": "How to NearShore a Great Logo in 3 Steps",
    "details": [
      {
        "fullDescription": [
          "Starting your own business? Need to create a logo? A company logo may materialize at different stages for different businesses, the important action is creating a logo that clearly communicates your company message and leaves an impression upon your customer.",
          "Whether you decide to dedicate the time to create your own logo, or you prefer to work with a Nearshore Digital Agency, these are the 3 fundamental steps to complete on your own logo creation journey.",
          "Step one: Define the values that represent your company. Conceptualize. This is the first step that lays the foundation for everything that follows. Based on company values, express the message you want to communicate with your logo.",
          "First impressions are everything, that’s why short, direct, and concise messages are often the most effective. Get rid of anything extra. Keep what's strong, get rid of what's not. If your message or logo isn’t clear and you rush your logo to the next phase, you will only confuse customers.",
          "Step two: To the drawing board! Now that you have your company values and message to lead you, you can begin to examine different sketches and visuals of your logo. Most designers recommend choosing the form of your logo first and then the color(s). While one isn’t necessarily more important than the other, order can optimize creation.",
          "In this phase, you can begin to get select feedback from trusted sources. The experts in this stage look for a form that is scalable and works on as many different surfaces as possible. The simplicity of a great logo allows your company the flexibility to take advantage of diverse and innovative marketing opportunities. You might want to put your logo on a t-shirt, a tennis ball, a water bottle, a website, a cell phone or an email. For this reason designers often prefer using just one principal color. Afterwards, if they want more color they may choose tones of the same color to highlight or accent.",
          "Step 3: This is the ultimate step. Focus on details. Now you should have chosen between the final versions of your sketches. Similarly to when you sought feedback from a select few friends, now you want to get feedback from everyone you can. This is the moment to make sure your customers understand your message and identify with your logo.",
          "This is where the experts really shine. This is your final draft, your final product, the decisive detailed revision before you present your masterpiece to the world. What separates the best from the rest? Some people reach this step and are already married to their idea, even when the user feedback shows that the customers don’t clearly understand the message. Many times you have to go back to the drawing board. The best logos can stand the test of time, but only when you invest the proper amount of time.",
          "In a nutshell, creating a logo, no matter who creates it, is done using these three steps. If you have the time, talent, and training to do so yourself you can get to work right away. If your business is in a position to grow, use a Nearshore Digital Agency and save time, money, and headaches.",
          ""
        ]
      },
      {
        "writtenBy": "Written by Thomas King"
      }
    ]
  }
]