[
  {
    "date": "June 11, 2020",
    "shortDescription": "Outsourcing your technology, Marketing or Design is the best option especially in a nearshore agency",
    "path": "/blog/2020-06-11-7-reasons-why-outsourcing-can-be-the-smartest-option",
    "title": "7 Reasons Why Outsourcing Can Be The Smartest Option",
    "details": [
      {
        "fullDescription": [
          "7 Reasons Why Outsourcing Can Be The Smartest Option",
          "Having worked for several companies in the IT industry with a nearshore outsourcing model, managed workforce providers, and digital agencies, has given me a wider perspective on why this is such a brilliant solution, seeing all the benefits it brings to startups and well-established businesses.",
          "When I first started my professional journey, I was far from getting involved in what I currently do. Textile engineering and fashion design students don’t just come across software development or sales companies wanting to hire them! Being far from home and in need of a job, I started exploring other hidden talents I might’ve had, coming to the realization I was quite good at planning, organizing, and talking to people, which is why I came to join growth centers offering super talented teams for other companies to outsource. And oh boy, it has been a great journey so far!",
          "While most companies are still in denial about this, outsourcing is a great opportunity. Excuses such as not trusting someone who’s not physically in the office, or the need of external help, I would like to highlight here 7 reasons why outsourcing is great for any business, at any stage:",
          "Resources: Lacking the resources needed to complete a job can be frustrating. Step ahead, and have it done by someone who has the expertise in the specialized area of your interest.",
          "Flexibility: Get an additional workforce for the temporary requirements, set up flexible schedules and contracts.",
          "Reduce Costs: Choosing the perfect partner is going to significantly lower the prices of labor. The cost of some skills can be extremely high, particularly for entrepreneurs. By outsourcing those functions, overhead costs are diminished.",
          "Shared Risk: Every business investment carries a certain amount of risk. Outsourcing providers assume and manage much of this risk for you, with specific industry knowledge, especially security and compliance issues.",
          "Enables Focus on Core Business: Passing on supporting processes, you’ll be able to focus your skills on strengthening and improving the core processes that help make your business stronger.",
          "Enhances Quality Service: Talent and productivity are significantly above average, companies make sure they put and train outsourcing managers in place that will ensure quality remains superb.",
          "Solves Capacity Issues: If we were to go through another situation like the one we are currently facing, having to work from home, or not being able to meet expectations with an office space, this is such a great solution. Having an external team working from independent locations can definitely help get things done without having to be near you.",
          "These are just some of the really important advantages of outsourcing, easy, cost-effective solutions to keep your business running smoothly while you delegate responsibilities and concentrate on other important areas and keep on growing."
        ]
      },
      {
        "writtenBy": "Written by Laura Cotes"
      }
    ]
  },
  {
    "date": "June 04, 2020",
    "shortDescription": "5G is coming here's a brief explanation of what it means and what will change.",
    "path": "/blog/2020-06-04-5g-will-change-your-website-and-here-is-what-to-do-about-it",
    "title": "5G Will Change Your Website And Here Is What To Do About It!",
    "details": [
      {
        "fullDescription": [
          "You may already be familiar with the word 5G from conspiracy theorists believing it to be the cause of COVID-19, which led to some naive individuals burning 5G masts due to being concerned with the potential radiation that may come from these masts.",
          "What 5G can do depends mainly on what signal the 5G runs on. There are three categories of signal bands: high band, mid band and low band. The low band frequency is what 5G will run on.",
          "Early mobile internet was seen as mobile internet with a speed slower than people's WIFI at home, 4G is nearly at par with regular WIFI. 5G however has a 100x better capacity than 4G, and in a not so distant future this will lead to even better internet speed. For example, in order to download a two hour film with 4G, it would take about 6 minutes, meanwhile with 5G it could take as little as 3.6 seconds. An additional feature that 5G will bring is that response times will be almost instantly. Smartphone users will have benefits to help them have easier and more friendly interactions with their network carrier.",
          "This new technology will provide a much more personalized web experience using a technique called network slicing. This consists of creating new wireless networks on the cloud allowing users to create their own network. In simpler words, this means that every device would have its own network in the cloud depending on the specification it has. For instance, an online console game requires faster response times and a better data capacity than a user that just wants to surf the web. This will also benefit businesses such as convention organizers who would be able to purchase bigger slices of the cloud thus improving its visitors' online experience. Overall, a much more interactive internet will be the result. Using 5G, at least in theory, cars could be driven remotely and surgeons could operate surgeries from the comfort of their own homes.",
          "COVID-19 has increased the need for solid reliable 5G internet as more people now see the benefits of working remotely. Some experts predict that by 2025 nearly half of all mobile connections in the U.S. will be 5G. It is common that the west has a more gradual approach to 5G, since in the U.S. the carrier brand AT&T began installing 5G towers in 2018. In the case of industrial zones in selected cities, this technology will be adopted quickly due to their high data and internet speed requirements. In a not so distant future the time will come where 5G fulfills its potential, it will change the way we get internet at home and at work. This 5G wireless network will replace old fashioned phone lines and cables, the change may not happen overnight but 5G is coming.",
          "So what does that mean if you run a website on the internet?",
          "As 5G will make connections instantly, a focus on speed will become even more important than it is in 2020. Loading times that take longer than a few seconds will likely cause your website to be ranked significantly lower.",
          "We will see an increase in headless CMS-es and people will start thinking about offloading the many plugins and software from their servers. We feel that a hosting company like [strattic](https://www.strattic.com/), which hosts the entire site on a CMS will become the new standard.",
          "Therefore, it will not hurt given that Google and other search engines are starting to put more emphasis on speed to make sure your website is as fast as it can possibly be. If you run a CMS like Drupal or Wordpress it’s a good idea to make it \"headless\" and place something like Gatsby or React in front of it.",
          "If someone can download an entire movie of 2 hours in less than 4 seconds, it is not very likely that they will be willing to wait more than a blink of an eye for your server to respond and provide the content that is being asked. This calls for major shifts in the way most websites were built in the last decade or so. A great tool to see your website's loading speed is [GTmetrix](https://gtmetrix.com/reports/staging.parrolabs.com/nVdSKbDK), which you can use for your site."
        ]
      },
      {
        "writtenBy": "Written by Jose Salazar"
      }
    ]
  },
  {
    "date": "May 28, 2020",
    "shortDescription": "Cutting unnecessary expenses may help keep your business floating during this crisis.",
    "path": "/blog/2020-05-28-should-you-reduce-your-ad-spend-during-covid-19",
    "title": "Should You Reduce Your Ad Spend During Covid-19?",
    "details": [
      {
        "fullDescription": [
          "During a recent Marketing Agency Survey, 69% reported that they were expecting a decrease in revenues for the year. That means that many of their clients will likely reduce the number of Ads running through the year.",
          "It can be argued that Ad Spend needs to be a percentage of Revenues. However, if you have no clue what your revenues for the year will be, it is hard to see what you should spend on Ads. That being said, there is bottom of Revenues that you can predict, a kind of doom scenario.",
          "Some industries are more affected than others and wrongly many companies feel that Marketing and Ad Spend are extra costs. However, when companies are going bankrupt here and there it seems more important than ever to show to your customers you are still there.",
          "Additionally, Facebook & Google reported that costs per click have dropped significantly in the last 3 months, making placing ads significantly less expensive than it used to be and most likely will have a better visibility for each individual Ad.",
          "That being said, the counter argument goes that now people are much less likely to buy from you at this very moment. That might be true and for the last couple of month, many businesses have been what I would describe as a “holding Pattern”. They are waiting to see where things are going in the world and given that many don’t even have a physical location right now the decision process is slow.",
          "That does not mean however that you should cut or eliminate your ad budget all together. You need to remain visible on Social Media, in your ads and on different platforms. There are opportunities to reduce naturally as competitors will throw the towel in the ring, but it be better to keep the spend up."
        ]
      },
      {
        "writtenBy": "Written by Niels Siskens"
      }
    ]
  },
  {
    "date": "May 21, 2020",
    "shortDescription": "The pandemic has forced us to change and improve our lives. The virtual world is a new market.",
    "path": "/blog/2020-05-21-trends-that-will-change-the-world-s-consumerism",
    "title": "TRENDS THAT WILL CHANGE THE WORLD’S CONSUMERISM",
    "details": [
      {
        "fullDescription": [
          "The situation we have been facing for a couple of months now has left us a lot of time to reinvent ourselves as individuals and as responsible members of society.",
          "The pandemic has forced us to expand our vision and has evolved the way in which we coexisted with technology which has been a lot more accelerated.",
          "These are some of the trends that the pandemic will leave us as a legacy:",
          "1. Hello virtual world, goodbye to cash!",
          "It has never been so necessary to keep distance between us, and what we can learn from this, is that queuing is not as necessary as we thought, and cash can go into the background if we have a virtual payment method that allows us to do everything easier.",
          "2. Increasing time in front of the screen",
          "Media has been very useful to maintain economic movement in some sectors, but it has also shown that physical presence in an office is unnecessary, the use of smartphones and teleconferences will be endless.",
          "3. A new wardrobe",
          "The epidemic has hit many industries worldwide, and although fashion will have a hard time getting up, people are now aware of the damage we have caused to the planet. So sustainable consumption alternatives like second-hand clothing and the invention of reusable materials will have their moment to shine.",
          "4. Obsession with cleaning",
          "Until now people have dimensioned the importance of cleaning for survival. This situation has made tangible for many the fact, that something tiny could end the greatness of humanity.",
          "5. The way for telemedicine is open",
          "Based on the fact that this pandemic could make many country’s medical system collapse, and despite technological development, we still lack the necessary to face situations like this. Science will most likely develop new technologies to address the shortcomings in the health sector. These might include apps for self-treatment from the comfort of your home, also virtually accompanied by professionals.",
          "It’s a fact that something small can make big changes, this indicates the time of evolution that we have lived since confinement.",
          "It’s a good time to evolve your business, and at Parrolabs we offer a highly trained team to help you grow. We can increase your brand’s recognition on the internet through an eCommerce, an app, or just by being present on social networks.",
          "What are you waiting for? Leave us your contact information."
        ]
      },
      {
        "writtenBy": "Written by Daniel Medina"
      }
    ]
  }
]