[
  {
    "date": "May 27, 2021",
    "shortDescription": "There are a lot of online tools that you can use to work on your brand to improve your digital marketing process",
    "path": "/blog/2021-05-27-apps-to-improve-the-design-of-your-brand",
    "title": "Apps to improve the design of your brand",
    "details": [
      {
        "fullDescription": [
          "Hyperconnectivity has become one of the main characteristics of this generation, for this reason, the digital presence of a brand has become fundamental for its development and the use of digital marketing as its most powerful weapon.",
          "Surely, your brand is already on social networks but algorithms can make it difficult to see your business, especially if you do not publish frequently; and take into account that stories are the most powerful means of maintaining contact with users.",
          "In this blog post, we will teach you some tools to create Instagram Stories content that will be very useful to keep you growing.",
          "",
          "Before recommending apps and tricks, we must be clear that an attractive visual identity is essential to attract users, in addition to assertive and clear communication according to your consumers.",
          "To improve the design of your stories, we recommend Mojo, an app that can help you with the production of your audiovisual content, providing you with fully editable templates of various styles, so that it's very easy to convert static content into animated content. It also provides royalty-free music for your use. Only available for mobile.",
          "If the design is not one of your strengths, Adobe Spark post allows you to use photos and videos to make your content more interactive, it also allows you to create your own filters. Achieving a differentiating style is very easy with its free image bank. You can find it on mobile and desktop.",
          "",
          "If your brand is much more spontaneous than neutral, we recommend Prequel, an image editor with filters and effects focused on beauty and aesthetics. It allows you to use stickers, flashes, and presets not only on images but also on videos. Available only for mobile.",
          "",
          "And finally Word Swag. If your brand is much more active in communication, this app allows you to convert the text into amazing designs that will be very attractive for your feed and stories. Available only for mobile.",
          "In conclusion, there are a lot of online tools that you can use to work on your brand to improve your digital marketing process."
        ]
      },
      {
        "writtenBy": "Written by Daniel Medina"
      }
    ]
  },
  {
    "date": "May 13, 2021",
    "shortDescription": "Are there any of the elements that can make a company a “good employer” or an “appetizing company",
    "path": "/blog/2021-05-13-manage-the-brand-as-an-employer",
    "title": "Manage The Brand As An Employer",
    "details": [
      {
        "fullDescription": [
          "Brands' reputation are managed intensively in organizations to create a positive image with its customers and to differentiate their brand. But, what are the requirements to be hired as a good employer?",
          "Employees are part of a group of collaborators that organizations should value greatly because they are dedicated individuals with talent who are ready to work, and keep a company going.",
          "Being a good employer is not necessarily just offering superior salaries to the labor market without any additional economic benefits. Efficient employer brand management aims to work towards harmony between human talent and the marketing management process. It also needs an initiative with clear objectives in terms of skills to retain and attract talent to their company.",
          "Every now and then, people in the recruitment process who look for employees have been known for working in the design world as well. Selection processes can take up to many years. The initial step of the process starts within a single life, which is when the employer chooses his employees. Afterwards comes the conversion to double life, which is the aspirant who decides whether this will be his future job. Lastly, recruiters decide whether to invest in different sources that are more available such as social networks, among others.",
          "From the point of view of employees, the reputation of the organization in which it is built is based on trust, admiration, and respect that belongs to the poor. Charles Fombrum (Co-founder of Reputation Institute) defines it as “the expectations that the person has in relation to the company and what it means is that the company has been successful in meeting their expectations. The better you are, the better your reputation will be. ”",
          "Managing a brand as an element of attraction is a strategy to train the most talented, and used to differentiate in an entity that is more competitive.",
          "One must ask, are there any of the elements that make a company a “good employer” or an “appetizing company”?",
          "Organizational culture, directive capacity, clarity of objectives, communication and leadership styles, humanitarian management policies, livelihood activities, promotion of sustainable living styles, work-life and work-life balance, are some of the characteristics that identify companies that manage their brand as employers.",
          "Evidently, managing a brand as an employer is not an astute relationship made up of only communication. It requires all action and sustainable behavior for a long time.",
          ""
        ]
      },
      {
        "writtenBy": "Written by Alejandra Berrio"
      }
    ]
  },
  {
    "date": "April 30, 2021",
    "shortDescription": "DesignOps “The focus now is to reinvent, pivot, or create new experiences.”",
    "path": "/blog/2021-04-30-designops-product-strategy-and-organizations",
    "title": "DesignOps: Product, strategy and Organizations",
    "details": [
      {
        "fullDescription": [
          "DesigOps is a somewhat new term in organizations, but not a really new position or career, there’s a high chance that in your business or team is already a person with the responsibilities of a Practice Designer, Organizational Designer, or Program Manager.",
          "The principle for DesignOps is that you can't change the product without changing the organization, based on that statement, more and more teams in the tech industry and many other industries that rely on design are starting to implement design systems and design thinking, not only into their service areas but also on the management side, especially after the pandemic left the business without a path forward or showed many flaws and lack of planning on the inside. the focus now is to reinvent, pivot, or create new experiences.",
          "We used to think that in order to deliver great experiences we just need to get the design right, which is still true, but now what we are seeing it's that not only we need to focus on product, design, or strategy, but that the unseen stuff behind the scenes, that ultimately affects the quality, is what we really need to focus on, and as designers, we need to intentionally design and redesign the organization in order to get it right.",
          "This is especially true if you want to realize the investment that companies are making into the design. After covid what we are seeing is companies making an effort and putting more resources into design, but they are not really recognizing the potential that they could. The reason for that could be, that business leaders are not familiar with design, or don't know how to establish it in the context of the organization, in this case, is the responsibility of the designers to take the initiative and to push change within the company, like Bob Schwartz said: “designers need to show up as business people first”.",
          "And it makes sense, we have a lot of discussions about design thinking or design making in our businesses, if it is one or the other or both when the key thing is to define design roles that adapt to the need of our organization and optimize the company for the result we expect.",
          "The same way we put so much effort into designing software that doesn't have a single point of failure, that way, we should design our organizations."
        ]
      },
      {
        "writtenBy": "Written by Juan David Rivera"
      }
    ]
  },
  {
    "date": "April 15, 2021",
    "shortDescription": "Let’s face it, there are many Javascript Frameworks these days.",
    "path": "/blog/2021-04-15-why-choose-react-as-your-javascript-framework",
    "title": "Why choose React as your Javascript Framework?",
    "details": [
      {
        "fullDescription": [
          "",
          "Let's face it, there are many Javascript Frameworks nowadays. From Single Page Automators like Gatsby JS or NextJs, to more advanced frameworks like Angular or React. The question remains, what benefits will these frameworks have for the many different types of projects out there?",
          "So first of all we must ask, why do we need a Front End Framework in the first place?",
          "Like with WordPress and quick site builders like WIX, having the majority of the internet in our hands, why should we consider working with a Front End Framework? I mean, if we can make a WordPress website for a few thousand bucks, why should we consider spending up to 50-times that price?",
          "From my perspective the difference is not that significant, however we can compare this with a sport. For example, there are plenty of people who play tennis, and the vast majority of them know how to hit a ball very well. Now let’s say you are facing Serena Williams, you will then have to come differently prepared. The same can be said about Web Development. In 2018 when Google put a bigger emphasis on website speed, getting a better site has gotten more important. Headless, is the way to go in this case.",
          "So while it would be hard to compare React to other frameworks from my perspective, as I have only studied React JS and Gatsby JS, this does not mean that React is easy to learn.",
          "This means that a lot of people can study React and the community will be supportive of new people. If you can pick up the basics in a few weeks, it is easy to see people will keep working with it and that the community will keep growing.",
          "React JS has an opinionated structure, meaning that guidelines for best practices will need to get followed. This means it is easy to see who is a great developer and which ones still have a few things to learn.",
          "React JS is backed by a Global Community of enthusiastic developers. There are huge corporations contributing to the open-source code. The Framework has come a long way since its release in 2013 by Facebook. Contributions and improvements to the framework are almost constant given the size of the community.",
          "Facebook and others keep focusing on contributing to the framework and with more and more devices coming, I would expect that the framework will continue being improved.",
          "Now let's get a bit more technical. What makes React great and also super fast to implement is its usage of components. If you look at the Parrolabs website, you will see that many elements are similar albeit with a different color. You might have noticed that the site is loading almost instantly, this is because the site is pretty much already loaded when you click a link.",
          "Using components in your website will speed things up tremendously and will ensure that things are moving quickly. So this is an absolute benefit of using ReactJS.",
          ""
        ]
      },
      {
        "writtenBy": "Written by Erik Beltran"
      }
    ]
  }
]