[
  {
    "date": "October 29, 2020",
    "shortDescription": "Covid-19 will impact the Real Estate Market, Outbreak Permanently Change America",
    "path": "/blog/2020-10-29-covid-19-outbreak-permanently-change-america",
    "title": "Will the Covid 19 Outbreak Change America like 9/11 did",
    "details": [
      {
        "fullDescription": [
          "It has been nearly 20 years since 9/11 happened. For those of us old enough, we do remember exactly where we were when we saw the first plane entering the Twin Towers. The Airport Security Measures afterwards as well as the many changes in Society might be shadowed by the impact that Covid-19 might have.",
          "While 9/11 and Covid-19 have some similarities in the sense that most of us did not see it coming, there are also definitely a lot of differences. Covid-19 directly impacts everyone where 9/11 was a more localized event and also Covid-19 will last a lot longer.",
          "It is hard to directly see the impact it will have in the long run, but what we do know is that likely Cities will get altered. I am seeing that in my hometown Medellin, where the demand for Apartments is on the decline and the demand for outside living is on a steep increase. People want more freedom and with the revolutionary WFH policies that likely last for the next few years, we will see that not only suburbs might increase and city centers might become less popular.",
          "Who would want to live in a small apartment if he can live in a Suburban House? We will see that people will live further away from their offices. It can be that working from a remote cabin has its appeals to many people, and that cities will become less crowded.",
          "Likely, people will spread more. I am seeing that Colorado will likely be overflown with people from California where the real estate market has reached peak pricing. So many people will be driven out, to make other decisions. It would be appealing to get a great house and have more money in the end of the month. Many people might also start to move outside of the US. Canada comes to mind, but so comes Latin America. I have seen his happening in the last 5-6 years. More and more people decide to work remotely. For a little bit or for a longer period of time.",
          "So yes, I think that Covid-19 will impact the Real Estate Market, but not for the reasons that it impacted before. I think it will equal out the real estate market further."
        ]
      },
      {
        "writtenBy": "Written by Niels Siskens"
      }
    ]
  },
  {
    "date": "October 16, 2020",
    "shortDescription": "Here's how the internet may help to make the world a contamination-free environment.",
    "path": "/blog/2020-10-16-the-energy-future-of-the-internet",
    "title": "The Energy Future Of The Internet",
    "details": [
      {
        "fullDescription": [
          "The internet has brought us some of the biggest technological advances in the last decades. It has brought us closer together, made access to information universal and lastly brought our sponsorships together.",
          "However, it also comes at a cost. As much as 10% of the world's Electricity Consumption can be attributed to the internet. Only a fraction of people who use the internet realize that their messages are going through servers and get processed by hundreds if not thousands of KM of Wiring.",
          "The issue is that all of these systems need to be powered and need to be powered on almost all the time. The trend luckily is that there are a few larger vendors that are taking a bigger market share. The good thing about that is that these vendors are able to balance the need for their servers and switch them off during the times where usage is minimal.",
          "That being said, it is something we will keep in mind. Given that having a physical location further away is no longer a real problem, it is time for us to think about the locations of our internet. There is a real opportunity here as some locations, like Iceland, Morocco, Colombia and China have the means and capacity to generate enough green electricity through Earth Warmth, Hydro and Sun to power most of our Data Servers Needs.",
          "Having these locations would mean a reduction in costs, but also it would mean a reduction in the CO2 needs of our daily internet usage. There is a tremendous opportunity to diversify our internet further.",
          ""
        ]
      },
      {
        "writtenBy": "Written by Niels Siskens"
      }
    ]
  },
  {
    "date": "September 30, 2020",
    "shortDescription": "Parrolabs joins the Seamless.ai presidents club due to the efforts of our Laura Cotes",
    "path": "/blog/2020-09-30-parrolabs-joins-the-seamless-ai-7-figure-presidents-club",
    "title": "Parrolabs Joins The Seamless.Ai 7-Figure Presidents Club",
    "details": [
      {
        "fullDescription": [
          "Getting our Strategy Sorted late last year, we have made the switch from purely focussing on Web & Mobile Development to becoming a Nearshore Partner for everything that can be done remotely, but where communication is required. One of the focal points is becoming an Outsourced B2B Sales Provider.",
          "We want to focus on getting proper Sales Teams for our Customers and Partners for whom Outsourcing Sales seems a little bit difficult at first. We do anything from Lead Generation, yes I know we have a lot of competition in that field, to setting up Sales Processes as well as getting the Sales Function and Sales Process to the next level.",
          "As such, we had to hire a rockstar for getting the Sales Function Setup properly in addition to getting Sales Professionals to join us. We started with improving the sales function for ourselves as there were several aspects that could be streamlined.",
          "The first aspect was getting lead generation sorted. When our new Business Development Manager joined us it could be said that the first thing that could be significantly improved is the fact that we were generating leads manually. While this was a strategy that worked for sometime, the process was slow and besides our best efforts leads weren't always the right person.",
          "Laura introduced us to seamless.ai an AI lead generation tool that we've come to love. For our customers, she has been able to generate nearly $2M USD in sales in less than 1 year. That is an impressive performance as that literally means tracking thousands of leads, which using modern sales tools she was happy to manage. In addition to managing several Sales Reps who contact our client's client's via phone, chat, email and whatsapp. The teams performance is impressive given how young the Sales Operation is. Proper Lead Generation is more important than ever given the dent that Covid-19 is having on most companies. Reaching the right people will affect your Bottom Line for the better and will ensure that your Sales Operation does get the boost it needs.",
          "All in all, congratulations to Laura and the rest of the Sales Teams. We are looking forward to getting to see you go to the 8-figure Diamond Level Presidents Club!"
        ]
      },
      {
        "writtenBy": "Written by Niels Siskens"
      }
    ]
  },
  {
    "date": "September 17, 2020",
    "shortDescription": "How to properly engage with an outsourcing partner and be successful at it.",
    "path": "/blog/2020-09-17-engage-with-and-outsourcing-partner",
    "title": "How to Engage with an Outsourcing Partner",
    "details": [
      {
        "fullDescription": [
          "This One Might Be Obvious, But Reviews Online Are Easy To Make. This Way You Can Create An Entire Bubble Around Your Company Of Positivity. You Can Even Place Them Online And I Have Recently Discovered Some Scammers Are Even Going As Far As Using Deepfake Videos To Show \"Reviews\". In The Near Future, It Will Be Much Harder To Check. As Such, Before Selecting A Dev Partner, Check If They Have Any Reviews On A Site Like Clutch.Co And Check Their Reviews.",
          "This One Might Be A Little Harder To See. You Have Been Given A Great Developer To Work With. Let's Call Him Sam Trudeau (Which Is A Fictious Name). You Are Chatting A Lot And He Is Having A Great CV And Went To The University Of British Columbia That You Can See On His LinkedIn Profile. You Are Truly Blessed That A Trudeau Will Actually Be Part Of Your Software Team. A Little Digging Further And You Start To Realize That He Only Has 25 Contacts On LinkedIn. You Just Think, He Must Not Have Been The Biggest Networker Out There.",
          "The Reality Is That Most Likely This Person Is Pretending To Be Someone Else. Identity Theft Happens On A Daily Basis And People Are Eager To Get Through Them.",
          "This One Is Much Harder To Fake. Yet, It Is Not An All Size Fits One. Before You Start Drawing The Wrong Conclusion, Not Every Great Developer Uses Github. When They Do, They Usually Have A Significant History On There. For Comparison, This Is Mine. If A Developer Has A Limited History It Can(!) Be An Indication That They Have Made A Profile Just For Their \"Vancouver Adventure\". So Always Check The History On The Github Profiles, There Have To Be People That Coded On A Day-To-Day Basis For Years.",
          "To Conclude This One. Be Careful Of Who You Are Dealing With. Check Online Profiles And If None Of The People Seem To Have Any Hobbies Or Online Trace (Like Sports, Church, Hobbies, Etc) Than Is Normally Expected You Are Likely Dealing With A Scam. If You Can, We Always Recommend Visiting Your Tech Partner Especially If You Are Planning On Doing A Larger >$50K+ Project. Due Diligence Is Needed At All Times!",
          "I Have Seen People Being Scammed This Way Thinking They Have A $100.000 USD A Month Vancouver Developer Team, While In Reality The IT Team Including The Owner Is Located In Central Asia Where Salaries Are Significantly Lower And Quality IT Staffing At Par With The Americas Is Hard To Come By. Total Damage Can Be $25K - $3M. Yes, I Have Seen Multiple Millions. Most Of The Time, There Is A Skeleton Built, But The Real Product Is Not There. Hence, You Need Someone On Your End That Can Check The Progress Of Work Completed."
        ]
      },
      {
        "writtenBy": "Written by Niels Siskens"
      }
    ]
  }
]