[
  {
    "date": "July 22, 2022",
    "shortDescription": "The dollar is reaching levels that haven’t been reached in nearly 20 years.",
    "path": "/blog/2022-07-22-the-rise-of-the-dollar",
    "title": "The rise of the dollar",
    "details": [
      {
        "fullDescription": [
          "It is no secret that the Corona Virus Pandemic is a situation that greatly affected all of us, worldwide. Many aspects of our lives have been impacted, including the global economy. Now, although we are currently still experiencing this pandemic, we are also experiencing the consequences of the pause there was on the economy in 2020. ",
          "The rise of the dollar has been significantly rising, particularly over the last couple of weeks, and it has become a hot topic. According to “The U.S Economy Today,” the dollar is reaching levels that haven’t been reached in nearly 20 years. “Since the start of this year, it has gained 8 percent, and in the last 12 months, it has risen 14 percent.” As we are experiencing inflation after the pandemic, due to there being a stop in production of goods, prices are now spiking in almost everything. We are also experiencing some drastic situations around the world, such as times of uncertainty with the war between Ukraine and Russia, the zero-COVID policy in China, global sanctions on Russia, soaring commodity prices, and Europe and Japan’s economic slowdown. This caused global investors to store their cash in the U.S. for “safekeeping,” which consequently contributed to the dollar to going up.",
          " The U.S. is buying more goods from other countries, which is helpful, however, this is causing things to get more expensive in other countries. As commodities such as oil and nickel are priced in dollars, this means other countries have to pay more to convert their currency into dollars to buy it. The Federal Reserve is trying to fight high inflation in the U.S, and according to the article “U.S. dollar touches 20-year high as markets shun risk,” Minneapolis President of the Federal Reserve Neel Kashkari said the U.S. bank may not get as much aid from easing supply chains as it is hoping for in helping to cool inflation. The Federal Reserve is making attempts to help lower inflation without tilting the economy into a recession, however it is expected there will be more rate hikes. It is a dangerous time for the economy, and there is speculations and chances of a recession."
        ]
      },
      {
        "writtenBy": "Written by Natalie Montoya"
      }
    ]
  },
  {
    "date": "July 14, 2022",
    "shortDescription": "Technology has become a part of our daily lives, more than we may be aware of.",
    "path": "/blog/2022-07-14-best-technology-products-in-2022",
    "title": "Best technology products in 2022",
    "details": [
      {
        "fullDescription": [
          "",
          "There are always tons of innovative products coming out on the market, and most of them are worth the hype. ",
          "Many technology products help improve our quality of life, including our health. For example, after the pandemic, many new technology gadgets have come out on the market in the fitness industry, such as the VAHA S Fitness Mirror.",
          "When people were no longer able to go to the gym, technology found a way to make the gym come to us. The VAHA S Fitness Mirror is a full-size mirror that allows you to have access to 850 workout classes all from the comfort of your home, while also providing you with personal trainers in real-time.",
          "The mirror is a 32-inch Full HD touchscreen mirror with speakers, that gives you an HD workout experience all while being able to workout from home. ",
          "Another great technological invention in the fitness industry that has come out on the market is the Therabody Wave Roller, which takes a regular foam roller and adds vibration therapy and wave-style texture to help work out all of your aches and pains. This is a great gadget for those in the fitness industry/ lifestyle, who know how painful and uncomfortable one may feel when sore. ",
          "This tool helps soothe and ease pain and discomfort, which is extremely beneficial and necessary after working out the body’s muscles.",
          "Additionally, another technology product out on the market is an electric bike that can be folded. The new GoCyle G4 electric bike differs from other electric bikes as it allows you to fold the bike, which is super convenient as it can be easily taken with you to many places. ",
          "For those who are constantly on the go and depend on public transportation, this bike can be a great investment. In addition, similarly to how there are many electric bikes on the market, there are many drones on the market. ",
          "However, a new drone has come out with never before seen features. The Skydio 2+ is a new drone that has different camera speeds, and allows you to choose different camera movements as well as different speeds. Through technology known as “Keyframe,” you can plan out routes that the Skydio 2+ will follow. ",
          "The Meeting Owl Pro, although may be considered a more simpler gadget, is one of the most efficient considering the times we are living in. The Meeting Owl Pro works for those who work remotely, which after the pandemic increased significantly. It replicates an in person meeting, while being separated from colleagues as it comes with a 360 degree camera, 8 microphones and a speaker.",
          "It also has an automatic zoom that responds to who is speaking at the time with an 18 foot audio radius integrating Zoom, Slack, and more. This is perhaps one of the most useful technological tools in my opinion, and very creative.",
          "Technological advancements are always improving and seeking new ways to improve, to make life easier. Remote work has become essential, and has transformed our lives in many ways, and through the use of technology such as The Meeting Owl Pro, it continues to keep us integrated and connected with one another, even if from a distance. ",
          "New technological advances are constantly coming out, and it is good to be informed of the latest gadgets that could potentially be useful to us.",
          "Similar to the very well known GoPro, the DJI Action 2 is gaining much popularity in the action camera market. The DJI Action 2 is water, dust, and dirt proof, and can easily be attached to a tripod, waterproof cases, a screen, and other features. It also offers 4k, 120fps footage and image stabilisation. These newest technology products out on the market are great products that offer many different services, depending on the product, all which can help facilitate your life and improve your lifestyle.",
          ""
        ]
      },
      {
        "writtenBy": "Written by Natalie Montoya"
      }
    ]
  },
  {
    "date": "July 08, 2022",
    "shortDescription": "Strategic marketing is marketing with a specific purpose and intention.",
    "path": "/blog/2022-07-08-what-is-strategic-marketing",
    "title": "What is Strategic Marketing?",
    "details": [
      {
        "fullDescription": [
          "",
          "",
          "It is marketing targeted to a particular audience or population, advertising a product or service effectively and strategically. First and foremost, when marketing strategically, one must plan; this is the very first step in strategic marketing. Here, one must develop a specific goal or objective and plan how you will execute it to reach these goals. ",
          "Planning is of utmost importance with strategic marketing, as here, one must brainstorm how to differentiate yourself from your competitors. When planning and setting goals and objectives, one must create a specific timeline and schedule to stay on task and on time; this will encourage you to meet your goals in a particular frame of time and will help you stay organized and on task. Try to ensure your goals and objectives are attainable, particularly in the time frame desired.",
          "Once you have your concrete plan, you can move on to the next step, the analyzing phase. In this step, one must research the market you are advertising for, competitors, and industry. One must also make sure there is demand for the product or service you are planning to market, so this next phase is where you conduct all your research. When researching the market, you will better understand the market field for your product or service. When analyzing the market you plan to advertise for, an essential tip is to look at competitors’ customer testimonials. When researching other’s testimonials, you can see your competitor’s strengths and weaknesses and use their shortcomings in your favor.",
          "After you have planned and researched, you can begin to develop and clearly define your product offering. Here you will build your marketing plan, and you will come up with the strategies you will use to execute your marketing plan. During this phase, you should have a set price on your product offering; you should know where your product will be sold (whether online and on what website, or in-store and what store), and lastly, how you will promote your product. However, it is essential to be aware that strategic marketing may have some obstacles. For example, strategic marketing can be expensive, as marketing campaigns, research, and advertising can be pricey. As a company, one must try to outweigh the pros and cons and decide whether strategic marketing is suitable for you and your services or products.",
          "Once you have completed these steps and sorted them out, you may begin the final step, which is implementing all your efforts after planning and researching. Strategic marketing is having all your resources in order to market your product/services in the most effective way possible. After you have a thorough idea of who your target audience is, what the value of your product is, and how to execute your marketing strategies, you should be able to meet your goal objectives set during the very initial step. ",
          "A clear understanding of a marketing strategy will allow you to reach the customer better, meet your goals and objectives, and attract more customers. Differentiating your marketing through strategic marketing is essential as this is your opportunity to stand out from your competitors and be different from the rest. Strategic marketing helps others distinguish you and your services, which is vital in the competitive market. It also enables you to understand better the industry you are engaged in, as it requires you to do some extensive research and have a thorough understanding of the competitive market of your product. If done wisely and in the correct form, strategic marketing is a valuable marketing tactic that can significantly benefit you and your business.",
          "",
          "References for “What is Strategic Marketing”",
          "",
          "",
          ""
        ]
      },
      {
        "writtenBy": "Written by Natalie Montoya"
      }
    ]
  },
  {
    "date": "June 29, 2022",
    "shortDescription": "Not only do consumers benefit from inclusivity in marketing.",
    "path": "/blog/2022-06-29-inclusivity-diversity-and-lgbtq-community",
    "title": "Inclusivity, Diversity, and LGBTQ Community",
    "details": [
      {
        "fullDescription": [
          "",
          "Not only do consumers benefit from inclusivity in marketing, however companies and brands are also able to expand their consumer market as well as they reach and target more groups in their advertisements. June, which is considered the month of Pride, is the month where  not only do we celebrate the rights of the Lesbian, Gay, Bisexual, Transgender, and the Queer community, however, companies have the opportunity to demonstrate their support for the community and inclusivity in their marketing strategies.",
          "",
          "Here are some ways in which we can all support the LGBTQ community through marketing in branding. It is important to remember, however, that more important than justmarketing, your company practices what they preach, and treats everyone with inclusivity and equality as well. Your company can be an ally to the LGBTQ community by,"
        ]
      },
      {
        "writtenBy": "Written by Natalie Montoya"
      }
    ]
  }
]