[
  {
    "date": "March 12, 2020",
    "shortDescription": "Engage with Niels Siskens our founder and CEO on how to prepare your company for a downturn.",
    "path": "/blog/2020-03-12-preparing-your-company-for-a-downturn",
    "title": "Preparing Your Company For A Downturn",
    "details": [
      {
        "fullDescription": [
          "“You have to make sure you reduce your costs in order to stay competitive” - my boss at the time told me. It was early 2009 and the financial crisis had reached Europe.",
          "At the time, I did not really understand what he was referring too, but a decade later I full understand what he meant and have lived it myself. As an entrepreneur you are looking at value for everything you pretty much procure. At the beginning of a downturn, sales becomes more difficult and prices are going down. If you are a supplier of some sorts to another business, becoming more efficient and being able to lower your prices can give you the edge and make you stay in business.",
          "Fast forward 11 years, I have been able to change careers from a Procurement Consultant to being an entrepreneur and this life lesson sticks with me until today.",
          "The outsourcing industry usually thrives in a downturn as many companies are scrambling to get cheaper resources. However, I am in the strong opinion that it might be too late to outsource at that stage. While you were enjoying fairly high margins and did not really care about the procurement side of things, this might not have been the same for your competitors. So, while you need to find an outsourcing partner, they are kicking your ass as they already have setup a team remotely.",
          "What is more, your competitors are already in “Partnership mode” with their outsourcing provider and have had optimizations along the way. So, even if you were to obtain the same hourly rates, your competitors are more efficient and this can still give them the edge.",
          "We are in the strong opinion however that in tech outsourcing not only prices can give you the edge. When selecting an outsourcing provider also consider things as (1) Timezones (2) Cultural Backgrounds and (3) Training in Tech Resources / Availability.",
          "So, given the current bear in the Stock Market, it is time to start thinking strategically and reduce costs where you can. At Parrolabs we already made the decision to reduce costs in terms of Office in order to be able to offer a better price level to our clients. We are thinking longer term as we believe there will always be a need for technical resources and have made some Capex investments."
        ]
      },
      {
        "writtenBy": "Written by Niels Siskens"
      }
    ]
  },
  {
    "date": "March 05, 2020",
    "shortDescription": "Learn why animations play a big role in your website from the perspective of a graphical designer.",
    "path": "/blog/2020-03-05-the-5-main-reasons-you-should-never-launch-a-website-without-animation-in-2020",
    "title": "The 5 Main Reasons You Should have Animation In Your Website",
    "details": [
      {
        "fullDescription": [
          "Ever since the web evolved into web 2.0 in the early 2000-sands, web pages that had any moving elements on them got more traction. As people were invited to interact with the elements present on the page. An example that comes to mind is the historical website created for the promotion of the movie Space Jam. Through its design and small animated gifs gave a new sense to user interaction.",
          "In the past, hardware restrictions both on the server side as well as on the user side restricted the quality, length and volume of animations a website could bear. Today, with advances in mobile devices, tablets and desktop computers this no longer is a restriction. Ever since the creation of HTML 5, animations have become easier to implement.",
          "So here is my personal opinion as to why every website should use animations",
          "1. They are an aesthetic support of great value",
          "Modern looking animations give a website a modern look. It’s aesthetic gives it a look that distinguishes it from a website that was created let’s say 5 or 10 years ago. Browsing an older website is rough and slow, loading times oftimes do not live up to current Users who more often times than not are on their mobile phones. Having animations attracts people to interact with the page, leading to improvements of conversions.",
          "2. They are attractive to the public.",
          "Let's be honest, who doesn't like animated graphics?. In social networks video content is much more attractive than an static image. Interaction between the animation and the user creates a whole new experience. This tactic works just fine on social platforms, why not on websites?.",
          "3. They serve as instructions for visitors.",
          "Somehow, blinking buttons get Users attention. In Video Games these are used to push people in the right direction, so they do not get stuck (and likely lose interest in the game). In websites, these can be used to guide people in the right direction. For example to buy a product or to submit a form.",
          "4.They are simple to integrate into a website.",
          "Years ago, it was very difficult to implement any type of animated graphics into websites. The lack of Frameworks and documentation meant that developers were largely on their own. That said, hardware restrictions also meant that animations were limited. Additionally, most websites were using the then popular Flash Technology, which was proprietary and owned by Adobe Corporation.",
          "These days, it is extremely easy to add interaction to virtually anything on a website. There are countless frameworks and video editing software makes it easy to add Video’s or animations to any sort of website.",
          "The only restriction that we are still experiencing is that a background video that automatically loads will affect the size of the website and thus the pagespeed. That being said, there are certain tricks that can circumvent this issue. Webflow is an example of a tool that allows the integration of motion graphics into websites. A key factor that allows this kind of integration is modern day hardware which is powerful enough to handle the job.",
          "5. Rising popularity in modern web pages.",
          "As we previously discussed in social networks video and animations attracts more people than static images. Nowadays, users are not interested in spending time in a video or animation unless it is attractive to them. Implementing interactive and animated content it’s a must in today's world.",
          "These are the five reasons why you should integrate animations into your website. Taking advantage of the fact that in recent years the internet has been changing and improving. Nowadays users have more interactive experience with webpages."
        ]
      },
      {
        "writtenBy": "Written by Samuel Galvis"
      }
    ]
  },
  {
    "date": "February 27, 2020",
    "shortDescription": "Learn from one of our assistants what is like to work at Parrolabs.",
    "path": "/blog/2020-02-27-my-year-as-a-digital-marketing-virtual-assistant-at-a-cloud-specialist",
    "title": "My Year As a Digital Marketing Virtual Assistant At a Cloud Specialist",
    "details": [
      {
        "fullDescription": [
          "As an ambitious person, I entered this company thinking that it would give me the opportunity to improve my English Level. My expectations were high from the beginning as I had no idea what I wanted to work on and this company gave me the opportunity to work in the Digital Marketing area. I have been with them over a year now and we are like a small family. At Parrolabs, you can express how you feel, provide your opinion, and we work closely in a team with various skills.",
          "As an Augmented Digital Marketing Assistant, I am working directly for a US based client. Parrolabs has this model where we work directly with North American Companies and deliver them augmented skilled people from Latin America. As we are strategically located in Medellin, we are always close to our clients. My client is located in Los Angeles as such, we only have two or three hour time difference. That in contrast to other Outsourcing Companies who sometimes have more than 12 hours in time difference.",
          "My client manages Cloud infrastructure for Medium and Large Corporations. They are experts in this field and I am helping them to grow their business. Some of the activities that I do, include; Social Media Posting, Prospecting, Email Marketing and Event Coordination. Even though I am working remotely from another country, I try to be as close as possible to the team via Zoom, Slack and Email.",
          "Being part of both teams has really taught me how to multitask and be a proactive person. Over the last year, I have seen the Parrolabs team mature as well as that I have been able to grow professionally. My ambitions for the next two years are to grow into a fully fledged digital marketing professional. As such, I am currently studying in detail more about Email Marketing, SEM, SEO and Social Media Marketing. Parrolabs has shifted my career and I am now focussed on Digital Marketing.Learn from one of our assistants what is like to work at Parrolabs."
        ]
      },
      {
        "writtenBy": "Written by Karen Gutierrez"
      }
    ]
  },
  {
    "date": "February 20, 2020",
    "shortDescription": "Small glance to Redux Saga and how to start to handle asynchronous request in React.",
    "path": "/blog/2020-02-20-redux-saga-to-handle-asynchronous-request-in-react",
    "title": "Redux Saga to Handle Asynchronous RequestIin React",
    "details": [
      {
        "fullDescription": [
          "Javascript is a great programming language, as time goes by there are more and more new tools based on it, like React Js.",
          "We will review the usage of Redux Saga, which is a middleware library used to control side effects in React projects. To understand this article, a medium knowledge level in React and Redux is required.",
          "The Side Effects received are requests made mainly by us to obtain data from different sources. In general they are API's request or external services. Browser cookies interaction, databases and real time operation.",
          "Normally, In a React project these functionalities are implemented through a life cycle of a component with the code inside of the same file. Small projects are a great solution. When we have a big project we need to have the side effects centralized and Redux Saga Middleware comes in handy.",
          "The redux structure presents: Actions, Actions Creators, Reducers and a Single Store and thanks to Redux we know concepts like: Render, Props, State, Context, Lifecycle, Events.",
          "Reduce Saga aims to make handling side effects so we can introduce a new concept: Sagas, the saga is like a separate thread in your application that's solely for side effects, as the following shows:",
          "The sagas run like middleware because it has Watchers and Workers. The watchers intercept the actions and review a worker to this action and in this case, run the worker function where the steps to resolve the side effect and carry data to store.",
          "Redux Saga is based on Generator Functions, which are functions that can be exited and later re-entered and their context (Variable Binding) will be saved across re-entrances. Its syntax use asterisk to define a function* and the expression yield / yield*, to program steps, pause the function and give a value or delegate to another generator function respectively.",
          "Redux Saga has helpers and effects creators, to see more about it, check out this presentation​ ",
          "Some advantages of use Redux Saga Middleware:",
          "Reference:",
          "https://redux-saga.js.org/​ "
        ]
      },
      {
        "writtenBy": "Written by Maria Giraldo"
      }
    ]
  }
]