[
  {
    "date": "May 07, 2020",
    "shortDescription": "AI has evolved through the years, now it's at a point where we have to start paying attention to it.",
    "path": "/blog/2020-05-07-is-artificial-intelligence-a-threat-to-our-society",
    "title": "Is Artificial Intelligence A Threat To Our Society?",
    "details": [
      {
        "fullDescription": [
          "It is an interesting idea that Artificial Intelligence (AI) would somehow take over the world. That being said, cambridge analytica already hacked our Democracies around the world and was (and its successors likely are) heavily using AI.",
          "AI is also being used on the battlefield, think drones that scan the earth's surfaces and AI can be a very useful tool to filter out objects of interest. In our beloved Medellin, the government recently installed camera's throughout the city that through AI can scan not only every license plate, but also every face and can see where that person has been in previous days, weeks or months. This new AI technology will potentially create an impact that we have not seen since the introduction of the internet.",
          "During the lockdown, we have come to realize that Governments have the ability to control pretty much our entire lives when we let them. So, if the government is able to scare people to stay in their houses, there might be a real threat to us when AI will be broadly rolled out.",
          "As many people have come to realize, the camera systems that are in place in Medellin when used correctly can help police to find Criminals quickly, but the same systems can be used to track dissidents or Journalists.",
          "As AI is currently in its infancy, there is no direct threat. However, it is not unthinkable that when AI is used more and more it can be used not only to track but also to control. For example a car that is self-driving could be locking up its passengers and bringing them to the police station for questioning.",
          "This might seem like a plot from a Hollywood movie, but can be turned into reality when AI is not controlled within an independent Body. It is a forceful tool.",
          "For now, luckily most AI applications are peaceful and can help society as more sophisticated products can be made without human labour. Overall, AI offers a real promise for the future. It is a tipping balance, and while there are threats to Society, the overall promise is more promising than its threats."
        ]
      },
      {
        "writtenBy": "Written by Niels Siskens"
      }
    ]
  },
  {
    "date": "April 30, 2020",
    "shortDescription": "Here's what its like to be an assistant in Parrolabs.",
    "path": "/blog/2020-04-30-my-experience-being-a-general-assistant",
    "title": "My Experience Being A General Assistant",
    "details": [
      {
        "fullDescription": [
          "When you hear the term general assistant, what do you think of? Some people might imagine the role as a secretary using a skirt and filing lots of papers, some others might imagine it as someone following administrative tasks. These might be correct, because something general is something without limits, being considered as inexact or undetailed. So to describe what a general assistant does, from my meandering experience, I would say it is basically to give help to daily management tasks.",
          "When I started working in Parrolabs, all that was required was a good level of English and openness to learn. I had already worked before as an adviser, and I kind of thought it was going to be something similar. However, my job was very different and much more diverse. I have been providing support to some development projects, like arranging copy, changing information, helping the QA team and many other smaller tasks. I didn’t know anything about development or digital companies, but I was willing to learn, and I did.",
          "As time passed and the team changed, I gained more responsibilities, mostly related with administration, human resources and accounting. I can say that there is no to-do list, almost every day requires something new; conducting market research, updating and filling databases, writing content for social media, keeping invoices, paying workers, are just some of the tasks.",
          "The main things that I need to have in order to be successful are a good attitude, discipline and order. It is also necessary to have the ability to receive many tasks and organise them in such a way that we can do them all. Grateful for my experience, with the knowledge gained, I can say Parrolabs has helped me to improve in many ways and prepare me for the future."
        ]
      },
      {
        "writtenBy": "Written by Sofia Velasquez"
      }
    ]
  },
  {
    "date": "April 16, 2020",
    "shortDescription": "The situation that the entire world is experiencing today may be improved.",
    "path": "/blog/2020-04-16-some-positive-aspects-of-working-from-home",
    "title": "Some positive aspects of Working From Home!",
    "details": [
      {
        "fullDescription": [
          "The situation that the entire world is experiencing today more than a catastrophe has become a challenge. This has tested our solidarity, trust, recursiveness and even our emotional resistance. Spending hours, days and even weeks in the same place might be challenging for many. Our homes have taken a new role in our lives since it is now an office, a classroom, a gym, and even an amusement park. Where activities and our daily routine has to be different. Getting along with the people you live with might be hard, but we need to make through this time.",
          "We are all going through an extreme situation at the moment. The world economy is being severely affected, people with fewer resources are seriously suffering. That being said, from change comes opportunity and as such our society is experiencing the beginning of a new era. What we are experiencing today is changing our way of thinking, studying, feeling, and working will change forever.",
          "Remote working or Work From Home (WFH) changed from a \"fashion\" to an absolute must. Many entrepreneurs and works alike had to adapt to his new reality and teams are now working remotely entirely. Where in Colombia, distrust is the main obstacle, most employers are now forced to quickly change. We should take this time to include the wonders of technology in our daily lives. This new era invites us to change, where we don’t let our dreams, goals, jobs, and education down. We will come out of this situation by commerce digitization, digital marketing and creating new technologies to help us under any circumstances.",
          "This will also change the way we live. Think about the fact that we may no longer need to live in Packed Cities, but can live more remotely, can travel and live in different places. All due to the fact that we finally embraced the fact that we no longer needed to be face-to-face. The result will likely be that we live longer happier lives.",
          "Today more than ever we have the challenge of working online, humanizing brands, and digitizing processes. Where Colombia is a heavily paper-based society, it will need to catch up if it were to upgrade itself into the 21st century. More than ever before, we need to embrace the 4th Industrial Revolution. We might finally see the need for good User Focussed Design, Great Web & Mobile Development, and Digital Marketing."
        ]
      },
      {
        "writtenBy": "Written by Angela Quinchia"
      }
    ]
  },
  {
    "date": "April 03, 2020",
    "shortDescription": "An environmental catastrophe should have happened years ago how can we prevent it from happening?",
    "path": "/blog/2020-04-03-life-as-we-know-it-should-have",
    "title": "Life As We Know It….Should Have Ended",
    "details": [
      {
        "fullDescription": [
          "All it took for humanity to slow down is a Virus that is more deadly than the seasonal flu, yet nowhere near any of the viruses that our ancestors had to deal with. That is the reality that we are living in today.",
          "As I am contributing to our blog, I am locked in a small apartment as we are fighting what can be my generation's war. That being said, I feel that overall it was Mother Nature starting to send a message and the message is that we are not on the right track.",
          "For years, environmentalists represented most recently by an 18 year old in the name of Greta Thunberg, have been saying we are not on the right track. I was horrified to read that Carnival Cruises pollutes 10-times more than all European Cars Combined ([Luxury cruise giant emits 10 times more air pollution (SOx) than all of Europe's cars – study | Transport & Environment](https://www.transportenvironment.org/press/luxury-cruise-giant-emits-10-times-more-air-pollution-sox-all-europe%E2%80%99s-cars-%E2%80%93-study)). Ironically, one of the first Covid-19 outbreaks was on a cruise-ship.",
          "The Coronavirus does bring people together and makes society more friendly. So now we know that we do not own planet earth, it is good to make use of the time we have to spend indoors for some reflection. It is still not too late to change our course and change the planet and make it more hospitable. For many year, the city that I currently live in, Medellin has been struggling with Air Pollution. However, in 2 weeks of isolation, the city has turned that around and the air is as pure as it ever was.",
          "I do think the current quarantine is an excellent opportunity to reflect on our lives and change it for the better. I would say, we owe it to not just Greta Thunberg, but to ourselves. Most of our most urgent problems aren't difficult to fix from a technological perspective, but it is more that we need to agree as human beings that we should make it a priority. From long supply lines that impact not only our health, but the environment to industrial practices. We can do much better than where we are right now.",
          "I feel that one thing that COVID-19 will bring is a realization that we do need to change course for the better and that we do have the opportunity to all be connected while not being physically connected.",
          "So, while I do fear for our near future, I do think that we are up for a carbon footprint free society and that COVID-19 will bring the change that was overdue for at least 10 years.",
          "Let's be clear, I am not your typical environmentalist, yet I do understand that we need to change course and I think that one pandemic can make us reflect and bring us back on course. Maybe we don't need as much oil to be happy, maybe all it takes is one pandemic and a couple of think-weeks to get things sorted out."
        ]
      },
      {
        "writtenBy": "Written by Niels Siskens"
      }
    ]
  }
]